
Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    
	тзДанные = Новый ТаблицаЗначений;
	Для Каждого ЭлементМассива Из мсДанные Цикл
	    Если тзДанные.Колонки.Количество() = 0 Тогда
	        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				МассивДопустимыеТипы = Новый Массив;
				ТипКолонки = ТипЗнч(ЗначениеСтруктуры.Значение); 
				МассивДопустимыеТипы.Добавить(ТипКолонки);                     
				Описание_Типов = Новый ОписаниеТипов(МассивДопустимыеТипы);
				Если Описание_Типов = Новый ОписаниеТипов("Строка") Тогда
					КвалификаторыСтроки = Новый КвалификаторыСтроки(100);
					Описание_Типов = Новый ОписаниеТипов("Строка",,КвалификаторыСтроки);	
				КонецЕсли;
				тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ,Описание_Типов);
	        КонецЦикла;
	    КонецЕсли;
	    НоваяСтрока = тзДанные.Добавить();
	    Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	        НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
	    КонецЦикла;
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции

Функция ПолучитьЗначениеСлужебнойПеременной(Переменная, ЗначениеПоУмолчанию = Неопределено) Экспорт
    
    прВернуть = ЗначениеПоУмолчанию;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    ЗначенияСлужебныхПеременных.Значение
        |ИЗ
        |    РегистрСведений.ЕТС_ЗначенияСлужебныхПеременных КАК ЗначенияСлужебныхПеременных
        |ГДЕ
        |    ЗначенияСлужебныхПеременных.Переменная = &Переменная";

    Запрос.УстановитьПараметр("Переменная", Переменная);

    Результат = Запрос.Выполнить().Выбрать();
	
    Если Результат.Следующий() Тогда
        прВернуть = Результат.Значение;
    КонецЕсли;
    
    Возврат прВернуть;
    
КонецФункции

Процедура ЗаполнитьПоставщикаВЗаказеКлиента(Форма) Экспорт

	Для каждого СтрТЧ Из Форма.Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрТЧ.ВидЦены) Тогда
			Назначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрТЧ.ВидЦены,"Назначение");
			Если Назначение = Перечисления.НазначенияВидовЦен.ИндивидуальныйДляПартнера Тогда
				СтрТЧ.ЕТС_Поставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрТЧ.ВидЦены,"ЕТС_Партнер");
			Иначе 
				СтрТЧ.ЕТС_Поставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрТЧ.ВидЦены,"ЕТС_Склад");
			КонецЕсли;
			СтрТЧ.Поставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрТЧ.ЕТС_Поставщик,"Наименование");
		КонецЕсли;
		Если СтрТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда
			СтрТЧ.Резерв = 0;
		Иначе 	
			СтрТЧ.Резерв = СтрТЧ.КоличествоУпаковок;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьУпаковкуНоменклатуры(Номенклатура) Экспорт
    
    Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	Если Номенклатура.ИспользоватьУпаковки Тогда
    
		Запрос = Новый Запрос;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Ссылка КАК Значение
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
			|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения";

		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	  	Если Номенклатура.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда 
			Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Иначе
			Запрос.УстановитьПараметр("Владелец", Номенклатура.НаборУпаковок);
		КонецЕсли;

	    Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 1 Тогда
	        Упаковка = Результат[0].Значение;
		КонецЕсли;
	КонецЕсли;
    
    Возврат Упаковка;
    
КонецФункции

Функция ПреобразоватьМассивВКолонкуТаблицыЗначений(мсДанные, ИмяКолонки) Экспорт
    
    тзДанные = Новый ТаблицаЗначений;
	ТипСтрока0 = Новый ОписаниеТипов("Строка");
	КвалификаторыСтроки = Новый КвалификаторыСтроки(100);
	ТипСтрока100 = Новый ОписаниеТипов("Строка",,КвалификаторыСтроки);	
	МассивДопустимыеТипы = Новый Массив;
	Для Каждого ЭлементМассива Из мсДанные Цикл
		ТипКолонки = ТипЗнч(ЭлементМассива);
		Если ТипКолонки = ТипСтрока0 Тогда
			ТипКолонки = ТипСтрока100;
		КонецЕсли;
		Если МассивДопустимыеТипы.Найти(ТипКолонки) = Неопределено Тогда
    		МассивДопустимыеТипы.Добавить(ТипКолонки);
		КонецЕсли;
	КонецЦикла;
    Описание_Типов = Новый ОписаниеТипов(МассивДопустимыеТипы);
 	тзДанные.Колонки.Добавить(ИмяКолонки,Описание_Типов);

	Для Каждого ЭлементМассива Из мсДанные Цикл
		НоваяСтрока = тзДанные.Добавить();
        НоваяСтрока[ИмяКолонки] = ЭлементМассива;
    КонецЦикла;
    
    Возврат тзДанные;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;   

КонецФункции
