
&ИзменениеИКонтроль("УстановитьБлокировкиДанныхДляРасчетаГрафика")
Процедура ЕТС_УстановитьБлокировкиДанныхДляРасчетаГрафика(ТаблицаОбъектовОплаты, ИмяТаблицы, ИмяПоля, ИмяКолонки)
#Удаление
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаОбъектовОплаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ИмяПоля, ИмяКолонки);
	Блокировка.Заблокировать();
#КонецУдаления
КонецПроцедуры
