
&ИзменениеИКонтроль("СоздатьСчетНаОплату")
Процедура ЕТС_СоздатьСчетНаОплату(МассивСсылок, ПараметрыВыполнения)
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;

#Удаление
	ДокументОснование = ПродажиВызовСервера.ПолучитьОснованиеДляСчетаНаОплату(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);

	ОткрытьФорму(
	"Документ.СчетНаОплатуКлиенту.Форма.ФормаСозданияСчетовНаОплату",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно);

#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	СсылкаНаДокумент = ЕТС_ОбщиеКомандыСервер.ЕТС_СоздатьСчетНаОснованииЗаказаКлиента(ПараметрКоманды);
	
	ОткрытьЗначение(СсылкаНаДокумент);
	
	//Форма = ПолучитьФорму("Документ.СчетНаОплатуКлиенту.ФормаОбъекта");
	//ДанныеФормы = Форма.Объект;
	//ЗаполнитьДокНаСервере(ДанныеФормы);
	//ЕТС_ОбщиеКомандыСервер.ЕТС_СоздатьСчетНаОснованииЗаказаКлиента(ПараметрКоманды, ДанныеФормы);
	//КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	//Форма.Открыть();
	
	//ДокументОснование = ПродажиВызовСервера.ПолучитьОснованиеДляСчетаНаОплату(ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);

	//ОткрытьФорму(
	//"Документ.СчетНаОплатуКлиенту.Форма.ФормаСозданияСчетовНаОплату",
	//ПараметрыФормы,
	//ПараметрыВыполненияКоманды.Источник,
	//ПараметрыВыполненияКоманды.Уникальность,
	//ПараметрыВыполненияКоманды.Окно);


#КонецВставки
КонецПроцедуры
