
&После("УстановитьУсловноеОформление")
&НаСервере
Процедура ЕТС_УстановитьУсловноеОформление()
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	// Выделение цветом 
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	//Синий-всего хватает
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(51, 102, 255));
		
	//Зелёный-чего то не хватает
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(51, 153, 102));
	//Красный-всего не хватает
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
		
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(219, 88, 0));
	
КонецПроцедуры

&НаСервере
Процедура ЕТС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса =
			"	ВЫБРАТЬ
			|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
			|	ДокументЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументЗаказКлиента.Номер КАК Номер,
			|	ДокументЗаказКлиента.Дата КАК Дата,
			|	ДокументЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
			|	ДокументЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
			|	ДокументЗаказКлиента.Проведен КАК Проведен,
			|	ДокументЗаказКлиента.Приоритет КАК Приоритет,
			|	ДокументЗаказКлиента.Партнер КАК Партнер,
			|	ДокументЗаказКлиента.Контрагент КАК Контрагент,
			|	ДокументЗаказКлиента.Организация КАК Организация,
			|	ДокументЗаказКлиента.Соглашение КАК Соглашение,
			|	ДокументЗаказКлиента.Договор КАК Договор,
			|	ДокументЗаказКлиента.Сделка КАК Сделка,
			|	ДокументЗаказКлиента.Валюта КАК Валюта,
			|	ДокументЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
			|	ДокументЗаказКлиента.СуммаВозвратнойТары КАК СуммаВозвратнойТары,
			|	ДокументЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
			|	ДокументЗаказКлиента.Склад КАК Склад,
			|	ДокументЗаказКлиента.Статус КАК Статус,
			|	ДокументЗаказКлиента.Менеджер КАК Менеджер,
			|	ДокументЗаказКлиента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
			|	ДокументЗаказКлиента.СуммаАвансаДоОбеспечения КАК СуммаАвансаДоОбеспечения,
			|	ДокументЗаказКлиента.СуммаПредоплатыДоОтгрузки КАК СуммаПредоплатыДоОтгрузки,
			|	ДокументЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
			|	ДокументЗаказКлиента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ДокументЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
			|	ДокументЗаказКлиента.Комментарий КАК Комментарий,
			|	ВЫБОР
			|		КОГДА (НЕ ДокументЗаказКлиента.Проведен)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)
			|		ИНАЧЕ ЕСТЬNULL(СостоянияЗаказовКлиентов.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт))
			|	КОНЕЦ КАК Состояние,
			|	ВЫБОР
			|		КОГДА (НЕ ДокументЗаказКлиента.Проведен)
			|			ТОГДА ЛОЖЬ
			|		КОГДА СостоянияЗаказовКлиентов.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
			|		И &ДатаАктуальности > СостоянияЗаказовКлиентов.ДатаСобытия
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Просрочен,
			|	ВЫБОР
			|		КОГДА ДокументЗаказКлиента.Приоритет В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				Приоритеты.Ссылка КАК Приоритет
			|			ИЗ
			|				Справочник.Приоритеты КАК Приоритеты
			|			УПОРЯДОЧИТЬ ПО
			|				Приоритеты.РеквизитДопУпорядочивания)
			|			ТОГДА 0
			|		КОГДА ДокументЗаказКлиента.Приоритет В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				Приоритеты.Ссылка КАК Приоритет
			|			ИЗ
			|				Справочник.Приоритеты КАК Приоритеты
			|			УПОРЯДОЧИТЬ ПО
			|				Приоритеты.РеквизитДопУпорядочивания УБЫВ)
			|			ТОГДА 2
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КартинкаПриоритета,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК СуммаОтгрузки,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) < 0
			|			ТОГДА -ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК НашДолг,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) > 0
			|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ДолгКлиента,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная,
			|	СостоянияЭД.СостояниеЭДО,
			|	СостоянияЭД.ПредставлениеСостояния,
			|	ДокументЗаказКлиента.Автор,
			|	ДокументЗаказКлиента.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет,
			//Добавлено по отношению к типовой Начало
			|	ТЧ_Товары.Минимум КАК Минимум,
			|	ТЧ_Товары.Максимум КАК Максимум,
			//Добавлено по отношению к типовой Конец			
			|	&ДополнительныеПоляСостояниеEDI КАК ДополнительныеПоляСостояниеEDI
			|ИЗ
			|	Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			|		ПО (СостоянияЗаказовКлиентов.Заказ = ДокументЗаказКлиента.Ссылка)
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
			|		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)}
			//Добавлено по отношению к типовой Начало			
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗаказКлиентаТовары.Ссылка КАК Ссылка,
			|			МИНИМУМ(ЗаказКлиентаТовары.КоличествоУпаковок <= ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0)) КАК
			|				Минимум,
			|			МАКСИМУМ(ЗаказКлиентаТовары.КоличествоУпаковок <= ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0)) КАК
			|				Максимум
			|		ИЗ
			|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
			|				ПО ЗаказКлиентаТовары.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
			|				И ЗаказКлиентаТовары.Характеристика = ЗапасыИПотребностиОстатки.Характеристика
			|				И ЗаказКлиентаТовары.Склад = ЗапасыИПотребностиОстатки.Склад
			|				И ВЫБОР
			|					КОГДА ЗаказКлиентаТовары.Обособленно
			|						ТОГДА ЗаказКлиентаТовары.Ссылка.Назначение = ЗапасыИПотребностиОстатки.Назначение
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = ЗапасыИПотребностиОстатки.Назначение
			|				КОНЕЦ
			|		ГДЕ
			|			НЕ ЗаказКлиентаТовары.Отменено
			|		СГРУППИРОВАТЬ ПО
			|			ЗаказКлиентаТовары.Ссылка) КАК ТЧ_Товары
			|		ПО ДокументЗаказКлиента.Ссылка = ТЧ_Товары.Ссылка";
			//Добавлено по отношению к типовой Конец

КонецПроцедуры

&НаКлиенте
Процедура ЕТС_СписокПриАктивизацииСтрокиПосле(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьТаблицуДвжений(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДвжений(Ссылка)
	//Заполним таблицу движений!!!!!
	ЭтаФорма.ТаблицаДвижений.Загрузить(ЕТС_ОбщиеКомандыСервер.ПолучитьТаблицуДвиженийДляСпискаЗаказовКлиента(Ссылка));
	
КонецПроцедуры