
&После("СформироватьПредставлениеСостоянияПоСтатусу")
Процедура ЕТС_СформироватьПредставлениеСостоянияПоСтатусу(Форма, Статус, ТекущаяДата)
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует") Тогда
		ОбработатьОбъектприСменеСтатуса(Форма.Объект,Ложь);		
	Иначе
		ОбработатьОбъектприСменеСтатуса(Форма.Объект,Истина);		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьОбъектприСменеСтатуса(ДокументОбъект, Очищать)
	Для каждого стр Из ДокументОбъект.Товары Цикл
		Если Очищать Тогда
			Стр.Сумма 	  = 0;
			Стр.СуммаСНДС = 0;
		Иначе	
			Стр.Сумма 	  = Стр.Количество * Стр.Цена;
			Стр.СуммаСНДС = Стр.Количество * Стр.Цена;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
 
