
Процедура СформироватьДанныеТаможеннойДекларации(Параметры, АдресХранилища) Экспорт
	
	СтруктураРезультата = Новый Структура("Разделы, Товары, Ошибки", Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый Массив);
	
	ФайлXML = Параметры.ФайлXML;
	ИмяФайла = КаталогВременныхФайлов() + Формат(ТекущаяДата(), "ггггММддЧЧммсс") + "td.xml";
	ФайлXML.Записать(ИмяФайла);
	ДанныеXML = РазобратьXML(ИмяФайла, СокрЛП(Параметры.НомерДекларации), Параметры.ИспользоватьДопАртикул);
	УдалитьФайлы(ИмяФайла);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_Разделы.НомерРаздела КАК НомерРаздела,
		|	ТЗ_Разделы.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
		|	ТЗ_Разделы.СтавкаПошлины КАК СтавкаПошлины,
		|	ТЗ_Разделы.СуммаПошлины КАК СуммаПошлины,
		|	&СтавкаНДС КАК СтавкаНДС,
		|	ТЗ_Разделы.СуммаНДС КАК СуммаНДС,
		|	ТЗ_Разделы.НомерДляСФ КАК ГТД,
		|	ТЗ_Разделы.СтранаПроисхождения КАК СтранаПроисхождения
		|ПОМЕСТИТЬ ВТ_Разделы
		|ИЗ
		|	&ТЗ_Разделы КАК ТЗ_Разделы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Разделы.НомерРаздела КАК НомерРаздела,
		|	ВТ_Разделы.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
		|	ВТ_Разделы.СтавкаПошлины КАК СтавкаПошлины,
		|	ВТ_Разделы.СуммаПошлины КАК СуммаПошлины,
		|	ВТ_Разделы.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Разделы.СуммаНДС КАК СуммаНДС,
		|	&Склад КАК Склад,
		|	ВТ_Разделы.ГТД КАК ГТД,
		|	ЕСТЬNULL(СтраныМира.Ссылка, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения
		|ИЗ
		|	ВТ_Разделы КАК ВТ_Разделы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО ВТ_Разделы.СтранаПроисхождения = СтраныМира.КодАльфа2";
	
	Запрос.УстановитьПараметр("ТЗ_Разделы", ДанныеXML.Разделы);
	Запрос.УстановитьПараметр("Склад", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ПТУ,"Склад"));
	Запрос.УстановитьПараметр("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20));
	
	СтруктураРезультата.Разделы = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ_Товары.НомерРаздела КАК НомерРаздела,
		|	ТЗ_Товары.Артикул КАК Артикул,
		|	ТЗ_Товары.Количество КАК Количество,
		|	ТЗ_Товары.НомерДляСФ КАК НомерДляСФ,
		|	ТЗ_Товары.СтранаПроисхождения КАК СтранаПроисхождения
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПриобретениеТоваровУслугТовары.Номенклатура.Артикул КАК Артикул
		|ПОМЕСТИТЬ ТЧ_Товары
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.НомерРаздела КАК НомерРаздела,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	СУММА(ВТ_Товары.Количество) КАК Количество,
		|	ВТ_Товары.НомерДляСФ КАК НомерДляСФ,
		|	ЕСТЬNULL(ТЧ_Товары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(СтраныМира.Ссылка, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК Страна
		|ПОМЕСТИТЬ ТЧ_ТоварыСНоменклатурой
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧ_Товары КАК ТЧ_Товары
		|		ПО ВТ_Товары.Артикул = ТЧ_Товары.Номенклатура.Артикул
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО ВТ_Товары.СтранаПроисхождения = СтраныМира.КодАльфа2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.НомерРаздела,
		|	ВТ_Товары.Артикул,
		|	ВТ_Товары.НомерДляСФ,
		|	ЕСТЬNULL(ТЧ_Товары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|	ЕСТЬNULL(СтраныМира.Ссылка, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТЧ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ_ТоварыСНоменклатурой.Артикул КАК Артикул,
		|	ТЧ_ТоварыСНоменклатурой.НомерРаздела КАК НомерРаздела
		|ИЗ
		|	ТЧ_ТоварыСНоменклатурой КАК ТЧ_ТоварыСНоменклатурой
		|ГДЕ
		|	ТЧ_ТоварыСНоменклатурой.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
		//"ВЫБРАТЬ
		//|	ТЗ_Товары.НомерРаздела КАК НомерРаздела,
		//|	ТЗ_Товары.Артикул КАК Артикул,
		//|	ТЗ_Товары.АртикулДоп КАК АртикулДоп,
		//|	ТЗ_Товары.Количество КАК Количество,
		//|	ТЗ_Товары.НомерДляСФ КАК НомерДляСФ,
		//|	ТЗ_Товары.СтранаПроисхождения КАК СтранаПроисхождения
		//|ПОМЕСТИТЬ ВТ_Товары
		//|ИЗ
		//|	&ТЗ_Товары КАК ТЗ_Товары
		//|;
		//|
		//|ВЫБРАТЬ
		//|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Ссылка,
		//|	ПриобретениеТоваровУслугТовары.Номенклатура.Артикул КАК Артикул
		//|ПОМЕСТИТЬ ВТ_Номенклатура
		//|ИЗ
		//|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		//|ГДЕ
		//|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Товары.НомерРаздела КАК НомерРаздела,
		//|	ВТ_Товары.Количество КАК Количество,
		//|	ЕСТЬNULL(ВТ_Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		//|	ЕСТЬNULL(ВТ_Номенклатура1.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура1,
		//|	СтраныМира.Ссылка КАК Страна,
		//|	ВТ_Товары.Артикул КАК Артикул,
		//|	ВТ_Товары.АртикулДоп КАК АртикулДоп,
		//|	ВТ_Товары.НомерДляСФ КАК НомерДляСФ
		//|ПОМЕСТИТЬ ТЧ_Товары
		//|ИЗ
		//|	ВТ_Товары КАК ВТ_Товары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
		//|		ПО ВТ_Товары.АртикулДоп = ВТ_Номенклатура.Артикул
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура1
		//|		ПО ВТ_Товары.Артикул = ВТ_Номенклатура1.Артикул
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		//|		ПО ВТ_Товары.СтранаПроисхождения = СтраныМира.КодАльфа2
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.Номенклатура КАК Номенклатура
		//|ПОМЕСТИТЬ ВТ_ДопАртикул
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ТЧ_Товары.Номенклатура КАК Номенклатура
		//|	ИЗ
		//|		ТЧ_Товары КАК ТЧ_Товары
		//|	ГДЕ
		//|		НЕ ТЧ_Товары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		//|		И &ИспользоватьДопАртикул) КАК ВложенныйЗапрос
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТЧ_Товары.НомерРаздела КАК НомерРаздела,
		//|	СУММА(ТЧ_Товары.Количество) КАК Количество,
		//|	ТЧ_Товары.Страна КАК Страна,
		//|	ВЫБОР
		//|		КОГДА ВложенныйЗапрос.Номенклатура > 0
		//|			ТОГДА ТЧ_Товары.Номенклатура
		//|		ИНАЧЕ ТЧ_Товары.Номенклатура1
		//|	КОНЕЦ КАК Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ВложенныйЗапрос.Номенклатура > 0
		//|			ТОГДА ТЧ_Товары.АртикулДоп
		//|		ИНАЧЕ ТЧ_Товары.Артикул
		//|	КОНЕЦ КАК Артикул,
		//|	ТЧ_Товары.НомерДляСФ КАК НомерДляСФ
		//|ПОМЕСТИТЬ ТЧ_ТоварыСНоменклатурой
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДопАртикул.Номенклатура) КАК Номенклатура
		//|	ИЗ
		//|		ВТ_ДопАртикул КАК ВТ_ДопАртикул) КАК ВложенныйЗапрос,
		//|	ТЧ_Товары КАК ТЧ_Товары
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТЧ_Товары.НомерРаздела,
		//|	ТЧ_Товары.Страна,
		//|	ВЫБОР
		//|		КОГДА ВложенныйЗапрос.Номенклатура > 0
		//|			ТОГДА ТЧ_Товары.Номенклатура
		//|		ИНАЧЕ ТЧ_Товары.Номенклатура1
		//|	КОНЕЦ,
		//|	ВЫБОР
		//|		КОГДА ВложенныйЗапрос.Номенклатура > 0
		//|			ТОГДА ТЧ_Товары.АртикулДоп
		//|		ИНАЧЕ ТЧ_Товары.Артикул
		//|	КОНЕЦ,
		//|	ТЧ_Товары.НомерДляСФ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|УНИЧТОЖИТЬ ВТ_Товары
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|УНИЧТОЖИТЬ ВТ_Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|УНИЧТОЖИТЬ ВТ_ДопАртикул
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|УНИЧТОЖИТЬ ТЧ_Товары
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТЧ_ТоварыСНоменклатурой.Артикул КАК Артикул
		//|ИЗ
		//|	ТЧ_ТоварыСНоменклатурой КАК ТЧ_ТоварыСНоменклатурой
		//|ГДЕ
		//|	ТЧ_ТоварыСНоменклатурой.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТЗ_Товары", ДанныеXML.Товары);
	Запрос.УстановитьПараметр("ИспользоватьДопАртикул", Параметры.ИспользоватьДопАртикул);
	//Запрос.УстановитьПараметр("Производитель", Параметры.СписокПроизводителей);
	Запрос.УстановитьПараметр("Ссылка", Параметры.ПТУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МассивОшибок = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			МассивОшибок.Добавить("Не найдена номенклатура с артикулом " + Выборка.Артикул + " раздел " + Выборка.НомерРаздела);
		КонецЦикла;
		СтруктураРезультата.Ошибки = МассивОшибок;	
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|	ПриобретениеТоваровУслугТовары.Сумма КАК Сумма,
			|	ТЧ_ТоварыСНоменклатурой.НомерРаздела КАК НомерРаздела,
			|	ТЧ_ТоварыСНоменклатурой.Количество КАК Количество,
			|	ТЧ_ТоварыСНоменклатурой.НомерДляСФ КАК НомерДляСФ,
			|	ТЧ_ТоварыСНоменклатурой.Страна КАК Страна
			|ПОМЕСТИТЬ ВТ_ТЧТовары_ПТУ
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧ_ТоварыСНоменклатурой КАК ТЧ_ТоварыСНоменклатурой
			|		ПО ПриобретениеТоваровУслугТовары.Номенклатура = ТЧ_ТоварыСНоменклатурой.Номенклатура
			|ГДЕ
			|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЧТовары_ПТУ.НомерРаздела КАК НомерРаздела,
			|	СУММА(ВТ_ТЧТовары_ПТУ.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ВТ_ОбщаяСуммаВалПоРазделам
			|ИЗ
			|	ВТ_ТЧТовары_ПТУ КАК ВТ_ТЧТовары_ПТУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТЧТовары_ПТУ.НомерРаздела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОбщаяСуммаВалПоРазделам.НомерРаздела КАК НомерРаздела,
			|	ВТ_ОбщаяСуммаВалПоРазделам.Сумма КАК Сумма,
			|	ВТ_Разделы.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
			|	ВТ_Разделы.СуммаПошлины КАК СуммаПошлины,
			|	ВТ_Разделы.СуммаНДС КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА ВТ_ОбщаяСуммаВалПоРазделам.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Разделы.ТаможеннаяСтоимость / ВТ_ОбщаяСуммаВалПоРазделам.Сумма КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК Курс,
			|	ВЫБОР
			|		КОГДА ВТ_ОбщаяСуммаВалПоРазделам.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Разделы.СуммаПошлины / ВТ_ОбщаяСуммаВалПоРазделам.Сумма КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК КурсПошлины,
			|	ВЫБОР
			|		КОГДА ВТ_ОбщаяСуммаВалПоРазделам.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Разделы.СуммаНДС / ВТ_ОбщаяСуммаВалПоРазделам.Сумма КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК КурсНДС
			|ПОМЕСТИТЬ ВТ_Курсы
			|ИЗ
			|	ВТ_ОбщаяСуммаВалПоРазделам КАК ВТ_ОбщаяСуммаВалПоРазделам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Разделы КАК ВТ_Разделы
			|		ПО ВТ_ОбщаяСуммаВалПоРазделам.НомерРаздела = ВТ_Разделы.НомерРаздела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЧТовары_ПТУ.Номенклатура КАК Номенклатура,
			|	ВТ_ТЧТовары_ПТУ.Сумма КАК Сумма,
			|	ВТ_ТЧТовары_ПТУ.НомерРаздела КАК НомерРаздела,
			|	ВТ_ТЧТовары_ПТУ.Количество КАК Количество,
			|	ВТ_ТЧТовары_ПТУ.Страна КАК Страна,
			|	ВТ_ТЧТовары_ПТУ.НомерДляСФ КАК НомерДляСФ,
			|	ВЫРАЗИТЬ(ВТ_Курсы.Курс * ВТ_ТЧТовары_ПТУ.Сумма КАК ЧИСЛО(15, 2)) КАК ТаможеннаяСтоимость,
			|	ВЫРАЗИТЬ(ВТ_Курсы.КурсПошлины * ВТ_ТЧТовары_ПТУ.Сумма КАК ЧИСЛО(15, 2)) КАК СуммаПошлины,
			|	ВЫРАЗИТЬ(ВТ_Курсы.КурсНДС * ВТ_ТЧТовары_ПТУ.Сумма КАК ЧИСЛО(15, 2)) КАК СуммаНДС
			|ПОМЕСТИТЬ ВТ_ПредварительныйРасчет
			|ИЗ
			|	ВТ_ТЧТовары_ПТУ КАК ВТ_ТЧТовары_ПТУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Курсы КАК ВТ_Курсы
			|		ПО ВТ_ТЧТовары_ПТУ.НомерРаздела = ВТ_Курсы.НомерРаздела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщаяПоРазделамСуммированная.НомерРаздела КАК НомерРаздела,
			|	ВТ_Курсы.ТаможеннаяСтоимость - ОбщаяПоРазделамСуммированная.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
			|	ВТ_Курсы.СуммаПошлины - ОбщаяПоРазделамСуммированная.СуммаПошлины КАК СуммаПошлины,
			|	ВТ_Курсы.СуммаНДС - ОбщаяПоРазделамСуммированная.СуммаНДС КАК СуммаНДС
			|ПОМЕСТИТЬ ВТ_Копейки
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВТ_ПредварительныйРасчет.НомерРаздела КАК НомерРаздела,
			|		СУММА(ВТ_ПредварительныйРасчет.ТаможеннаяСтоимость) КАК ТаможеннаяСтоимость,
			|		СУММА(ВТ_ПредварительныйРасчет.СуммаПошлины) КАК СуммаПошлины,
			|		СУММА(ВТ_ПредварительныйРасчет.СуммаНДС) КАК СуммаНДС
			|	ИЗ
			|		ВТ_ПредварительныйРасчет КАК ВТ_ПредварительныйРасчет
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВТ_ПредварительныйРасчет.НомерРаздела) КАК ОбщаяПоРазделамСуммированная
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Курсы КАК ВТ_Курсы
			|		ПО ОбщаяПоРазделамСуммированная.НомерРаздела = ВТ_Курсы.НомерРаздела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЧТовары_ПТУ.Номенклатура КАК Номенклатура,
			|	ВТ_ТЧТовары_ПТУ.Сумма КАК Сумма,
			|	ВТ_ТЧТовары_ПТУ.НомерРаздела КАК НомерРаздела,
			|	ВТ_ТЧТовары_ПТУ.Количество КАК Количество,
			|	ВТ_ТЧТовары_ПТУ.Страна КАК Страна,
			|	КОЛИЧЕСТВО(ВТ_ТЧТовары_ПТУ1.Номенклатура) КАК НомерСортировки
			|ПОМЕСТИТЬ ВТ_НумерованнаяПоСуммамВозр
			|ИЗ
			|	ВТ_ТЧТовары_ПТУ КАК ВТ_ТЧТовары_ПТУ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТЧТовары_ПТУ КАК ВТ_ТЧТовары_ПТУ1
			|		ПО ВТ_ТЧТовары_ПТУ.Сумма <= ВТ_ТЧТовары_ПТУ1.Сумма
			|			И ВТ_ТЧТовары_ПТУ.НомерРаздела = ВТ_ТЧТовары_ПТУ1.НомерРаздела
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТЧТовары_ПТУ.Номенклатура,
			|	ВТ_ТЧТовары_ПТУ.Сумма,
			|	ВТ_ТЧТовары_ПТУ.НомерРаздела,
			|	ВТ_ТЧТовары_ПТУ.Количество,
			|	ВТ_ТЧТовары_ПТУ.Страна
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_НумерованнаяПоСуммамВозр.Номенклатура КАК Номенклатура,
			|	ВТ_Копейки.НомерРаздела КАК НомерРаздела,
			|	ВТ_Копейки.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
			|	ВТ_Копейки.СуммаПошлины КАК СуммаПошлины,
			|	ВТ_Копейки.СуммаНДС КАК СуммаНДС
			|ПОМЕСТИТЬ ВТ_КопейкиНаНоменклатуру
			|ИЗ
			|	ВТ_НумерованнаяПоСуммамВозр КАК ВТ_НумерованнаяПоСуммамВозр
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Копейки КАК ВТ_Копейки
			|		ПО ВТ_НумерованнаяПоСуммамВозр.НомерРаздела = ВТ_Копейки.НомерРаздела
			|ГДЕ
			|	ВТ_НумерованнаяПоСуммамВозр.НомерСортировки = 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ПредварительныйРасчет.Номенклатура КАК Номенклатура,
			|	ВТ_ПредварительныйРасчет.НомерРаздела КАК НомерРаздела,
			|	ВТ_ПредварительныйРасчет.Количество КАК Количество,
			|	ВТ_ПредварительныйРасчет.Количество КАК КоличествоУпаковок,
			|	ВТ_ПредварительныйРасчет.Страна КАК СтранаПроисхождения,
			|	&Ссылка КАК ДокументПоступления,
			|	&Склад КАК Склад,
			|	&СтавкаНДС КАК СтавкаНДС,
			|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ВТ_ПредварительныйРасчет.НомерДляСФ КАК НомерДляСФ,
			|	ВТ_ПредварительныйРасчет.ТаможеннаяСтоимость + ЕСТЬNULL(ВТ_КопейкиНаНоменклатуру.ТаможеннаяСтоимость, 0) КАК ТаможеннаяСтоимость,
			|	ВТ_ПредварительныйРасчет.СуммаПошлины + ЕСТЬNULL(ВТ_КопейкиНаНоменклатуру.СуммаПошлины, 0) КАК СуммаПошлины,
			|	ВТ_ПредварительныйРасчет.СуммаНДС + ЕСТЬNULL(ВТ_КопейкиНаНоменклатуру.СуммаНДС, 0) КАК СуммаНДС
			|ИЗ
			|	ВТ_ПредварительныйРасчет КАК ВТ_ПредварительныйРасчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КопейкиНаНоменклатуру КАК ВТ_КопейкиНаНоменклатуру
			|		ПО ВТ_ПредварительныйРасчет.Номенклатура = ВТ_КопейкиНаНоменклатуру.Номенклатура
			|			И ВТ_ПредварительныйРасчет.НомерРаздела = ВТ_КопейкиНаНоменклатуру.НомерРаздела
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерРаздела";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры.ПТУ);
		СтркутураПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПТУ,"Склад,ХозяйственнаяОперация");
		Запрос.УстановитьПараметр("Склад", СтркутураПТУ.Склад);
		Запрос.УстановитьПараметр("ХозяйственнаяОперация", СтркутураПТУ.ХозяйственнаяОперация);
		
		СтруктураРезультата.Товары = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресХранилища);
	
КонецПроцедуры

Функция РазобратьXML(ИмяФайла, НомерДекларации, ИспользоватьДопАртикул)

	СписокНоменклатуры = Новый Структура;
	
	// ОБРАБОТКА ХМЛ
	ХМЛ = Новый ЧтениеXML;
	ХМЛ.ОткрытьФайл(ИмяФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	Документ = ПостроительDOM.Прочитать(ХМЛ);
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(100);
	Описание_ТиповСтрока = Новый ОписаниеТипов("Строка",,КвалификаторыСтроки);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Разделы = Новый ТаблицаЗначений;
	Разделы.Колонки.Добавить("НомерРаздела",ОписаниеЧисла);
	Разделы.Колонки.Добавить("ТаможеннаяСтоимость",ОписаниеЧисла);
	Разделы.Колонки.Добавить("СтавкаПошлины",ОписаниеЧисла);
	Разделы.Колонки.Добавить("СуммаПошлины",ОписаниеЧисла);
	Разделы.Колонки.Добавить("СтавкаНДС",ОписаниеЧисла);
	Разделы.Колонки.Добавить("СуммаНДС",ОписаниеЧисла);
	Разделы.Колонки.Добавить("СтранаПроисхождения",Описание_ТиповСтрока);
	Разделы.Колонки.Добавить("НомерДляСФ",Описание_ТиповСтрока);
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("НомерРаздела",ОписаниеЧисла);
	Товары.Колонки.Добавить("Артикул",Описание_ТиповСтрока);
	Товары.Колонки.Добавить("АртикулДоп",Описание_ТиповСтрока);
	Товары.Колонки.Добавить("Количество",ОписаниеЧисла);
	Товары.Колонки.Добавить("СтранаПроисхождения",Описание_ТиповСтрока);
	Товары.Колонки.Добавить("НомерДляСФ",Описание_ТиповСтрока);
	Товары.Колонки.Добавить("Партия");
	Товары.Колонки.Добавить("ГТД",Описание_ТиповСтрока);
	
	СписокРазделов = Документ.ПолучитьЭлементыПоИмени("ESADout_CUGoods");    //Разделы
	Для каждого Раздел Из СписокРазделов Цикл
		
		НС = Разделы.Добавить();
		_НомерРаздела = 0;
		Для каждого СтрокаРаздела Из Раздел.ДочерниеУзлы Цикл
			
			Если СтрокаРаздела.ИмяУзла = "catESAD_cu:OriginCountryCode" Тогда
				КодСтраныРаздела = СтрокаРаздела.ТекстовоеСодержимое;
				
				ПоискВТаблицеСтран = КодСтраныРаздела;
				Если ПоискВТаблицеСтран <> Неопределено Тогда
					НС.СтранаПроисхождения = КодСтраныРаздела;
				Иначе
					Если КодСтраныРаздела = "EU" Тогда
						НС.СтранаПроисхождения = "";//Справочники.КлассификаторСтранМира.НайтиПоКоду("---");	
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
			Если СтрокаРаздела.ИмяУзла = "catESAD_cu:GoodsNumeric" Тогда
				_НомерРаздела = Число(СтрокаРаздела.ТекстовоеСодержимое);
				_НомерГТДРаздела = НомерДекларации + "/" + _НомерРаздела; // Номер ГТД раздела
				НС.НомерРаздела        = _НомерРаздела;
				НС.НомерДляСФ          = _НомерГТДРаздела;
				НС.СтавкаПошлины = 0;
				НС.СуммаПошлины = 0;
			КонецЕсли;
			
			Если СтрокаРаздела.ИмяУзла = "catESAD_cu:CustomsCost" Тогда
				_ТаможеннаяСтоимостьРаздела = Число(СтрокаРаздела.ТекстовоеСодержимое);
				НС.ТаможеннаяСтоимость = _ТаможеннаяСтоимостьРаздела;
			КонецЕсли;
			
			Если СтрокаРаздела.ИмяУзла = "ESADout_CUCustomsPaymentCalculation" Тогда
				
				н = "";
				Для каждого ПодстрокаРаздела Из СтрокаРаздела.ДочерниеУзлы Цикл
					Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:PaymentModeCode" тогда
						н = ПодстрокаРаздела.ТекстовоеСодержимое;
					КонецЕсли;
					
					Если н = "2010" Или н = "2050" Тогда
						Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:Rate"  Тогда
							НС.СтавкаПошлины       = НС.СтавкаПошлины + Число(ПодстрокаРаздела.ТекстовоеСодержимое);
						КонецЕсли;
						
						Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:PaymentAmount" Тогда
							НС.СуммаПошлины = НС.СуммаПошлины + Число(ПодстрокаРаздела.ТекстовоеСодержимое);
						КонецЕсли;	
					КонецЕсли;
					//Если н = "2010" Тогда
					//	Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:Rate"  Тогда
					//		НС.СтавкаПошлины       = Число(ПодстрокаРаздела.ТекстовоеСодержимое);
					//	КонецЕсли;
					//	
					//	Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:PaymentAmount" Тогда
					//		НС.СуммаПошлины = Число(ПодстрокаРаздела.ТекстовоеСодержимое);
					//	КонецЕсли;	
					//КонецЕсли;
					
					Если н = "5010" Тогда
						Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:Rate"  Тогда
							НС.СтавкаНДС = Число(ПодстрокаРаздела.ТекстовоеСодержимое);
						КонецЕсли;
						
						Если ПодстрокаРаздела.ИмяУзла = "catESAD_cu:PaymentAmount" Тогда
							НС.СуммаНДС = Число(ПодстрокаРаздела.ТекстовоеСодержимое);
						КонецЕсли;	
					КонецЕсли;	
					
				КонецЦикла;
			КонецЕсли;
			
			
			
			//ТЧ ТОВАРЫ +++
			Если СтрокаРаздела.ИмяУзла = "catESAD_cu:GoodsGroupDescription" Тогда
				
				Для каждого СтрТоварФайла Из СтрокаРаздела.ДочерниеУзлы Цикл
					Если СтрТоварФайла.ИмяУзла = "catESAD_cu:GoodsGroupInformation" Тогда
						
						СтрокаТовар = Товары.Добавить();

						
						
						СтрокаТовар.Партия = "";
						СтрокаТовар.СтранаПроисхождения = НС.СтранаПроисхождения;
						СтрокаТовар.НомерДляСФ = _НомерГТДРаздела;
						СтрокаТовар.ГТД = _НомерГТДРаздела;
						СтрокаТовар.НомерРаздела = _НомерРаздела;
						СтрокаТовар.Артикул = "";
						СтрокаТовар.АртикулДоп = "";
						
						Для каждого СтрокаИнфо Из СтрТоварФайла.ДочерниеУзлы Цикл
							Если СтрокаИнфо.ИмяУзла = "catESAD_cu:GoodsModel" Тогда
								СтрокаТовар.Артикул = СтрокаИнфо.ТекстовоеСодержимое;
							КонецЕсли;
							
							Если СтрокаИнфо.ИмяУзла = "catESAD_cu:GoodsMarking" Тогда
								ДопАртикул = СокрЛП(СтрЗаменить(СтрокаИнфо.ТекстовоеСодержимое," ",""));	
								ДопАртикул = СтрЗаменить(ДопАртикул,".","");	
								СтрокаТовар.АртикулДоп = ДопАртикул;
							КонецЕсли;
							
							Если СтрокаИнфо.ИмяУзла = "catESAD_cu:GoodsGroupQuantity" тогда
								Для каждого ДетИнфо Из СтрокаИнфо.ДочерниеУзлы Цикл
									//Количество
									Если ДетИнфо.ИмяУзла = "catESAD_cu:GoodsQuantity" Тогда
										_Количество = Число(ДетИнфо.ТекстовоеСодержимое);
										СтрокаТовар.Количество = _Количество;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						Если ИспользоватьДопАртикул Тогда
							СтрокаТовар.Артикул = СтрокаТовар.АртикулДоп;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
			//ТЧ ТОВАРЫ ---
						
		КонецЦикла;
	КонецЦикла;

	Возврат Новый Структура("Разделы,Товары",Разделы,Товары);

КонецФункции // РазобратьXML()


