
&ИзменениеИКонтроль("ПроверитьКорректностьЗаполненияДокументаПродажи")
Процедура ЕТС_ПроверитьКорректностьЗаполненияДокументаПродажи(Знач ДокументПродажи, Отказ) Экспорт
	
	// Если документ уже заполнен некорректно - не будем выполнять запросы
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура("Дата, Организация, ЭтоЗаказКакСчет");
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ДокументПродажи);
		
	// Проверим доступность ролей
	ОтклонениеОтУсловийПродаж = ПраваПользователяПовтИсп.ОтклонениеОтУсловийПродаж();
	РеализацияСверхЗаказа     = ПраваПользователяПовтИсп.РеализацияСверхЗаказа();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим нужно ли проверять диапазон допустимых цен
	ВидМаксимальноДопустимыхЦенПродажи = Константы.ВидМаксимальноДопустимыхЦенПродажи.Получить();
	ВидМинимальноДопустимыхЦенПродажи  = Константы.ВидМинимальноДопустимыхЦенПродажи.Получить();
	ПроверятьДиапазонЦен               = ЗначениеЗаполнено(ВидМаксимальноДопустимыхЦенПродажи) Или ЗначениеЗаполнено(ВидМинимальноДопустимыхЦенПродажи);
	
	// Заполним массив необходимых проверок в зависимости от типа документа
	МассивПроверок    = Новый Массив();
	ТипДокумента      = ТипЗнч(ДокументПродажи);
	ИмяТаблицы        = ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументПродажи.Ссылка);
	Если ТипДокумента = Тип("ОбработкаОбъект.ПомощникПродаж") Тогда
		
		ВариантОформленияДокументовПомощникаПродаж = ДокументПродажи.ВариантОформленияДокументов;
		ВозможныеВарианты = Перечисления.ВариантыОформленияДокументовПродажи;
		
		Если ВариантОформленияДокументовПомощникаПродаж = ВозможныеВарианты.ЗаказКлиента
			ИЛИ ВариантОформленияДокументовПомощникаПродаж = ВозможныеВарианты.ЗаказКлиентаПередачаТоваровХранителю
			ИЛИ ВариантОформленияДокументовПомощникаПродаж = ВозможныеВарианты.ЗаказКлиентаРеализацияТоваровУслуг Тогда
			ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Документы.ЗаказКлиента.ПустаяСсылка());
		ИначеЕсли ВариантОформленияДокументовПомощникаПродаж = ВозможныеВарианты.ПередачаТоваровХранителю Тогда
			ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Документы.ПередачаТоваровХранителю.ПустаяСсылка());
		ИначеЕсли ВариантОформленияДокументовПомощникаПродаж = ВозможныеВарианты.РеализацияТоваровУслуг Тогда
			ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
		КонецЕсли; 
		
	КонецЕсли; 
	ИмяТЧ             = ПолучитьИмяТабличнойЧасти(ИмяТаблицы);
	ПредставлениеТЧ   = ПолучитьПредставлениеТабличнойЧасти(ИмяТаблицы);
	
	СогласованВ1СДокументооборот = Ложь;
	
	// ИнтеграцияС1СДокументооборотом
	// Проверим возможность и состояние согласования через 1С:Документооборот
	СогласованиеЧерез1СДокументооборот =
		(Константы.ИспользоватьИнтеграциюС1СДокументооборот.Получить()
			Или Константы.ИспользоватьИнтеграциюС1СДокументооборот3.Получить())
		И Константы.ИспользоватьСогласованиеЧерез1СДокументооборот.Получить();
	Если СогласованиеЧерез1СДокументооборот И
			(ТипДокумента = Тип("ДокументОбъект.ЗаказКлиента") Или
				ТипДокумента = Тип("ДокументОбъект.КоммерческоеПредложениеКлиенту") Или
				ТипДокумента = Тип("ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента") Или
				ТипДокумента = Тип("СправочникОбъект.СоглашенияСКлиентами")) Тогда
		СогласованВ1СДокументооборот = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СогласованВ1СДокументооборот(
			ДокументПродажи.Ссылка);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВсеСтрокиОтменены = Ложь;
	ОперацииПередачи = ОперацииПередачиТоваров();
	ОперацииВозвратаПереданныхТоваров = ОперацииВозвратаПереданныхТоваров();
	
	Если ТипДокумента = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ДокументПродажи, "Товары", "Отменено");
		
		НужноСогласовать                            = Не (ВсеСтрокиОтменены ИЛИ ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
			ИспользоватьСкидки                          = Ложь;
		Иначе
			НужноСогласоватьРучныеСкидкиПоПользователям = Не (ВсеСтрокиОтменены ИЛИ ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
			ИспользоватьСкидки                          = Истина;
		КонецЕсли;
		

	//++ НЕ УТ
	
	//++ Устарело_Переработка24
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЗаказПереработчику") Тогда
		
		ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ДокументПродажи, "Продукция", "Отменено");
		ВсеСтрокиОтменены =
			ВсеСтрокиОтменены
			И ОбщегоНазначенияУТ.ВсеСтрокиОтменены(
				ДокументПродажи,
				"Материалы",
				"Отменено");
		
		НужноСогласовать                            = Не (ВсеСтрокиОтменены ИЛИ ДокументПродажи.Согласован);
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	//-- Устарело_Переработка24
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЗаказПереработчику2_5") Тогда
		
		ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ДокументПродажи, "ВыходныеИзделия", "Отменено");
		ВсеСтрокиОтменены =
			ВсеСтрокиОтменены
			И ОбщегоНазначенияУТ.ВсеСтрокиОтменены(
				ДокументПродажи,
				"ПобочныеИзделия",
				"Отменено");
		ВсеСтрокиОтменены =
			ВсеСтрокиОтменены
			И ОбщегоНазначенияУТ.ВсеСтрокиОтменены(
				ДокументПродажи,
				"ОбеспечениеМатериаламиИРаботами",
				"Отменено");
		ВсеСтрокиОтменены =
			ВсеСтрокиОтменены
			И ОбщегоНазначенияУТ.ВсеСтрокиОтменены(
				ДокументПродажи,
				"Услуги",
				"Отменено");
		
		НужноСогласовать                            = Ложь;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
		
	//++ Устарело_Переработка24
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ПередачаСырьяПереработчику") Тогда
		
		НужноСогласовать                            = Не (ДокументПродажи.Согласован);
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	//-- Устарело_Переработка24
	
	//-- НЕ УТ
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ПередачаТоваровХранителю") Тогда
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ВыкупТоваровХранителем") Тогда
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ОтчетОСписанииТоваровУХранителя") Тогда
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ОприходованиеИзлишковТоваровУХранителя") Тогда
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ПоступлениеТоваровОтХранителя") Тогда
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ДокументПродажи, "ЗаменяющиеТовары", "Отменено");
		
		НужноСогласовать                            = Не (ВсеСтрокиОтменены ИЛИ ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
		НужноСогласоватьРучныеСкидкиПоПользователям = Не (ВсеСтрокиОтменены ИЛИ ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
		ИспользоватьСкидки                          = Истина;
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.АктОРасхожденияхПослеОтгрузки")
		Или ТипДокумента = Тип("ДокументОбъект.АктОРасхожденияхПослеПриемки") Тогда
		
		НужноСогласовать                            = Ложь;
		НужноСогласоватьРучныеСкидкиПоПользователям = Ложь;
		ИспользоватьСкидки                          = Ложь;
		
	ИначеЕсли ТипДокумента <> Тип("ДокументОбъект.ЗаданиеТорговомуПредставителю")
	        И ТипДокумента <> Тип("ДокументОбъект.ВозвратТоваровОтКлиента")
	        И ТипДокумента <> Тип("ДокументОбъект.ЧекККМ")
			И ТипДокумента <> Тип("ДокументОбъект.ЧекККМКоррекции")
	        И ТипДокумента <> Тип("ОбработкаОбъект.ПомощникПродаж") Тогда
		
		НужноСогласовать                            = Не (ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
		НужноСогласоватьРучныеСкидкиПоПользователям = Не (ОтклонениеОтУсловийПродаж ИЛИ ДокументПродажи.Согласован ИЛИ СогласованВ1СДокументооборот);
		ИспользоватьСкидки                          = Истина;
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЧекККМ") Тогда
		
		НужноСогласовать                            = Ложь;
		НужноСогласоватьРучныеСкидкиПоПользователям = Не ОтклонениеОтУсловийПродаж;
		ИспользоватьСкидки                          = Истина;
		
	Иначе
		
		НужноСогласовать                            = Не ОтклонениеОтУсловийПродаж;
		НужноСогласоватьРучныеСкидкиПоПользователям = Не ОтклонениеОтУсловийПродаж;
		ИспользоватьСкидки                          = Истина;
		
	КонецЕсли;
	
	ПроверятьСкидкиРассчитаны = Ложь;
	ВозвратМногооборотнойТары = Ложь;
	ТребуетсяЗалогЗаТару = Ложь;
	СуммаВзаиморасчетовРеализации = 0;
	СуммаЗалогаПоРеализации = 0;
	ПредставлениеПоляСклад = НСтр("ru = 'Склад'");
	
	// Проверим нужно ли проверять скидки и наценки
	ИспользоватьАвтоматическиеСкидки             = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ИспользоватьРучныеСкидки                     = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ПроверятьСкидкиНаценки                       = ИспользоватьАвтоматическиеСкидки Или ИспользоватьРучныеСкидки;
	ИспользоватьРаздельныйУчетПоНалогообложению  =
		НастройкиНалоговУчетныхПолитикПовтИсп.РаздельныйУчетТоваровПоНалогообложениюНДС(РеквизитыДокумента.Организация, РеквизитыДокумента.Дата);
	ИспользоватьЦеновыеГруппы                    = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
	ИспользоватьОграниченияПоПользователям       = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям")
	                                               И НужноСогласоватьРучныеСкидкиПоПользователям
	                                               И ИспользоватьСкидки;
	ИспользоватьОграниченияПоСоглашениям         = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям")
	                                               И НужноСогласовать
	                                               И ИспользоватьСкидки;
	ОграничиватьРучныеСкидки                     = ИспользоватьРучныеСкидки И (ИспользоватьОграниченияПоПользователям ИЛИ ИспользоватьОграниченияПоСоглашениям);
	ИспользоватьПодразделения                    = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	// Проверим, нужно ли запрещать закрытие заказов без полной отгрузки/оплаты
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = ?(РеквизитыДокумента.ЭтоЗаказКакСчет = Неопределено,
					ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"),
					Не РеквизитыДокумента.ЭтоЗаказКакСчет);
	
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	ИспользоватьНоменклатуруПартнеров   = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров");
	
	// ПОМОЩНИК ПРОДАЖ
	Если ТипДокумента = Тип("ОбработкаОбъект.ПомощникПродаж") Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
		
		Если НЕ (ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиентаПередачаТоваровХранителю
			ИЛИ ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ПередачаТоваровХранителю) Тогда
				
				МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
				МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
				
		КонецЕсли;
		
		// ПОМОЩНИК ПРОДАЖ - ЗАКАЗ КЛИЕНТА
		
		Если ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиента
			Или ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиентаПередачаТоваровХранителю
			Или ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиентаРеализацияТоваровУслуг Тогда
			
			Если ИспользоватьРасширенныеВозможностиЗаказаКлиента
				ИЛИ ДокументПродажи.ВариантОформленияДокументов <> Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиента Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияСклада");
				МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			КонецЕсли;
			
			Если ИспользоватьПодразделения Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
			
			Если НужноСогласовать
				И (ДокументПродажи.СтатусЗаказаКлиента <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован
					ИЛИ НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента) Тогда
				
				Если НЕ ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ЗаказКлиентаПередачаТоваровХранителю Тогда
					МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
					МассивПроверок.Добавить("КорректностьСуммыНДС");
				КонецЕсли;
				
				МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
					МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
					МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
					МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
				КонецЕсли;
				
				Если ПроверятьДиапазонЦен Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
				КонецЕсли;
			
				// Проверка корректности этапов оплаты осуществляется только для
				// заказов, в которых не все строки отменены и  в которых указан график оплаты.
				
				Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
					И ДокументПродажи.СуммаДокумента <> 0 Тогда
					
					МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
					МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
					
				КонецЕсли;
				
				Если ИспользоватьАвтоматическиеСкидки
					И Не ДокументПродажи.СкидкиРассчитаны
					И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
					
					ПроверятьСкидкиРассчитаны = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'");
			
		// ПОМОЩНИК ПРОДАЖ - РЕАЛИЗАЦИЯ ТОВАРОВ УСЛУГ
			
		ИначеЕсли ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.РеализацияТоваровУслуг Тогда
			
			Если ПроверятьСкидкиРассчитаны И
				ИспользоватьАвтоматическиеСкидки И
				Не ДокументПродажи.СкидкиРассчитаны И
				ДокументПродажи.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
				ПроверятьСкидкиРассчитаны = Истина;
			КонецЕсли;
			
			Если НужноСогласовать Тогда
				
				МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
				МассивПроверок.Добавить("КорректностьСуммыНДС");
				МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
					МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
					МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
					МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
				КонецЕсли;
				
				Если ПроверятьДиапазонЦен Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
				КонецЕсли;
				
				Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
					ИЛИ ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
					ИЛИ ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности
					ИЛИ Не ЗначениеЗаполнено(ДокументПродажи.ХозяйственнаяОперация) Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
					МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИспользоватьПодразделения Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
			
			ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'");
			
		// ПОМОЩНИК ПРОДАЖ - ПЕРЕДАЧА ТОВАРОВ ХРАНИТЕЛЮ
			
		ИначеЕсли ДокументПродажи.ВариантОформленияДокументов = Перечисления.ВариантыОформленияДокументовПродажи.ПередачаТоваровХранителю Тогда
			
			Если НужноСогласовать Тогда
				
				МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
					МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
					МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
					МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
				КонецЕсли;
				
				Если ПроверятьДиапазонЦен Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
				КонецЕсли;
				
				МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
				
			КонецЕсли;
		КонецЕсли;
		
		Если ОграничиватьРучныеСкидки
			И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
			
		КонецЕсли;
		
		Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
	// СОГЛАШЕНИЕ С КЛИЕНТОМ
	
	ИначеЕсли ИмяТаблицы = "Справочник.СоглашенияСКлиентами" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВозвращатьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
		
		Если Не ДокументПродажи.Типовое И НужноСогласовать И
			ДокументПродажи.Статус <> Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
			МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
			МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
			МассивПроверок.Добавить("ВременнаяТаблицаЭтапыОплатыСоглашенияТипового");
			МассивПроверок.Добавить("ВременнаяТаблицаЭтапыОплатыСоглашенияИндивидуального");
			МассивПроверок.Добавить("КорректностьЭтаповОплатыСоглашения");
			МассивПроверок.Добавить("КорректностьКоличестваЭтаповОплатыСоглашения");
			
		КонецЕсли;
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("ДублиТоваров");
		
		Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
		Если НужноСогласовать И ДокументПродажи.Статус <> Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано Тогда
		
			Если ЗначениеЗаполнено(ДокументПродажи.СегментНоменклатуры) Тогда
				МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Или Не ДокументПродажи.Типовое Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
		
			Если Не ДокументПродажи.Типовое Тогда
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
			КонецЕсли;
			
		КонецЕсли;
		
		ИспользоватьЦеновыеГруппы = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
		
		Если ИспользоватьЦеновыеГруппы Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаЦеновыеГруппы");
			МассивПроверок.Добавить("ДублиЦеновыхГрупп");
			
			Если Не ДокументПродажи.Типовое И НужноСогласовать И
			ДокументПродажи.Статус <> Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано Тогда
				МассивПроверок.Добавить("СоответствиеЦеновыхГруппУсловиямПродаж");
			КонецЕсли;
		
		КонецЕсли;
		
	// ЗАКАЗ КЛИЕНТА
	
	ИначеЕсли ИмяТаблицы = "Документ.ЗаказКлиента" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВЗаказеКлиента");
		Если НЕ ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			Если ИспользоватьПодразделения
				И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
		КонецЕсли;
		
		Если Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
			И Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
				//++ НЕ УТ
				И Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПереработчику2_5
				//-- НЕ УТ
				Тогда
#Удаление
			МассивПроверок.Добавить("КонтрольЗаполненияЦенСУчетомОтмененных");
#КонецУдаления
			ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
			ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
			
			МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
			МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
		КонецЕсли;
		
		Если НужноСогласовать 
			И (ДокументПродажи.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован 
			ИЛИ НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента) Тогда
			
			Если НЕ ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
				И Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
				МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
				МассивПроверок.Добавить("КорректностьСуммыНДС");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если ИспользоватьСоглашенияСКлиентами Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
				МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
				МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
				МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
		
			// Проверка корректности этапов оплаты осуществляется только для
			// заказов, в которых не все строки отменены и  в которых указан график оплаты.
			
			Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
				И ДокументПродажи.СуммаДокумента <> 0 Тогда
				
				Если ДокументПродажи.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
					МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИспользоватьАвтоматическиеСкидки
				И Не ДокументПродажи.СкидкиРассчитаны
				И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
				
				ПроверятьСкидкиРассчитаны = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОграничиватьРучныеСкидки
			И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
			И (ДокументПродажи.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован
				ИЛИ НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента) Тогда
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
			
		КонецЕсли;
		
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
			МассивПроверок.Добавить("НаличиеУслугТары");
		ИначеЕсли ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи Тогда
			МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		КонецЕсли;
		
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
			МассивПроверок.Добавить("НаправлениеДеятельностиПоУчетуДоховИРасходов");
			МассивПроверок.Добавить("ИспользованиеЗаказаКлиентуПоВариантуОбособления");
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'");
		
	//++ НЕ УТ

	
	//++ Устарело_Переработка24
	
	// ПЕРЕДАЧА СЫРЬЯ ПЕРЕРАБОТЧИКУ
	ИначеЕсли ИмяТаблицы = "Документ.ПередачаСырьяПереработчику" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = Ложь;
	//-- Устарело_Переработка24
	
	//-- НЕ УТ
	
	// ПЕРЕДАЧА ТОВАРОВ ХРАНИТЕЛЮ
	
	ИначеЕсли ИмяТаблицы = "Документ.ПередачаТоваровХранителю" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		
		МассивПроверок.Добавить("НаличиеУслугРабот");
		
		Если Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		КонецЕсли;
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		
		Если НужноСогласовать
			И (РеализацияСверхЗаказа
				Или Не ДокументПродажи.ПередачаПоЗаказам) Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если ИспользоватьСоглашенияСКлиентами Тогда
				Если Не ДокументПродажи.ПередачаПоЗаказам Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
					МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
				КонецЕсли;
				
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
				МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
		КонецЕсли;
	
	// РЕАЛИЗАЦИЯ ТОВАРОВ И УСЛУГ
	
	ИначеЕсли ИмяТаблицы = "Документ.РеализацияТоваровУслуг" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		Если Не КомиссионнаяТорговляСервер.РеализацияЧерезКомиссионера(ДокументПродажи.ХозяйственнаяОперация) Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияСклада");
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			Если ИспользоватьПодразделения Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
		КонецЕсли;
		
		МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
#Удаление
		МассивПроверок.Добавить("КонтрольЗаполненияЦен");
#КонецУдаления
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
		
		СуммаВзаиморасчетовРеализации = ДокументПродажи.ДополнительныеСвойства.СуммаВВалютеВзаиморасчетов;
		СуммаЗалогаПоРеализации = ДокументПродажи.ДополнительныеСвойства.СуммаЗалогаВВалютеВзаиморасчетов;
		
		Если ПроверятьСкидкиРассчитаны И
			ИспользоватьАвтоматическиеСкидки И
			Не ДокументПродажи.СкидкиРассчитаны И
			ДокументПродажи.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			ПроверятьСкидкиРассчитаны = Истина;
		КонецЕсли;
		
		Если (Не ДокументПродажи.РеализацияПоЗаказам ИЛИ РеализацияСверхЗаказа) И НужноСогласовать Тогда
			
			Если Не КомиссионнаяТорговляСервер.ПередачаНаКомиссию(ДокументПродажи.ХозяйственнаяОперация) Тогда
				МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
			КонецЕсли;
			МассивПроверок.Добавить("КорректностьСуммыНДС");
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если ИспользоватьСоглашенияСКлиентами Тогда
				Если НЕ ДокументПродажи.РеализацияПоЗаказам Тогда
					МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
					МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
				КонецЕсли;
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
				МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
		КонецЕсли;
		
		Если НужноСогласовать И ИспользоватьСоглашенияСКлиентами
			И (Не ДокументПродажи.РеализацияПоЗаказам Или ДокументПродажи.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным)  Тогда
			
			Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
				ИЛИ ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
				ИЛИ ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности
				ИЛИ Не ЗначениеЗаполнено(ДокументПродажи.ХозяйственнаяОперация) Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
				МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОграничиватьРучныеСкидки И ДокументПродажи.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
				
		КонецЕсли;
		
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'");
		
	// ЗАЯВКА НА ВОЗВРАТ ТОВАРОВ ОТ КЛИЕНТА
	
	ИначеЕсли ИмяТаблицы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		
		НужнаЗаменаТоваров = ДокументПродажи.СпособКомпенсации = Перечисления.СпособыКомпенсацииВозвратовТоваров.ЗаменитьТовары;
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВЗаказеКлиента");
		Если НужнаЗаменаТоваров Тогда
			МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
			Если ИспользоватьПодразделения Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		КонецЕсли;
		
		Если ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
			И НужнаЗаменаТоваров Тогда
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		КонецЕсли;
		
		Если НужнаЗаменаТоваров Тогда
			МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		КонецЕсли;
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
		
		Если НужноСогласовать 
			И (ДокументПродажи.Статус <> Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована 
				ИЛИ НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента)Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			Если НужнаЗаменаТоваров Тогда
				МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
				МассивПроверок.Добавить("КорректностьСуммыНДС");
			КонецЕсли;
			
			Если ИспользоватьСоглашенияСКлиентами Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
				МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
				МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
				Если НужнаЗаменаТоваров Тогда
					МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
					МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
				КонецЕсли;
			КонецЕсли;
			Если НужнаЗаменаТоваров И ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
		
			// Проверка корректности этапов оплаты осуществляется только для
			// заявок, в которых не все строки отменены и  в которых указан график оплаты.
			
			Если ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
				И ДокументПродажи.ЗаменяющиеТовары.Количество() > 0
				И ДокументПродажи.СуммаДокумента <> 0
				И ДокументПродажи.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
				И НужнаЗаменаТоваров Тогда
				
				МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
				МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
				
			КонецЕсли;
			
			Если ИспользоватьАвтоматическиеСкидки
				И Не ДокументПродажи.СкидкиРассчитаны
				И ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
				И ДокументПродажи.ЗаменяющиеТовары.Количество() > 0 Тогда
				ПроверятьСкидкиРассчитаны = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОграничиватьРучныеСкидки
			И ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено
			И (ДокументПродажи.Статус <> Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована 
				ИЛИ НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента)
			И НужнаЗаменаТоваров Тогда
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
				
		КонецЕсли;
		
		Если ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
			И НужнаЗаменаТоваров Тогда
			Если МассивПроверок.Найти("ВременнаяТаблицаТовары") = Неопределено Тогда
				
				МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
				МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
				МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
				МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
				МассивПроверок.Добавить("ВременнаяТаблицаТовары");
				
			КонецЕсли;
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
		Если ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
			МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		КонецЕсли;
	
	// ЗАДАНИЕ ТОРГОВОМУ ПРЕДСТАВИТЕЛЮ
	
	ИначеЕсли ИмяТаблицы = "Документ.ЗаданиеТорговомуПредставителю" Тогда
		ВозвратМногооборотнойТары = ДокументПродажи.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ТребуетсяЗалогЗаТару;
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		Если Не ОтклонениеОтУсловийПродаж И ИспользоватьСоглашенияСКлиентами Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
			МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
		КонецЕсли;
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
			
		Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
			
	// АКТ ВЫПОЛНЕННЫХ РАБОТ
	
	ИначеЕсли ИмяТаблицы = "Документ.АктВыполненныхРабот" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		Если ПроверятьСкидкиРассчитаны И
			ИспользоватьАвтоматическиеСкидки И
			Не ДокументПродажи.СкидкиРассчитаны Тогда
			ПроверятьСкидкиРассчитаны = Истина;
		КонецЕсли;
		
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		Если ИспользоватьПодразделения Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
		КонецЕсли;
		
		Если Не ДокументПродажи.АктПоЗаказам И НужноСогласовать Тогда
			
			МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
			МассивПроверок.Добавить("КорректностьСуммыНДС");
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если ИспользоватьСоглашенияСКлиентами Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
				МассивПроверок.Добавить("СоответствиеШапкиУсловиямПродаж");
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямПродаж");
				МассивПроверок.Добавить("ПринадлежностьПартнераСегментуПартнеров");
				МассивПроверок.Добавить("ПринадлежностьТоваровСегментуНоменклатуры");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
		КонецЕсли;
		
		Если НужноСогласовать И ИспользоватьСоглашенияСКлиентами Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
			МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
		КонецЕсли;
		
		Если ОграничиватьРучныеСкидки Тогда
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");

		КонецЕсли;
		
	// ВОЗВРАТ ТОВАРОВ ОТ КЛИЕНТА
	
	ИначеЕсли ИмяТаблицы = "Документ.ВозвратТоваровОтКлиента" Тогда
		
		Если ДокументПродажи.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
			
			МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");

			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			
#Удаление
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
#КонецУдаления
			МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		КонецЕсли;
		
		ВозвратМногооборотнойТары = ДокументПродажи.ВозвратПереданнойМногооборотнойТары;
		ТребуетсяЗалогЗаТару = ДокументПродажи.ПредусмотренЗалогЗаТару;
		
	ИначеЕсли ИмяТаблицы = "Документ.ПоступлениеТоваровОтХранителя" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		МассивПроверок.Добавить("НаличиеУслугРабот");
		МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		
	ИначеЕсли ИмяТаблицы = "Документ.ВыкупТоваровХранителем" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		МассивПроверок.Добавить("НаличиеУслугРабот");
		МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		
	ИначеЕсли ИмяТаблицы = "Документ.ОтчетОСписанииТоваровУХранителя"
		Или ИмяТаблицы = "Документ.ОприходованиеИзлишковТоваровУХранителя" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		МассивПроверок.Добавить("НаличиеУслугРабот");
		МассивПроверок.Добавить("НаличиеАлкогольнойПродукции");
		
	// АКТ О РАСХОЖДЕНИЯХ ПОСЛЕ ПРИЕМКИ
	
	ИначеЕсли ИмяТаблицы = "Документ.АктОРасхожденияхПослеПриемки" Тогда
		
		Если ОперацииВозвратаПереданныхТоваров.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
			
			МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВозвратТоваровОтКлиента.ВозвратПереданнойМногооборотнойТары) КАК ВернутьМногооборотнуюТару,
			|	МАКСИМУМ(ВозвратТоваровОтКлиента.ПредусмотренЗалогЗаТару)             КАК ТребуетсяЗалогЗаТару
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
			|ГДЕ
			|	ВозвратТоваровОтКлиента.Ссылка В(&МассивОснований)";
			
			Запрос.УстановитьПараметр("МассивОснований", ДокументПродажи.Товары.ВыгрузитьКолонку("ДокументОснование"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ВозвратМногооборотнойТары = Выборка.ВернутьМногооборотнуюТару;
				ТребуетсяЗалогЗаТару      = Выборка.ТребуетсяЗалогЗаТару;
			КонецЕсли;

			
			МассивПроверок.Добавить("КонтрольЗаполненияЦенАкт");
		КонецЕсли;
		
	// АКТ О РАСХОЖДЕНИЯХ ПОСЛЕ ОТГРУЗКИ
		
	ИначеЕсли ИмяТаблицы = "Документ.АктОРасхожденияхПослеОтгрузки" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		Если ДокументПродажи.Статус <> Перечисления.СтатусыАктаОРасхождениях.НеСогласовано Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		КонецЕсли;
		
		Если Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
			//++ НЕ УТ
			И Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПереработчику2_5
			//-- НЕ УТ
			И Не ДокументПродажи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			
			МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
			МассивПроверок.Добавить("КонтрольЗаполненияЦенАкт");
			
		КонецЕсли;
		
		Если Не ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	МАКСИМУМ(РеализацияТоваровУслуг.ВернутьМногооборотнуюТару) КАК ВернутьМногооборотнуюТару,
			|	МАКСИМУМ(РеализацияТоваровУслуг.ТребуетсяЗалогЗаТару) КАК ТребуетсяЗалогЗаТару
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка В(&МассивРеализаций)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	МАКСИМУМ(ПередачаТоваров.ВернутьМногооборотнуюТару) КАК ВернутьМногооборотнуюТару,
			|	ЛОЖЬ КАК ТребуетсяЗалогЗаТару
			|ИЗ
			|	Документ.ПередачаТоваровХранителю КАК ПередачаТоваров
			|ГДЕ
			|	ПередачаТоваров.Ссылка В(&МассивРеализаций)
			|";
			
			Запрос.УстановитьПараметр("МассивРеализаций", ДокументПродажи.Товары.ВыгрузитьКолонку("Реализация"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ВозвратМногооборотнойТары = Выборка.ВернутьМногооборотнуюТару;
				ТребуетсяЗалогЗаТару      = Выборка.ТребуетсяЗалогЗаТару;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугРабот");
		КонецЕсли;
		
		Если ИспользоватьПодразделения 
			И ОперацииПередачи.Найти(ДокументПродажи.ХозяйственнаяОперация) = Неопределено Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
		КонецЕсли;

	// ЧЕК ККМ
		
	ИначеЕсли ИмяТаблицы = "Документ.ЧекККМ" Тогда
		
		Если ОграничиватьРучныеСкидки Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
			МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			
			Если ИспользоватьОграниченияПоПользователям Тогда
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокГруппыПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамПользователей");
				МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОграниченияПоГруппамИПользователям");
				МассивПроверок.Добавить("ЦеновыеГруппы");
				МассивПроверок.Добавить("ОграничениеРучныхСкидокПоГруппамИПользователям");
				МассивПроверок.Добавить("ТаблицаОграничений");
			КонецЕсли;
			
			МассивПроверок.Добавить("ВременнаяТаблицаОграничениеРучныхСкидокОбщиеОграничения");
			МассивПроверок.Добавить("ВременнаяТаблицаОграниченияРучныхСкидок");
			МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
				
		КонецЕсли;
		
	// КОРРЕКТИРОВКА РЕАЛИЗАЦИИ
	
	ИначеЕсли ИмяТаблицы = "Документ.КорректировкаРеализации" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументПродажи");
		
		МассивПроверок.Добавить("ВременнаяТаблицаТоварыПредварительная");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыПодготовка");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборыДополнительно");
		МассивПроверок.Добавить("ВременнаяТаблицаНаборы");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		
		ПроверкаПоСкладу = Истина;
		
		Если ТипЗнч(ДокументПродажи.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ДокументОснованиеХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.ДокументОснование, "ХозяйственнаяОперация");
			Если КомиссионнаяТорговляСервер.РеализацияЧерезКомиссионера(ДокументОснованиеХозяйственнаяОперация) Тогда
				ПроверкаПоСкладу = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроверкаПоСкладу Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияСклада");
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			Если ИспользоватьПодразделения Тогда
				МассивПроверок.Добавить("КорректностьЗаполненияПодразделенияВТабличнойЧастиТовары");
			КонецЕсли;
		КонецЕсли;
		
		МассивПроверок.Добавить("КорректностьВыбораНоменклатурыПоНалогообложениюНДС");
		
#Удаление
		МассивПроверок.Добавить("КонтрольЗаполненияЦен");
#КонецУдаления			
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
	
		Если ТипЗнч(ДокументПродажи.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ВозвратМногооборотнойТары = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.ДокументОснование, "ВернутьМногооборотнуюТару");
			ТребуетсяЗалогЗаТару = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.ДокументОснование, "ТребуетсяЗалогЗаТару");
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'");
		
	Иначе
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
		
	КонецЕсли;
	
	НеПроверятьКодСтроки = Не (ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументОбъект.ПередачаТоваровХранителю"));

	УчитыватьСкидкиНаценки = Не ((ИмяТаблицы = "Справочник.СоглашенияСКлиентами") 
		Или (ИмяТаблицы = "Документ.ЗаданиеТорговомуПредставителю")
		Или (ИмяТаблицы = "Документ.ВозвратТоваровОтКлиента"));
	
	ГруппаПользователейСНастройкойПродаж = НастройкиПродажДляПользователейСервер.ПолучитьГруппуПользователяСНастройкойПродажДляПользователя(
		Пользователи.АвторизованныйПользователь(), 
		"СкидкиНаценки");
	ИспользоватьПроверкиПоЦенам = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ДокументПродажи.Дата) 
		И (МассивПроверок.Найти("ВхождениеЦенВДопустимыйДиапазон") <> Неопределено
			Или МассивПроверок.Найти("СоответствиеТоваровУсловиямПродаж") <> Неопределено);
	
	ПараметрыПроверкиКорректностиЗаполнения = ПараметрыПроверкиКорректностиЗаполненияДокументаПродажи(ДокументПродажи, ИмяТаблицы, ИмяТЧ, ПредставлениеТЧ);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("УчитыватьСкидкиНаценки", УчитыватьСкидкиНаценки);	
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ПроверятьСкидкиРассчитаны", ПроверятьСкидкиРассчитаны);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьРучныеСкидки", ИспользоватьРучныеСкидки);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьАвтоматическиеСкидки", ИспользоватьАвтоматическиеСкидки);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьРасширенныеВозможностиЗаказаКлиента", ИспользоватьРасширенныеВозможностиЗаказаКлиента);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьНоменклатуруПартнеров", ИспользоватьНоменклатуруПартнеров);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьПроверкиПоЦенам", ИспользоватьПроверкиПоЦенам);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьОграниченияПоПользователям", ИспользоватьОграниченияПоПользователям);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьОграниченияПоСоглашениям", ИспользоватьОграниченияПоСоглашениям);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ИспользоватьЦеновыеГруппы", ИспользоватьЦеновыеГруппы);
	ПараметрыПроверкиКорректностиЗаполнения.Вставить("ПредставлениеПоляСклад", ПредставлениеПоляСклад);
	
	ПродажиСерверЛокализация.ДополнитьМассивПроверокКорректностиЗаполненияДокументаПродажи(МассивПроверок, ПараметрыПроверкиКорректностиЗаполнения);
	
	// Сформируем текст запроса необходимых проверок в соответствие с массивом проверок
	ТекстЗапроса = "";
	ПараметрыЗапроса = Новый Структура();
		
	ПараметрыЗапроса.Вставить("Дата",          ДокументПродажи.Дата);
	ПараметрыЗапроса.Вставить("ЭтоСоглашение", ТипДокумента = Тип("СправочникОбъект.СоглашенияСКлиентами"));
	ПараметрыЗапроса.Вставить("Ссылка",        ДокументПродажи.Ссылка);
	ПараметрыЗапроса.Вставить("Пользователь",  Пользователи.АвторизованныйПользователь());
	ПараметрыЗапроса.Вставить("ИспользоватьГрафикиОплаты", ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты"));
	ПараметрыЗапроса.Вставить("ИспользоватьСтатусыРеализацийТоваровУслуг", ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРеализацийТоваровУслуг"));
	ПараметрыЗапроса.Вставить("ВозвратМногооборотнойТары", ВозвратМногооборотнойТары);
	ПараметрыЗапроса.Вставить("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	ПараметрыЗапроса.Вставить("СуммаВзаиморасчетовРеализации", СуммаВзаиморасчетовРеализации);
	ПараметрыЗапроса.Вставить("СуммаЗалогаПоРеализации", СуммаЗалогаПоРеализации);
	ПараметрыЗапроса.Вставить("НеЗаданаСуммаЗалога", Ложь);
	ПараметрыЗапроса.Вставить("НеПроверятьКодСтроки", НеПроверятьКодСтроки);
	ПараметрыЗапроса.Вставить("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
	ПараметрыЗапроса.Вставить("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.Ссылка, "Организация")));
	ПараметрыЗапроса.Вставить("ГрафикВСоглашении", ТипДокумента = Тип("ДокументОбъект.АктВыполненныхРабот")
	                                               Или ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг"));
		
	Если ИспользоватьОграниченияПоСоглашениям Тогда
		ПараметрыЗапроса.Вставить("СоглашениеСКлиентом", ДокументПродажи.Соглашение);
	КонецЕсли;

	ПараметрыЗапроса.Вставить("ГруппаПользователей", ГруппаПользователейСНастройкойПродаж);
	
	СформироватьТекстЗапросаПроверкиКорректностиЗаполненияДокументаПродажи(ТекстЗапроса, ПараметрыЗапроса, МассивПроверок, ПараметрыПроверкиКорректностиЗаполнения);
		
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	МассивРезультатов = Запрос.ВыполнитьПакет(); 
	
	// Сообщим пользователю о результатах проверки для каждого результата запроса	
	СообщитьОбОшибкахПроверкиКорректностиЗаполненияДокументаПродажи(МассивПроверок, МассивРезультатов, ПараметрыПроверкиКорректностиЗаполнения, Отказ);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&После("ПроверитьКорректностьВозвращаемыхТоваров")
Процедура ЕТС_ПроверитьКорректностьВозвращаемыхТоваров(Знач ДокументПродажи, ИмяТаблицы, Отказ, ТаблицаПроверяемыеТовары)

	Если ЕТС_ОбщиеКомандыСервер.ПолучитьРольДоступна("ЕТС_Администратор") Тогда 
		Отказ = Ложь;
    КонецЕсли;

КонецПроцедуры
