
&После("ОбработкаЗаполнения")
Процедура ЕТС_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Склад) Тогда
		Грузоотправитель = ЕТС_ОбщиеКомандыСервер.ПолучитьГрузоотправителя(Склад);
	КонецЕсли;
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "ЕТС_ЗаказНаряд") Тогда
		ЭтоЗаказНаряд = Истина;
	Иначе
		ЭтоЗаказНаряд = Ложь;
	Конецесли;
	// это пока не делаем
	//Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Подразделение) Тогда
	//	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ЕТС_ОбщиеКомандыСервер.ПолучитьОтветственноеЛицо(Организация,Подразделение));
	//КонецЕсли;
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ЕТС_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не ЭтотОбъект.ВидыЗапасовУказаныВручную И ЭтотОбъект.СФАльфа.Количество() > 0 Тогда
		ТабТовары = ЭтотОбъект.ВидыЗапасов.ВыгрузитьКолонки();
		ТЧСФАльфа = ЭтотОбъект.СФАльфа.Выгрузить();

		ОшибкиСФАльфа = Ложь;
		МассивПовтора = Новый ТаблицаЗначений;
		МассивПовтора = ТабТовары.СкопироватьКолонки();
		Для Каждого стр Из ЭтотОбъект.ВидыЗапасов Цикл
			ПодобратьНомераГТДВСтроку(стр, ТабТовары, ТЧСФАльфа, МассивПовтора);
			Если МассивПовтора.Количество() > 0 Тогда
				НовыйМассивПовтора = Новый ТаблицаЗначений;
				НовыйМассивПовтора = ТабТовары.СкопироватьКолонки();
				Для Каждого стрПовтор Из МассивПовтора Цикл
					ПодобратьНомераГТДВСтроку(стрПовтор, ТабТовары, ТЧСФАльфа, НовыйМассивПовтора);
				КонецЦикла;
				МассивПовтора = НовыйМассивПовтора;
			КонецЕсли;
		КонецЦикла;
		ТабТовары.Свернуть("АналитикаУчетаНоменклатуры,ВидЗапасов,Упаковка,СтавкаНДС,ЗаказКлиента,Цена,ОбъектРасчетов,НомерГТД",
		"КоличествоУпаковок,Количество,СуммаСНДС,СуммаНДС,СуммаВзаиморасчетов");
		ЭтотОбъект.ВидыЗапасов.Загрузить(ТабТовары);
		Для Каждого стр Из ЭтотОбъект.ВидыЗапасов Цикл
			стр.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		КонецЦикла;
		ЭтотОбъект.ВидыЗапасовУказаныВручную = Истина;
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать();
		ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПодобратьНомераГТДВСтроку(стр, ТабТовары, ТЧСФАльфа, МассивПовтора)
	НайденныеСтроки = ТЧСФАльфа.НайтиСтроки(Новый Структура("Номенклатура", стр.АналитикаУчетаНоменклатуры.Номенклатура));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ОшибкиСФАльфа = Истина;
		НоваяСтрока = ТабТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
		НоваяСтрока.НомерГТД = Неопределено;
	ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
		стрНашли = НайденныеСтроки[0];
		Если стрНашли.Количество >= стр.Количество Тогда
			НоваяСтрока = ТабТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
			НоваяСтрока.НомерГТД = стрНашли.НомерГТД;
			//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			стрНашли.Количество = стрНашли.Количество - стр.Количество;
		Иначе  // делим на 2 строки
			КолОст = стр.Количество - стрНашли.Количество;
			НоваяСтрока = ТабТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
			НоваяСтрока.СуммаНДС = Окр(Стр.СуммаНДС/Стр.Количество*СтрНашли.Количество,2);
			НоваяСтрока.СуммаСНДС = Окр(Стр.СуммаСНДС/Стр.Количество*СтрНашли.Количество,2);
			НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.СуммаСНДС;
			НоваяСтрока.Количество = СтрНашли.Количество;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			НоваяСтрока.НомерГТД = стрНашли.НомерГТД;
			стрНашли.Количество = стрНашли.Количество - НоваяСтрока.Количество;
			//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			
			ВтораяСтрока = ТабТовары.Добавить();
			ЗаполнитьЗначенияСвойств(ВтораяСтрока,стр);
			ВтораяСтрока.Количество = КолОст;
			ВтораяСтрока.КоличествоУпаковок = КолОст;
			ВтораяСтрока.СуммаНДС = ВтораяСтрока.СуммаНДС - НоваяСтрока.СуммаНДС;
			ВтораяСтрока.СуммаСНДС = ВтораяСтрока.СуммаСНДС - НоваяСтрока.СуммаСНДС;
			ВтораяСтрока.СуммаВзаиморасчетов = ВтораяСтрока.СуммаСНДС;
			ВтораяСтрока.НомерГТД = Неопределено;
			//ВтораяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			
			СтрокаМассивПовтора = МассивПовтора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаМассивПовтора,ВтораяСтрока);
		КонецЕсли;
	Иначе  // строка по нескольким ГТД.
		ОстатокВСтроке = стр.Количество;
		ОстатокСуммаНДС = стр.СуммаНДС;
		ОстатокСуммаСНДС = стр.СуммаСНДС;
		Для Каждого дСтр Из НайденныеСтроки Цикл
			Если ОстатокВСтроке = 0 Тогда
				Прервать;
			КонецЕсли;
			Если дСтр.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Если дСтр.Количество >= ОстатокВСтроке Тогда // вся строка по 1 ГТД
				НоваяСтрока = ТабТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
				НоваяСтрока.Количество = ОстатокВСтроке;
				НоваяСтрока.КоличествоУпаковок = ОстатокВСтроке;
				НоваяСтрока.СуммаНДС = ОстатокСуммаНДС;
				НоваяСтрока.СуммаСНДС = ОстатокСуммаСНДС;
				НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.СуммаСНДС;
				НоваяСтрока.НомерГТД = дСтр.НомерГТД;
				//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
				дСтр.Количество = дСтр.Количество - ОстатокВСтроке;
				ОстатокВСтроке = 0;
				ОстатокСуммаНДС = 0;
				ОстатокСуммаСНДС = 0;
			Иначе  // по ГТД меньше, забираем всю найденную строку
				НоваяСтрока = ТабТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
				НоваяСтрока.СуммаНДС = Окр(ОстатокСуммаНДС/ОстатокВСтроке*дСтр.Количество,2);
				НоваяСтрока.СуммаСНДС = Окр(ОстатокСуммаСНДС/ОстатокВСтроке*дСтр.Количество,2);
				НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.СуммаСНДС;
				НоваяСтрока.Количество = дСтр.Количество;
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				НоваяСтрока.НомерГТД = дСтр.НомерГТД;
				//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
				дСтр.Количество = 0;
				ОстатокВСтроке = ОстатокВСтроке - НоваяСтрока.Количество;
				ОстатокСуммаНДС = ОстатокСуммаНДС - НоваяСтрока.СуммаНДС;
				ОстатокСуммаСНДС = ОстатокСуммаСНДС - НоваяСтрока.СуммаСНДС;
			КонецЕсли;
		КонецЦикла;
		Если ОстатокВСтроке <> 0 Тогда
			НоваяСтрока = ТабТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
			НоваяСтрока.Количество = ОстатокВСтроке;
			НоваяСтрока.КоличествоУпаковок = ОстатокВСтроке;
			НоваяСтрока.СуммаНДС = ОстатокСуммаНДС;
			НоваяСтрока.СуммаСНДС = ОстатокСуммаСНДС;
			НоваяСтрока.СуммаВзаиморасчетов = НоваяСтрока.СуммаСНДС;
			НоваяСтрока.НомерГТД = Неопределено;
			//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();

			СтрокаМассивПовтора = МассивПовтора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаМассивПовтора,НоваяСтрока);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
