
&После("ПроверитьЗаполнитьЭтапыГрафикаОплаты")
Процедура ЕТС_ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект, Знач ДополненныеПараметрыМеханизма, ТаблицаЭтаповГрафикаОплаты)

	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ОбъектДокумент = Объект.Объект;
	Иначе 
		ОбъектДокумент = Объект;
	КонецЕсли;
	Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектДокумент,"ЭтапыГрафикаОплаты") Тогда
		ОтсрочкаПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектДокумент.Договор,"ЕТС_ОтсрочкаПлатежа");
		Попытка
			Для каждого Стр Из ОбъектДокумент.ЭтапыГрафикаОплаты Цикл
				Стр.ДатаПлатежа = ОбъектДокумент.Дата + 86400 * ОтсрочкаПлатежа;
			КонецЦикла; 
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
