
&После("ДобавитьКомандыПечати")
Процедура ЕТС_ДобавитьКомандыПечати(КомандыПечати)
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "ЕТС_ПечатьКлиент.ПечатьДоговораСКонтрагентом";
	//КомандаПечати.МенеджерПечати = "";
	//КомандаПечати.Идентификатор = "ПечатьДоговораСКонтрагентом";
	//КомандаПечати.Представление = НСтр("ru = 'Договор с контрагентом (Общая ООО ИП и Филиалы)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.Порядок = 2;

КонецПроцедуры
