Процедура ЕТС_ОбрезаниеКодаСправочникаПоДлинеПередЗаписью(Источник, Отказ) Экспорт
	Если СтрДлина(СокрЛП(Источник.Код)) > 8 Тогда 
		Источник.Код = ОбрезатьКод(Источник.Код, 8);
	КонецЕсли;
КонецПроцедуры

Процедура ЕТС_ОбрезаниеНомераДокументаПоДлинеПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если СтрДлина(СокрЛП(Источник.Номер)) > 10 Тогда 
		Источник.Номер = ОбрезатьКод(Источник.Номер, 10);
	КонецЕсли;
КонецПроцедуры

Функция ОбрезатьКод(Код, Длина)
	нКод = СокрЛП(Код); 
	КодДлина = СтрДлина(СокрЛП(Код));
	КолУбрать = КодДлина - Длина;
	Если КолУбрать > 0 Тогда
		Позиция0 = СтрНайти(Код, "0"); 
		Если Позиция0 <> 0 Тогда
			нКод = Лев(нКод, Позиция0-1) + Прав(нКод,КодДлина-Позиция0-КолУбрать+1);
		КонецЕсли;
	КонецЕсли;
	Возврат нКод;
КонецФункции

Процедура ЕТС_ЗаписатьДанныеДляСайтаПриЗаписи(Источник, Отказ) Экспорт
	//Если Источник.ДополнительныеСвойства.Свойство("ЗаписьИзФормы") Тогда
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
			Менеджер = РегистрыСведений.ЕТС_ОбменССайтом.СоздатьМенеджерЗаписи();
			Менеджер.GUID = Источник.Ссылка.УникальныйИдентификатор();
			Менеджер.ИмяМетаданных = "Номенклатура";
			Менеджер.ДатаСоздания = ТекущаяДата();
			Менеджер.Записать();
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры


#Область Обработка_Проведения_УдаленияПроведения_Документа
Процедура ЕТС_ДокументОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);

	Если РегистрацияНаСайте(ТипИсточника, Источник) Тогда
		ЗарегистрироватьДанныеДляСайта(ТипИсточника, Источник);	
	КонецЕсли;

	Если УдалениеДвиженийПеремещения(ТипИсточника, Источник) Тогда
		УдалитьДвиженияПеремещенияВФилиал(Источник);	
	КонецЕсли;

	Если СозданиеПеремещенийВФилиал(ТипИсточника, Источник) Тогда
		СоздатьПеремещениеВФилиал(ТипИсточника, Источник);	
	КонецЕсли;
	
	ПроверитьДоговор(ТипИсточника, Источник, Отказ);

КонецПроцедуры

Процедура ЕТС_ДокументОбработкаУдаленияПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт

	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);

	Если СозданиеПеремещенийВФилиал(ТипИсточника, Источник) Тогда
		УдалитьПеремещениеВФилиал(ТипИсточника, Источник);	
	КонецЕсли;
КонецПроцедуры 

Функция РегистрацияНаСайте(ТипИсточника, Источник)
	
	Если ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") И
		Источник.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами И
		Источник.СкладОтправитель <> Источник.СкладПолучатель Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровПоставщику") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ПроизводствоБезЗаказа") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция УдалениеДвиженийПеремещения(ТипИсточника, Источник)
	
	Если ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") И
		Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами И
		Источник.СкладОтправитель = Источник.СкладПолучатель Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СозданиеПеремещенийВФилиал(ТипИсточника, Источник)
	
	Если (ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровПоставщику") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВводОстатковТоваров") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВнутреннееПотребление") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")) И
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация,"ОбособленноеПодразделение") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьДоговор(ТипИсточника, Источник, Отказ)
	
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") И 
		(Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению ИЛИ Источник.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке)
		И Не ЗначениеЗаполнено(Источник.Договор) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Заполните договор контрагента!");
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗарегистрироватьДанныеДляСайта(ТипИсточника, Источник)
	//Зарегистрируем для переноса на сайт данные
	ОбъектОписания = Метаданные.НайтиПоТипу(ТипИсточника);
	Менеджер = РегистрыСведений.ЕТС_ОбменССайтом.СоздатьМенеджерЗаписи();
	Менеджер.GUID = Источник.Ссылка.УникальныйИдентификатор();
	Менеджер.ИмяМетаданных = ОбъектОписания.Имя;
	Менеджер.ДатаСоздания = ТекущаяДата();
	Менеджер.Записать();
КонецПроцедуры
// удаляем движения для перемещений в филиал
Процедура УдалитьДвиженияПеремещенияВФилиал(Источник)
	НаборЗаписейЗапасыИПотребности = РегистрыНакопления.ЗапасыИПотребности.СоздатьНаборЗаписей();
	НаборЗаписейЗапасыИПотребности.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	НаборЗаписейТоварыКОтгрузке = РегистрыНакопления.ТоварыКОтгрузке.СоздатьНаборЗаписей();
	НаборЗаписейТоварыКОтгрузке.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	НаборЗаписейТоварыКПоступлению = РегистрыНакопления.ТоварыКПоступлению.СоздатьНаборЗаписей();
	НаборЗаписейТоварыКПоступлению.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	Попытка
		НаборЗаписейЗапасыИПотребности.Записать();
		НаборЗаписейТоварыКОтгрузке.Записать();
		НаборЗаписейТоварыКПоступлению.Записать();
	Исключение
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Ошибка удаления движений при проведении документа.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
КонецПроцедуры

Процедура СоздатьПеремещениеВФилиал(ТипИсточника, Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		об = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		об = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;
	
	об.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами;
	об.ДокументОснование = Источник.Ссылка;
	об.СкладОтправитель = Источник.Склад;
	об.СкладПолучатель = об.СкладОтправитель;
	об.Подразделение = Источник.Подразделение;
	об.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	об.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято; 
	об.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	об.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	
	Если ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровПоставщику") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВнутреннееПотребление") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		об.Дата = Макс(Источник.Дата-1,НачалоДня(Источник.Дата));
		об.Организация = Источник.Организация.ГоловнаяОрганизация;
		об.ОрганизацияПолучатель = Источник.Организация;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВводОстатковТоваров") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") ИЛИ
		ТипИсточника = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		об.Дата = Мин(Источник.Дата+1, КонецДня(Источник.Дата));
		об.Организация = Источник.Организация;
		об.ОрганизацияПолучатель = Источник.Организация.ГоловнаяОрганизация;
	КонецЕсли;
	
	об.Товары.Очистить(); 
	об.ВидыЗапасов.Очистить();
	Для Каждого стр Из Источник.Товары Цикл 
		НоваяСтрока = об.Товары.Добавить();
		НоваяСтрока.Номенклатура = стр.Номенклатура;
		НоваяСтрока.Упаковка = стр.Упаковка;
		НоваяСтрока.Количество = стр.Количество;
		НоваяСтрока.КоличествоУпаковок = стр. КоличествоУпаковок;
		НоваяСтрока.Назначение = стр.Назначение;
		НоваяСтрока.НазначениеОтправителя = стр.Назначение;
	КонецЦикла;
	об.ПометкаУдаления = Ложь;
	
	Попытка
		об.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Попытка
			об.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			об.ОбменДанными.Загрузка = Истина;
			об.Записать(РежимЗаписиДокумента.Запись); 
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьПеремещениеВФилиал(ТипИсточника, Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		об = Рез.Ссылка.ПолучитьОбъект();
	
		об.ПометкаУдаления = Источник.ПометкаУдаления;
		
		Попытка
			об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			Попытка
				об.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				об.ОбменДанными.Загрузка = Истина;
				об.Записать(РежимЗаписиДокумента.Запись); 
			КонецПопытки;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

Процедура ЕТС_ПереносВремениПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.Дата = КонецДня(Источник.Дата) Тогда
		Источник.Дата = Источник.Дата - 300;
	КонецЕсли;
КонецПроцедуры


