
&НаКлиенте
&ИзменениеИКонтроль("ПоказатьДанныеВЗависимостиОтОтраженияВУчете")
Процедура ЕТС_ПоказатьДанныеВЗависимостиОтОтраженияВУчете(КонтрольОтраженияВУчете)

	Если КонтрольОтраженияВУчете = 0 Тогда
		ПоказатьСопоставлениеНоменклатуры();
#Удаление
	ИначеЕсли КонтрольОтраженияВУчете = 1 Тогда
#КонецУдаления
#Вставка
    Иначе
#КонецВставки
		ПоказатьРасширенныйПодборДокументовУчета();
#Удаление
	Иначе
		ПоказатьУчетныйДокумент();
#КонецУдаления
	КонецЕсли;

КонецПроцедуры
