
Функция AddOrder(Order)
	
	 ПространствоИмен="ets";
	 OrderResult = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен,"OrderResult"));
	 

	
	СоздаватьНоменклатуру = Истина;//НастройкаОбмена.СоздоватьНоменклатуру;	
	СоздаватьКонтрагентов = Истина;//НастройкаОбмена.СоздаватьКонтрагентов;
	
	//Если заказ уже есть, то делать ничего не будем
	ЗаказССайтаСсылка = Документы.КоммерческоеПредложениеКлиенту.НайтиПоНомеру(Order.id);
	Если ЗаказССайтаСсылка = Документы.КоммерческоеПредложениеКлиенту.ПустаяСсылка() Тогда
		НовыйЗаказССайта = Документы.КоммерческоеПредложениеКлиенту.СоздатьДокумент();
	Иначе 
		 //результат по умолчанию
		 OrderResult.result = Истина;
		 OrderResult.Text   = "Документ уже отправлен!";
		 OrderResult.GUID   = СериализаторXDTO.XMLСтрока(НовыйЗаказССайта.Ссылка);
		Возврат OrderResult;
		//НовыйЗаказССайта = ЗаказССайтаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	НовыйЗаказССайта.Дата = ТекущаяДата();
	НовыйЗаказССайта.Номер = Order.id; 
	
	//  Начало Беляев В.Д. 20/02/2024
	НовыйЗаказССайта.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("НалоговыйНомер",Order.code_1c);
	Если Не ЗначениеЗаполнено(НовыйЗаказССайта.Контрагент) Тогда
		НовыйЗаказССайта.Клиент = Справочники.Партнеры.НеизвестныйПартнер;
	Иначе 
		НовыйЗаказССайта.Клиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.Контрагент, "Партнер");
	КонецЕсли;
	НовыйЗаказССайта.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7726389728");
	НовыйЗаказССайта.ЕТС_Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(Order.partner_id);
	НовыйЗаказССайта.ХозяйственнаяОперация = Перечисления.ВидыОперацийКоммерческихПредложений.ЗакупкаУПоставщика;
	НовыйЗаказССайта.ЦенаВключаетНДС = Истина;
	НовыйЗаказССайта.Налогообложение = Истина;
	НовыйЗаказССайта.СрокДействия = НовыйЗаказССайта.Дата + 3*86400;
	НовыйЗаказССайта.Статус = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик;
	НовыйЗаказССайта.Валюта = Константы.БазоваяВалютаПоУмолчанию.Получить();
	НовыйЗаказССайта.ЕТС_ДатаЗаказаНаСайте = Order.created_at;
	ПользовательИБ = Справочники.Пользователи.НайтиПоРеквизиту("ЕТС_Код",Order.manager_id);
	Если НовыйЗаказССайта.Клиент <> Справочники.Партнеры.НеизвестныйПартнер Тогда
		ДанныеЗаказа = Новый Структура("Email,Фамилия,Имя,Отчество,Телефон");
		ДанныеЗаказа.Email = Order.email;
		ДанныеЗаказа.Фамилия = Order.family_name;
		ДанныеЗаказа.Имя = Order.name;
		ДанныеЗаказа.Отчество = Order.second_name;
		ДанныеЗаказа.Телефон = Order.phone;
		НовыйЗаказССайта.КонтактноеЛицо = ЕТС_ОбменССайтом.ПолучитьКонтактноеЛицо(ДанныеЗаказа, НовыйЗаказССайта.Клиент);
	КонецЕсли;
	Если Не (ПользовательИБ = Справочники.Пользователи.ПустаяСсылка() Или
		Справочники.Пользователи.НайтиПоРеквизиту("ЕТС_Код","").Наименование <> "<Не указан>") Тогда
		НовыйЗаказССайта.Менеджер = ПользовательИБ;
		Если НовыйЗаказССайта.Клиент <> Справочники.Партнеры.НеизвестныйПартнер Тогда
			ОсновнойМенеджерПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.Клиент,"ОсновнойМенеджер");
			Если ОсновнойМенеджерПартнера <> НовыйЗаказССайта.Менеджер Тогда
				КлиентОбъект = НовыйЗаказССайта.Клиент.ПолучитьОбъект();	
				КлиентОбъект.ОсновнойМенеджер = НовыйЗаказССайта.Менеджер;
				КлиентОбъект.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20)));
	Товары.Колонки.Добавить("НаименованиеПроизводителя", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
	Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10)));
	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	Товары.Колонки.Добавить("_ЛВГ_КодПрайсЛиста", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(8)));
	
	//ТЗ_Товары = СтрокаЗаказ.Товары.Скопировать(,"Артикул,Количество,Цена,_ЛВГ_КодПрайсЛиста,НаименованиеПроизводителя");
	//Заполним ТЗ Товары
	Для каждого ЭлементТовары Из Order.order_item Цикл
		НоваяСтрокаТовары = Товары.Добавить();
		НоваяСтрокаТовары.Артикул = ЭлементТовары.oem;
		НоваяСтрокаТовары.НаименованиеПроизводителя = ЭлементТовары.make_name;
		НоваяСтрокаТовары.Количество = ЭлементТовары.qnt;
		НоваяСтрокаТовары.Цена = ЭлементТовары.cost;
		НоваяСтрокаТовары._ЛВГ_КодПрайсЛиста = ЭлементТовары.price_code1c;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ_Товары.Артикул КАК Артикул,
	|	ТЗ_Товары.Количество КАК Количество,
	|	ТЗ_Товары.Цена КАК Цена,
	|	ТЗ_Товары._ЛВГ_КодПрайсЛиста КАК КодПрайсЛиста,
	|	ТЗ_Товары.НаименованиеПроизводителя КАК НаименованиеПроизводителя
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ_Товары КАК ТЗ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ВидыЦен.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Цена КАК Цена,
	|	ТЗ.Количество * ТЗ.Цена КАК Сумма,
	|	ТЗ.Количество * ТЗ.Цена КАК СуммаСНДС,
	|	&СтавкаНДС КАК СтавкаНДС,
	//|	ТЗ.Количество * ТЗ.Цена * 20 / 120 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляПартнера)
	|			ТОГДА ЕСТЬNULL(СоглашенияСПоставщиками.СрокПоставки, 0) + ЕСТЬNULL(СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа, 0)
	//|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
	//|				И ВидыЦен.ЕТС_Склад = &Склад
	//|			ТОГДА 1
	|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
	|				И Не ВидыЦен.ЕТС_Склад = &Склад
	|			ТОГДА ЕСТЬNULL(СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокПоставки
	//Для удобства отладки дополнительные поля
	//|	,СоглашенияСПоставщиками.Ссылка КАК ЕТС_СоглашениеСПоставщиком,
	//|	ВидыЦен.ЕТС_Склад КАК Склад,
	//|	СпособыОбеспеченияПотребностей.Ссылка КАК СпособОбеспечения,
	//|	СоглашенияСПоставщиками.Склад КАК СкладСоглашения,
	//|	СоглашенияСПоставщиками.СрокПоставки КАК СрокПоставкиСоглашения,
	//|	СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа КАК СрокПоставкиОбеспечения
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Производители КАК Производители
	|		ПО ТЗ.НаименованиеПроизводителя = Производители.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТЗ.Артикул = Номенклатура.Артикул
	|			И (Номенклатура.Производитель = Производители.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|			ПО ВидыЦен.ЕТС_СоглашениеСПоставщиком = СоглашенияСПоставщиками.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпособыОбеспеченияПотребностей
	|			ПО (ВЫБОР
	|					КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляПартнера)
	|							И СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
	|							И СоглашенияСПоставщиками.Склад = СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей
	|							И СпособыОбеспеченияПотребностей.Подразделение = &Подразделение
	|						ТОГДА ИСТИНА
	|					КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
	|							И СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
	|							И ВидыЦен.ЕТС_Склад = СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей
	|							И СпособыОбеспеченияПотребностей.Подразделение = &Подразделение
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|		ПО ТЗ.КодПрайсЛиста = ВидыЦен.ЕТС_КодПрайса";
	
	Запрос.УстановитьПараметр("ТЗ_Товары", Товары);
	Запрос.УстановитьПараметр("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20));
	Запрос.УстановитьПараметр("Подразделение", НовыйЗаказССайта.ЕТС_Подразделение);
	Запрос.УстановитьПараметр("Склад", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.ЕТС_Подразделение,"ЕТС_Склад"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТЧТоварыНоваяСтрока = НовыйЗаказССайта.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТЧТоварыНоваяСтрока,Выборка);
		ТЧТоварыНоваяСтрока.СуммаНДС = Окр(Выборка.Сумма - 100 * Выборка.Сумма / (100 + 20), 2, РежимОкругления.Окр15как20);
	КонецЦикла;
	
	НовыйЗаказССайта.СуммаДокумента = НовыйЗаказССайта.Товары.Итог("Сумма");
	
	ПровелиДокумент = Ложь;
	
	Ошибка = "";
	
	Попытка
		НовыйЗаказССайта.Записать(РежимЗаписиДокумента.Проведение);
		Если НовыйЗаказССайта.Клиент = Справочники.Партнеры.НеизвестныйПартнер Тогда
			НаборЗаписей = РегистрыСведений.ЕТС_ЗагрузкаССайтаКонтрагенты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Заказ.Установить(НовыйЗаказССайта.Ссылка);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Заказ = НовыйЗаказССайта.Ссылка;
			НоваяЗапись.Наименование = Order.company_name;
			НоваяЗапись.ИНН = Order.inn;
			НоваяЗапись.КПП = Order.kpp;
			НоваяЗапись.Телефон = Order.phone;
			НаборЗаписей.Записать();
		КонецЕсли;
		ПровелиДокумент = Истина;
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	//результат по умолчанию
	OrderResult.result = ПровелиДокумент;
	OrderResult.Text   = Ошибка;
	OrderResult.GUID   = ?(ПровелиДокумент,СериализаторXDTO.XMLСтрока(НовыйЗаказССайта.Ссылка),"");
	
	Возврат OrderResult;
	
КонецФункции
