
&ИзменениеИКонтроль("ВыполнитьКонтрольРезультатовПроведения")
Процедура ЕТС_ВыполнитьКонтрольРезультатовПроведения(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ)

	Если ЗначениеЗаполнено(ПараметрыСеанса.ПараметрыОбработчикаОбновления.РежимВыполнения) Тогда
		Возврат;
	КонецЕсли;

	Запрос        = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Для каждого Механизм Из Механизмы Цикл

		Если Не ЗначениеЗаполнено(Механизм.Значение.КонтрольныеРегистрыИзменений) Тогда
			Продолжить;
		КонецЕсли;

		Механизм.Значение.МодульМеханизма.ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ);

	КонецЦикла;

	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыКонтроля = ОбщегоНазначенияУТ.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, Истина);
	
	Для каждого Механизм Из Механизмы Цикл
		
		Если Не ЗначениеЗаполнено(Механизм.Значение.КонтрольныеРегистрыИзменений) Тогда
			Продолжить;
		КонецЕсли;
		
		Механизм.Значение.МодульМеханизма.СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ);
		
	КонецЦикла;

#Вставка
	Если РольДоступна("ЕТС_Администратор") Или РольДоступна("ЕТС_ОтключитьПросроченнуюЗадолженность") Или 
		Документ.ДополнительныеСвойства.Свойство("ВебСервис") Тогда 
		Отказ = Ложь;
    КонецЕсли;
#КонецВставки 

	Если Отказ Тогда

		Если СвойстваДокумента(Документ).РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ТекстСообщения = НСтр("ru = 'Проведение не выполнено %1'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Отмена проведения не выполнена %1'");
		КонецЕсли;

		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Строка(Документ)), Документ);

	КонецЕсли;

КонецПроцедуры
