
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаПечати", Новый ОписаниеТипов("ТаблицаЗначений")));
    
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"ТаблицаПечати" ,"Номенклатура"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроизвольныйТекст2", Новый ОписаниеТипов("Строка", ,,Новый КвалификаторыСтроки(200)), "ТаблицаПечати" ,"ПроизвольныйТекст2"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроизвольныйТекст3", Новый ОписаниеТипов("Строка", ,,Новый КвалификаторыСтроки(200)), "ТаблицаПечати" ,"ПроизвольныйТекст3"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Печатать", Новый ОписаниеТипов("Булево"), "ТаблицаПечати" ,"Печатать"));
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	//ЭтотОбъект.ТаблицаПечати.Загрузить(СтруктураДанных.Товары);
	Для каждого Стр Из СтруктураДанных Цикл
		НоваяСтрока = ЭтотОбъект.ТаблицаПечати.Добавить();	
		НоваяСтрока.Номенклатура = Стр;
	
	КонецЦикла;
	
    ТаблицаФормы = Элементы.Добавить("ТаблицаПечати", Тип("ТаблицаФормы"));
	ТаблицаФормы.ПутьКДанным = "ТаблицаПечати";
	//ТаблицаФормы.КоманднаяПанель.Видимость = Ложь;
	
	НоваяКоманда = Команды.Добавить("ВключитьВсе");
	НоваяКоманда.Действие = "ВключитьВсе";//Имя процедуры
	НоваяКоманда.Заголовок = "";
	
	
	НовыйЭлемент = Элементы.Добавить("ВключитьВсе",
	                                 Тип("КнопкаФормы"),
									 ТаблицаФормы.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ВключитьВсе";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	
	НоваяКоманда = Команды.Добавить("ВыключитьВсе");
	НоваяКоманда.Действие = "ВыключитьВсе";//Имя процедуры
	НоваяКоманда.Заголовок = "";
	
	
	НовыйЭлемент = Элементы.Добавить("ВыключитьВсе",
	                                 Тип("КнопкаФормы"),
									 ТаблицаФормы.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ВыключитьВсе";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СнятьФлажки;
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
    
	НоваяКолонка = Элементы.Добавить("ТаблицаПечатиПечатать", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.ПутьКДанным = "ТаблицаПечати.Печатать";
	НоваяКолонка.Заголовок = "Печатать";
	НоваяКолонка = Элементы.Добавить("ТаблицаПечатиНоменклатура", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаПечати.Номенклатура";
	НоваяКолонка.Заголовок = "Номенклатура";
    НоваяКолонка = Элементы.Добавить("ТаблицаПечатиПроизвольныйТекст2", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаПечати.ПроизвольныйТекст2";
	НоваяКолонка.Заголовок = "ПроизвольныйТекст2";
	НоваяКолонка = Элементы.Добавить("ТаблицаПечатиПроизвольныйТекст3", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаПечати.ПроизвольныйТекст3";
	НоваяКолонка.Заголовок = "ПроизвольныйТекст3";
	
	НоваяКоманда = Команды.Добавить("Печать");
	НоваяКоманда.Действие = "Печать";//Имя процедуры
	НоваяКоманда.Заголовок = "";
	
	
	НовыйЭлемент = Элементы.Добавить("Печать",
	                                 Тип("КнопкаФормы"),
									 ТаблицаФормы.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "Печать";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Печать;
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсе()

	Для каждого Стр Из ЭтотОбъект.ТаблицаПечати Цикл
	
		Стр.Печатать = Истина;	
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсе()

	Для каждого Стр Из ЭтотОбъект.ТаблицаПечати Цикл
	
		Стр.Печатать = Ложь;	
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Печать()

	ТаблДокум = ПечатьНаСервере();
	ТаблДокум.Показать("Печать документа");

КонецПроцедуры

Функция ПечатьНаСервере()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.РазмерКолонтитулаСверху  = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетка";
	
	Макет = ПолучитьОбщийМакет("ЭтикеткаСклад");
	
	Для каждого Стр Из ЭтотОбъект.ТаблицаПечати Цикл
		Если Стр.Печатать Тогда
			Артикул = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура,"Артикул");
			ОбластьШапка = Макет.ПолучитьОбласть("Товар");
			ОбластьШапка.Параметры.Артикул      = Артикул;
			ОбластьШапка.Параметры.ПроизвольныйТекст1 = СОкрЛП(Стр.ПроизвольныйТекст2);
			ОбластьШапка.Параметры.ПроизвольныйТекст2 = СОкрЛП(Стр.ПроизвольныйТекст3);
			ТабДокумент.Вывести(ОбластьШапка);
		КонецЕсли;
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции



