
&Вместо("ЗаполнитьМенеджера")
Процедура ЕТС_ЗаполнитьМенеджера(ДокументОбъект, Перезаполнить, ПоляПоиска)

	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ
		ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		Возврат;
	Иначе
		ПродолжитьВызов(ДокументОбъект, Перезаполнить, ПоляПоиска);
	КонецЕсли;

КонецПроцедуры

&Вместо("УстановитьМенеджера")
Процедура ЕТС_УстановитьМенеджера(Объект, ДокументОснование, ПараметрыЗаполнения)
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ
		ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		Возврат;
	Иначе
		ПродолжитьВызов(Объект, ДокументОснование, ПараметрыЗаполнения);
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьОтветственныхЛицДокумента")
Процедура ЕТС_ЗаполнитьОтветственныхЛицДокумента(Объект, ДанныеЗаполнения, ПерезаполнятьНепустыеРеквизиты)
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ
		ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		Объект.Менеджер = Неопределено;
	КонецЕсли;
КонецПроцедуры
