Функция ВыполнитьОбменССервером(СтруктураДанных,ИмяМетода) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	ДанныеСтрокой = ЗаписьJSON.Закрыть();
	ПараметрыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.ЕТС_НастройкиОбменов.ОбменКА_Альфа,"АдресСервера,ИмяБазы,Пользователь,Пароль");
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		ИмяПубликации = ПараметрыПодключения.ИмяБазы;
		HTTPЗапрос = Новый HTTPЗапрос(ИмяПубликации + "/hs/ExchangeKA/" + ИмяМетода +"/?" + ИмяМетода + "=" + ДанныеСтрокой);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON = Новый ЧтениеJSON();
			
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Иначе 
			ОбщегоНазначения.СообщитьПользователю("Ошибка соединения " + Строка(Ответ.КодСостояния));
		КонецЕсли;  
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Возврат ДанныеJSON;
	

КонецФункции // ВыполнитьОбменССервером() 

Функция ПолучитьДанныеREST(АдресРесурса,ПолеПоиска) Экспорт 

	Попытка
		HTTPСоединение = Новый HTTPСоединение(Константы.АдресЦентральнойБазы.Получить(),,"ЛёвочкинВ","123121");
		ИмяПубликации = "";//Константы.ИмяПубликации.Получить();
		АдресРесурса = СтрШаблон(АдресРесурса,ИмяПубликации,ПолеПоиска);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON = Новый ЧтениеJSON();
			
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			ДанныеREST = ПрочитатьJSON(ЧтениеJSON, Истина,,,,,,);
			ЧтениеJSON.Закрыть();
		КонецЕсли;  
	Исключение
		//Сигнал();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Возврат ДанныеREST;

КонецФункции // ПолучитьДанныеREST()

Функция ИнициализироватьПараметрыПодключения() Экспорт
	
	ПараметыСоединения = Новый Структура("СерверИсточник,Адрес,Авторизация,КлючьАвторизации,Ошибка,Результат");
	ПараметыСоединения.СерверИсточник = "api.etsgroup.ru";
	ПараметыСоединения.Адрес = "";
	ПараметыСоединения.Авторизация = "Authorization";
	ПараметыСоединения.КлючьАвторизации = "Bearer 1c=d@enu324d32yhr73rg23r673gufbHHGjwad-34902-!123";
	ПараметыСоединения.Ошибка = "";
	ПараметыСоединения.Результат = "";
	
	Возврат ПараметыСоединения;

КонецФункции // ИнициализироватьПараметрыПодключения()

Функция ПолучитьДанныеREST_API(ПараметыСоединения) Экспорт
	
	Данные = Новый Массив;
	Путь = КаталогВременныхФайлов();
	HTTPЗапрос = Новый HTTPЗапрос(ПараметыСоединения.Адрес);
    HTTPЗапрос.Заголовки.Вставить(ПараметыСоединения.Авторизация, ПараметыСоединения.КлючьАвторизации);
	ИмяВхФайла = Путь + "temp.json";
	HTTP = Новый HTTPСоединение(ПараметыСоединения.СерверИсточник,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPОтвет = HTTP.ВызватьHTTPМетод("GET", HTTPЗапрос, ИмяВхФайла);
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.ОткрытьФайл(ИмяВхФайла);
		Данные = ПрочитатьJSON(Чтение, Истина,,,,,,);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

