
&НаКлиенте
Процедура ЕТС_ТоварыПриАктивизацииСтрокиПосле(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьТЗОстаткиНаФорме(Элемент.ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗОстаткиНаФорме(Номенклатура)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Склад.Наименование КАК Склад,
		|	ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличии,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток + ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0) КАК ВРезерве
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Номенклатура = &Номенклатура) КАК ЗапасыИПотребностиОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ЭтаФорма.ТаблицаОстатков.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЕТС_ТоварыНоменклатураОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ЗаполнитьТЗОстаткиНаФорме(ВыбранноеЗначение);
		Текущиеданные = Элементы.Товары.ТекущиеДанные;
		Текущиеданные.Остаток = ЕТС_ПрограммныеФормы.ПолучитьОстатокПоНоменклатуре(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕТС_СвязанныеДокументы(Команда)
	КомандаСвязанныеДокументы = ЭтотОбъект.Команды.Найти("ПодменюОтчетыСмТакже__Авто_DFF4A1BC964F18C76E1B5EA04556DBE9");
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, КомандаСвязанныеДокументы, Объект);
КонецПроцедуры






