
&ИзменениеИКонтроль("СообщитьОшибкиЗаполнения")
Процедура ЕТС_СообщитьОшибкиЗаполнения(Выборка, Отказ)

	ИмяТЧ			= "ТаблицаКорректировки";
	ПредставлениеТЧ	= НСтр("ru = 'Данные корректировки'");

	ШаблонСообщенияНеЗаполненоПоле							= НСтр("ru = 'Поле ""%1"" не заполнено'");
	ШаблонСообщенияНеЗаполненаКолонка						= НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""%3""'");
	ШаблонСообщенияОшибкаПересчетаКоличества				= НСтр("ru = 'Обнаружено нулевое %1 при пересчете в единицу хранения в строке %2 списка ""%3""'");
	ШаблонСообщенияНеУказанаВариантОтраженияСписания		= НСтр("ru = 'Не указан вариант списания принятых позиций в строке %1 списка ""%2""'");
	ШаблонСообщенияНеУказанаВариантОтраженияРасхождения		= НСтр("ru = 'Не указан вариант отражения расхождений по строке %1 списка ""%2""'");
	ШаблонСообщенияНеУказанСпособОпределенияСебестоимости	= НСтр("ru = 'Не указан способ определения себестоимости по строке %1 списка ""%2""'");
	ШаблонСообщенияНеСоответствуетОснованию					= НСтр("ru = 'Поле ""%1"" не соответствует аналогичному полю документа основания'");
	ШаблонСообщенияНеСоответствуетПерыдущейКорректировке	= НСтр("ru = 'Поле ""%1"" не соответствует аналогичному полю предыдущей корректировки'");
	ШаблонСообщенияНеЗаполненаКолонкаСуммыВознаграждения	= НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""%3"". %4'");
	ШаблонСообщенияКоличествоГТДУвеличения                  = НСтр("ru = 'Для товаров с %1 необходимо указать данные %1 уже реализованных товаров, добавив строки с данными до и после корректировки.
	|Если они не менялись, то данные до корректировки и после должны совпадать.
	|По количеству на увеличение необходимо в строке %2 списка ""%3"" указать исходное количество 0, а количество после - количество, на которое увеличена реализация.'");

	ТекстГТДРНПТ = НСтр("ru = 'ГТД'");
	//++ Локализация
	Если УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата(1, 1, 1)) Тогда	
		ТекстГТДРНПТ = НСтр("ru = 'ГТД/РНПТ'");
	КонецЕсли;
	//-- Локализация

	ШаблонСообщенияКоличествоГТДУвеличения = СтрШаблон(ШаблонСообщенияКоличествоГТДУвеличения, ТекстГТДРНПТ, "%1", "%2");

	Пока Выборка.Следующий() Цикл

		Если Выборка.ТипПроверки = "НеУказанСклад" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненоПоле, НСтр("ru = 'Склад'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Склад",
			"Объект",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаНоменклатура" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Номенклатура'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Номенклатура");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноСодержание" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Содержание'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Содержание");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаХарактеристика" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Характеристика'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Характеристика");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанНомерГТД" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Номер ГТД'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"НомерГТД");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "ОшибкаПересчетаКоличества" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияОшибкаПересчетаКоличества,
			НСтр("ru = 'количество до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоУпаковок");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноКоличествоУпаковок" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Количество упаковок до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоУпаковок");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "ОшибкаПересчетаКоличестваПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияОшибкаПересчетаКоличества,
			НСтр("ru = 'количество после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоУпаковокПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноКоличествоУпаковокПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Количество упаковок после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоУпаковокПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноКоличествоПоРНПТ" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Количество по РНПТ до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоПоРНПТ");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноКоличествоПоРНПТПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Количество по РНПТ после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоПоРНПТПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "КоличествоПоГТДПриУвеличении" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияКоличествоГТДУвеличения,
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"КоличествоУпаковок");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

#Удаление
		Если Выборка.ТипПроверки = "НеУказанаЦенаДо" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Цена до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Цена");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаЦенаПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Цена после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"ЦенаПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаСуммаДо" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Сумма до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Сумма");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаСуммаПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Сумма после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СуммаПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;
#КонецУдаления
		
		Если Выборка.ТипПроверки = "НеУказанаСтавкаНДС" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Ставка НДС до корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СтавкаНДС");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаСтавкаНДСПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Ставка НДС после корректировки'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СтавкаНДСПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаВариантОтраженияСписания" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеУказанаВариантОтраженияСписания,
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"ВариантОтраженияСписания");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаВариантОтраженияРасхождения" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеУказанаВариантОтраженияРасхождения,
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"ВариантОтражения");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанСкладВТабличнойЧасти" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Склад'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Склад");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказаноПодразделениеВТабличнойЧасти" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонка,
			НСтр("ru = 'Подразделение-отправитель'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"Подразделение");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанСпособОпределенияСебестоимости" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеУказанСпособОпределенияСебестоимости,
			Выборка.НомерСтроки,
			ПредставлениеТЧ);

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СпособОпределенияСебестоимостиСтрокой");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НалогообложениеНДСНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Налогообложение'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.НалогообложениеНДС",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ОрганизацияНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Организация'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.Организация",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ПартнерНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Клиент'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.Партнер",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "КонтрагентНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Контрагент'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.Контрагент",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ДоговорНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Договор'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.Договор",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ПорядокРасчетовНеСоответствуетОснованию" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетОснованию, НСтр("ru = 'Порядок расчетов'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.ПорядокРасчетов",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ТипКорректировкиНеСоответствуетПредыдущей" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетПерыдущейКорректировке, НСтр("ru = 'Тип корректировки'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.ТипКорректировки",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "ЦенаВключаетНДСНеСоответствуетПредыдущей" Тогда

			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеСоответствуетПерыдущейКорректировке, НСтр("ru = 'Цена включает НДС'"));

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			"Объект.ЦенаВключаетНДС",
			"",
			Отказ);

		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаСуммаВзаиморасчетов" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонкаСуммыВознаграждения,
			НСтр("ru = 'Сумма взаиморасчетов до корректировки.'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ,
			НСтр("ru = 'Для автоматического расчета необходимо очистить сумму взаиморасчета после корректировки.'"));

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СуммаВзаиморасчетов");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

		Если Выборка.ТипПроверки = "НеУказанаСуммаВзаиморасчетовПосле" Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияНеЗаполненаКолонкаСуммыВознаграждения,
			НСтр("ru = 'Сумма взаиморасчетов после корректировки.'"),
			Выборка.НомерСтроки,
			ПредставлениеТЧ,
			НСтр("ru = 'Для автоматического расчета необходимо очистить сумму взаиморасчета до корректировки.'"));

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ,
			Выборка.НомерСтроки,
			"СуммаВзаиморасчетовПосле");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Неопределено,
			Поле,
			"",
			Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
