
&ИзменениеИКонтроль("ПроверитьДублиСчетФактуры")
Процедура ЕТС_ПроверитьДублиСчетФактуры(Отказ)

	УстановитьПривилегированныйРежим(Истина);

#Удаление
	Блокировка = Новый БлокировкаДанных;

	Для каждого СтрокаДокОснование Из ДокументыОснования Цикл
		ЭлементБлокировки = Блокировка.Добавить(СтрокаДокОснование.ДокументОснование.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаДокОснование.ДокументОснование);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	КонецЦикла;

	Попытка
		Блокировка.Заблокировать();
	Исключение
		Текст = НСтр("ru = 'Не удалось заблокировать документ-основание Счета-фактуры, возможно документ редактируется другим пользователем.'");
		ОбщегоНазначения.СообщитьПользователю(
		Текст,
		ЭтотОбъект,
		,
		,
		Отказ);
	КонецПопытки;
#КонецУдаления

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ПокупателиПоСчетуФактуре.Покупатель КАК Покупатель,
	|	ПокупателиПоСчетуФактуре.НомерСчетаФактуры КАК НомерСчетаФактуры
	|ПОМЕСТИТЬ ВтПокупателиПоСчетуФактуре
	|ИЗ
	|	&ПокупателиПоСчетуФактуре КАК ПокупателиПоСчетуФактуре
	|;
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка <> &Ссылка
	|	И ДанныеДокумента.ДокументОснование В (&МассивОснований)
	|	И НЕ ДанныеДокумента.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|	И ДанныеДокумента.Ссылка.Проведен
	|	И НЕ ДанныеДокумента.Ссылка.ПометкаУдаления
	|	И НЕ ДанныеДокумента.Ссылка.Исправление
	|	И НЕ ДанныеДокумента.Ссылка.Перевыставленный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Покупатели КАК Покупатели
	|			ПО ДанныеДокумента.Ссылка = Покупатели.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка <> &Ссылка
	|	И ДанныеДокумента.ДокументОснование В (&МассивОснований)
	|	И ДанныеДокумента.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|	И ДанныеДокумента.Ссылка.Проведен
	|	И НЕ ДанныеДокумента.Ссылка.ПометкаУдаления
	|	И НЕ ДанныеДокумента.Ссылка.Исправление
	|	И (Покупатели.Покупатель, Покупатели.НомерСчетаФактуры) В
	|		(ВЫБРАТЬ ПокупателиПоСчетуФактуре.Покупатель,
	|				ПокупателиПоСчетуФактуре.НомерСчетаФактуры
	|		ИЗ
	|			ВтПокупателиПоСчетуФактуре КАК ПокупателиПоСчетуФактуре)
	|");

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПокупателиПоСчетуФактуре", Покупатели.Выгрузить());
	Запрос.УстановитьПараметр("МассивОснований", ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если НЕ Исправление
			И НЕ ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 по организации %2 уже введен счет-фактура %3'"),
			Выборка.ДокументОснование,
			Выборка.Организация,
			Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			,
			,
			Отказ);

		ИначеЕсли Исправление И СчетФактураОснование <> Выборка.Ссылка Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'На основании документа %1 введен счет-фактура %2. Недопустимо исправление счета-фактуры %3.'"),
			Выборка.ДокументОснование,
			Выборка.Ссылка,
			СчетФактураОснование);
			ОбщегоНазначения.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			,
			,
			Отказ);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ЕТС_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДокументыОснования.Количество() = 1 Тогда
		Дата = ДокументыОснования[0].ДокументОснование.Дата;
		Номер = ДокументыОснования[0].ДокументОснование.Номер;
		ПредставлениеНомера = Номер;
		ДатаВыставления = Дата;
	КонецЕсли;
КонецПроцедуры
