
&НаКлиенте
&ИзменениеИКонтроль("СоздатьЗаданияЗавершение")
Процедура ЕТС_СоздатьЗаданияЗавершение(Результат, ДополнительныеПараметры)

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
	"Обработка.УправлениеПоступлением.Форма.Оповещение.СоздатьЗаданияЗавершение");

	Структура = ДополнительныеПараметры.Структура;

	Ответ = Результат;

	ВыделенныеСтроки = Новый Массив;

	Если ПоВсейНоменклатуре <> 0 Тогда

		Для Каждого СтрМас Из Элементы.ПулНоменклатурыРазмещение.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ПулНоменклатурыРазмещение.ДанныеСтроки(СтрМас);

			СтрТабл = Новый Структура;
			СтрТабл.Вставить("Номенклатура",ДанныеСтроки.Номенклатура);
			СтрТабл.Вставить("Характеристика",ДанныеСтроки.Характеристика);
			СтрТабл.Вставить("Серия",ДанныеСтроки.Серия);
			СтрТабл.Вставить("Назначение",ДанныеСтроки.Назначение);
#Вставка
			СтрТабл.Вставить("Разместить",ДанныеСтроки.Разместить);
			СтрТабл.Вставить("Упаковка",ДанныеСтроки.Упаковка);
#КонецВставки

			ВыделенныеСтроки.Добавить(СтрТабл);

		КонецЦикла;
#Вставка
	Иначе
		Элементы.ПулНоменклатурыРазмещение.ТекущаяСтрока = 1;
		Пока Элементы.ПулНоменклатурыРазмещение.ТекущаяСтрока <> Неопределено Цикл
			ДанныеСтроки = Элементы.ПулНоменклатурыРазмещение.ДанныеСтроки(Элементы.ПулНоменклатурыРазмещение.ТекущаяСтрока);

			СтрТабл = Новый Структура;
			СтрТабл.Вставить("Номенклатура",ДанныеСтроки.Номенклатура);
			СтрТабл.Вставить("Характеристика",ДанныеСтроки.Характеристика);
			СтрТабл.Вставить("Серия",ДанныеСтроки.Серия);
			СтрТабл.Вставить("Назначение",ДанныеСтроки.Назначение);
			СтрТабл.Вставить("Разместить",ДанныеСтроки.Разместить);
			СтрТабл.Вставить("Упаковка",ДанныеСтроки.Упаковка);

			ВыделенныеСтроки.Добавить(СтрТабл);
			
			Элементы.ПулНоменклатурыРазмещение.ТекущаяСтрока = Элементы.ПулНоменклатурыРазмещение.ТекущаяСтрока + 1;

		КонецЦикла;
#КонецВставки
	КонецЕсли;

	Если Ответ = КодВозвратаДиалога.ОК Тогда
#Удаление
		СоздатьЗаданияСервер(ВыделенныеСтроки);
#КонецУдаления
#Вставка
		СсылкаНаДокумент = СоздатьЗаданияСерверДоп(ВыделенныеСтроки);
		ОткрытьФорму("Документ.ОтборРазмещениеТоваров.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаДокумент));
#КонецВставки
	КонецЕсли;

КонецПроцедуры

Функция СоздатьЗаданияСерверДоп(ВыделенныеСтроки)
	
	ТекущийДокумент = НовоеЗаданиеНаРазмещение(Справочники.РабочиеУчастки.ПустаяСсылка());
	
	ТЗ_КРазмещению = ЕТС_ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ВыделенныеСтроки);
	ТЗ_КРазмещению.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ_КРазмещению.ЗаполнитьЗначения(ТекущийДокумент.Склад,"Склад");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_КРазмещению.Номенклатура КАК Номенклатура,
		|	ТЗ_КРазмещению.Упаковка КАК Упаковка,
		|	ТЗ_КРазмещению.Характеристика КАК Характеристика,
		|	ТЗ_КРазмещению.Серия КАК Серия,
		|	ТЗ_КРазмещению.Назначение КАК Назначение,
		|	ТЗ_КРазмещению.Разместить КАК Количество,
		|	ТЗ_КРазмещению.Разместить КАК КоличествоУпаковок,
		|	ТЗ_КРазмещению.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ_КРазмещению КАК ТЗ_КРазмещению
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Упаковка КАК Упаковка,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Серия КАК Серия,
		|	ВТ.Назначение КАК Назначение,
		|	ВТ.Количество КАК Количество,
		|	ВТ.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЕСТЬNULL(ЕТС_ЯчейкиХраненияПоУмолчанию.ОсновнаяЯчейка, NULL) КАК Ячейка
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЕТС_ЯчейкиХраненияПоУмолчанию КАК ЕТС_ЯчейкиХраненияПоУмолчанию
		|		ПО ВТ.Номенклатура = ЕТС_ЯчейкиХраненияПоУмолчанию.Номенклатура
		|			И ВТ.Склад = ЕТС_ЯчейкиХраненияПоУмолчанию.Склад";
	
	Запрос.УстановитьПараметр("ТЗ_КРазмещению",ТЗ_КРазмещению);
	
	ТекущийДокумент.ТоварыРазмещение.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		ПараметрыУказаниСерий = НоменклатураСервер.ПараметрыУказанияСерий(ТекущийДокумент, Документы.ОтборРазмещениеТоваров);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ТекущийДокумент,ПараметрыУказаниСерий.Размещение);
		ТекущийДокумент.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ТекущийДокумент.Ссылка;
	
КонецФункции

Функция ВыбратьВсеСтроки()

	Возврат Истина;	

КонецФункции // ВыбратьВсеСтроки()

