
&ИзменениеИКонтроль("ПроверитьКорректностьЗаполненияДокументаЗакупки")
Процедура ЕТС_ПроверитьКорректностьЗаполненияДокументаЗакупки(ДокументЗакупки, Отказ)
	
	// Если документ уже заполнен некорректно - не будем выполнять запросы	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим доступность ролей
	ОтклонениеОтУсловийЗакупок = ПраваПользователяПовтИсп.ОтклонениеОтУсловийЗакупок();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим нужно ли проверять диапазон допустимых цен
	ВидМаксимальноДопустимыхЦенЗакупки  = Константы.ВидМаксимальноДопустимыхЦенЗакупки.Получить();
	ПроверятьДиапазонЦен                = ЗначениеЗаполнено(ВидМаксимальноДопустимыхЦенЗакупки);
	ЕстьОшибкиСоглашениеНеУказано       = Ложь;
	ИспользоватьРучныеСкидки            = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");
	ИспользоватьНоменклатуруПартнеров   = ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров");
	ИспользоватьСоглашенияСПоставщиками = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками");
	ИспользуетсяЦенообразование25       = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ДокументЗакупки.Дата);
	
	
	ИспользоватьАгентскуюЗакупку			= ПолучитьФункциональнуюОпцию("ИспользоватьОказаниеАгентскихУслугПриЗакупке");
	
	ВсеСтрокиОтменены = Ложь;
	ВозвратМногооборотнойТары = Ложь;
	ПредставлениеПоляСклад = Неопределено;
	
	// Заполним массив необходимых проверок в зависимости от типа документа
	
	МассивПроверок = Новый Массив();
	ИмяТаблицы     = ДокументЗакупки.Метаданные().ПолноеИмя();
	
	Если ИмяТаблицы = "Документ.ЗаказПоставщику" Тогда
		
		ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ДокументЗакупки, "Товары", "Отменено");
		
		НужноСогласовать = ?(ВсеСтрокиОтменены, Ложь, Не ДокументЗакупки.Согласован И Не ОтклонениеОтУсловийЗакупок);
	ИначеЕсли ИмяТаблицы = "Документ.ДоверенностьВыданная"
		ИЛИ ИмяТаблицы = "Документ.ВыкупВозвратнойТарыУПоставщика"
		ИЛИ ИмяТаблицы = "Документ.ВозвратТоваровПоставщику"
		ИЛИ ИмяТаблицы = "Документ.ПоступлениеТоваровНаСклад"
		ИЛИ ИмяТаблицы = "Документ.ВыкупПринятыхНаХранениеТоваров"
		ИЛИ ИмяТаблицы = "Документ.ОтгрузкаТоваровСХранения"
		ИЛИ ИмяТаблицы = "Документ.ОтчетОСписанииТоваровСХранения"
		//++ НЕ УТ

		//++ Устарело_Производство21
		ИЛИ ИмяТаблицы = "Документ.ВыпускПродукции"
		//-- Устарело_Производство21
		ИЛИ ИмяТаблицы = "Документ.ДвижениеПродукцииИМатериалов"

		//-- НЕ УТ
		ИЛИ ИмяТаблицы = "Документ.АктОРасхожденияхПослеОтгрузки"
		ИЛИ ИмяТаблицы = "Документ.ПередачаТоваровМеждуОрганизациями"
		Или ИмяТаблицы = "Документ.АктОРасхожденияхПослеПриемки" Тогда
		НужноСогласовать = Ложь;
	Иначе
		НужноСогласовать = Не ДокументЗакупки.Согласован И Не ОтклонениеОтУсловийЗакупок;
	КонецЕсли;
	
	// СОГЛАШЕНИЕ С ПОСТАВЩИКОМ
	
	Если ИмяТаблицы = "Справочник.СоглашенияСПоставщиками" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		ВозвратМногооборотнойТары = ДокументЗакупки.ВозвращатьМногооборотнуюТару;
		
		Если ПроверятьДиапазонЦен И НужноСогласовать И
			ДокументЗакупки.Статус <> Перечисления.СтатусыСоглашенийСПоставщиками.НеСогласовано Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			Если ИспользуетсяЦенообразование25 Тогда
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазонПредварительнаяОбработка");
			КонецЕсли;
			МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			
		КонецЕсли;
		
		Если ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
			Или ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
			
			МассивПроверок.Добавить("НаличиеУслугИРабот");
		КонецЕсли;
		
	// ЗАКАЗ ПОСТАВЩИКУ
		
	ИначеЕсли ИмяТаблицы = "Документ.ЗаказПоставщику" Тогда
		
		СоглашениеУказано = ЗначениеЗаполнено(ДокументЗакупки.Соглашение);
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		МассивПроверок.Добавить("ВозможностьСписанияТоваровНаРасходы");
#Удаление
		МассивПроверок.Добавить("КонтрольЗаполненияЦенСУчетомОтмененных");
#КонецУдаления
		ВозвратМногооборотнойТары = ДокументЗакупки.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументЗакупки.ТребуетсяЗалогЗаТару;
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;

		Если НЕ ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
			МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		КонецЕсли;
		
		Если НужноСогласовать И
			ДокументЗакупки.Статус <> Перечисления.СтатусыЗаказовПоставщикам.НеСогласован Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если СоглашениеУказано Тогда
				
				Если НЕ ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
					МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
				КонецЕсли;
				МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
				МассивПроверок.Добавить("СоответствиеШапкиУсловиямЗакупок");
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямЗакупок");
				
			Иначе
				
				ЕстьОшибкиСоглашениеНеУказано = ИспользоватьСоглашенияСПоставщиками;
				
			КонецЕсли;
			
			Если ИспользоватьРучныеСкидки
				И ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
				И ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
				МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен Тогда
				Если ИспользуетсяЦенообразование25 Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазонПредварительнаяОбработка");
				КонецЕсли;
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
			Если ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
				И ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи
				И ДокументЗакупки.СуммаДокумента <> 0
				И ДокументЗакупки.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
				
				МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
				МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");
				
			КонецЕсли;
			
		КонецЕсли;
		
		СписокХозяйственныхОперацийИсключающихУслугиИРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслугиИРаботы();
		СписокХозяйственныхОперацийИсключающихРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихРаботы();
		СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы();
		
		Если СписокХозяйственныхОперацийИсключающихУслугиИРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугИРабот");
		ИначеЕсли СписокХозяйственныхОперацийИсключающихРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеРабот");
		ИначеЕсли СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеПрослеживаемыхРабот");
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Получатель'")
		
	//АКТ ПОСЛЕ ПРИЕМКИ
	ИначеЕсли ИмяТаблицы = "Документ.АктОРасхожденияхПослеПриемки" Тогда

		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТоварыБезСкладаВШапке");
		
	// ПРИОБРЕТЕНИЕ ТОВАРОВ И УСЛУГ
		
	ИначеЕсли ИмяТаблицы = "Документ.ПриобретениеТоваровУслуг" Тогда
		
		СоглашениеУказано     = ЗначениеЗаполнено(ДокументЗакупки.Соглашение);
		ЕстьОшибкиСоглашениеНеУказано = ИспользоватьСоглашенияСПоставщиками
		                                И Не СоглашениеУказано
		                                И Не ДокументЗакупки.ПоступлениеПоЗаказам
										И Не ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо
		                                И НужноСогласовать;

		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		
		Если Не ДокументЗакупки.ПоступлениеПоЗаказам И СоглашениеУказано И НужноСогласовать Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
			МассивПроверок.Добавить("СоответствиеШапкиУсловиямЗакупок");
		КонецЕсли;
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		МассивПроверок.Добавить("ВозможностьСписанияТоваровНаРасходы");
		
		ВозвратМногооборотнойТары = ДокументЗакупки.ВернутьМногооборотнуюТару;
		ТребуетсяЗалогЗаТару = ДокументЗакупки.ТребуетсяЗалогЗаТару;
		
		СписокХозяйственныхОперацийИсключающихУслугиИРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслугиИРаботы();
		СписокХозяйственныхОперацийИсключающихРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихРаботы();
		СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы();
		
		Если СписокХозяйственныхОперацийИсключающихУслугиИРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеУслугИРабот");
		ИначеЕсли СписокХозяйственныхОперацийИсключающихРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеРабот");
		ИначеЕсли СписокХозяйственныхОперацийИсключающихПрослеживаемыеРаботы.НайтиПоЗначению(ДокументЗакупки.ХозяйственнаяОперация) <> Неопределено Тогда
			МассивПроверок.Добавить("НаличиеПрослеживаемыхРабот");
		КонецЕсли;
			
		Если НужноСогласовать Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если СоглашениеУказано Тогда
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямЗакупок");
				МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
			КонецЕсли;
			
			Если СоглашениеУказано
				И ИспользоватьРучныеСкидки
				И ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаКомиссию Тогда
				МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
			КонецЕсли;
				
			Если ПроверятьДиапазонЦен Тогда
				Если ИспользуетсяЦенообразование25 Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазонПредварительнаяОбработка");
				КонецЕсли;
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Получатель'")
		
	ИначеЕсли ИмяТаблицы = "Документ.ПередачаТоваровМеждуОрганизациями" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");

	ИначеЕсли ИмяТаблицы = "Документ.ВыкупВозвратнойТарыУПоставщика" Тогда
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
	ИначеЕсли ИмяТаблицы = "Документ.ДоверенностьВыданная" Тогда
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
	//++ НЕ УТ

	//++ Устарело_Производство21
	// ВЫПУСК ПРОДУКЦИИ
	ИначеЕсли ИмяТаблицы = "Документ.ВыпускПродукции" Тогда
		
		Если ДокументЗакупки.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			МассивПроверок.Добавить("КорректностьЗаполненияСклада");
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			Если ДокументЗакупки.ВыпускПоРаспоряжениям Тогда
				МассивПроверок.Добавить("СоответствиеОрганизацииРаспоряжений");
			КонецЕсли; 
		КонецЕсли;
	//-- Устарело_Производство21
		
	
	//++ Устарело_Переработка24
	
	// ПОСТУПЛЕНИЕ ОТ ПЕРЕРАБОТЧИКА
	ИначеЕсли ИмяТаблицы = "Документ.ПоступлениеОтПереработчика" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
	//-- Устарело_Переработка24

	//-- НЕ УТ
		
	// КОРРЕКТИРОВКА ПОСТУПЛЕНИЯ
		
	ИначеЕсли ИмяТаблицы = "Документ.КорректировкаПриобретения" Тогда
		
		ЕстьОшибкиСоглашениеНеУказано = Ложь;
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСклада");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Получатель'");
		
	// ВОЗВРАТ ТОВАРОВ ПОСТАВЩИКУ
		
	ИначеЕсли ИмяТаблицы = "Документ.ВозвратТоваровПоставщику" Тогда
		
		Если ДокументЗакупки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВозвратТоваровКомитенту Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
			МассивПроверок.Добавить("ВременнаяТаблицаТовары");
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
			МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
			
			Если ИспользоватьАгентскуюЗакупку Тогда
				МассивПроверок.Добавить("СоответствиеВалютыПоАгентскойЗакупке");
			КонецЕсли;
			
			МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
			
			ВозвратМногооборотнойТары = ДокументЗакупки.ВозвратПринятойМногооборотнойТары;
			ТребуетсяЗалогЗаТару = ДокументЗакупки.ПредусмотренЗалогЗаТару;
		КонецЕсли;
		
		ПредставлениеПоляСклад = НСтр("ru = 'Отправитель'")
		
	// ОТГРУЗКА ТОВАРОВ С ХРАНЕНИЯ
		
	ИначеЕсли ИмяТаблицы = "Документ.ОтгрузкаТоваровСХранения" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		Если ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
			МассивПроверок.Добавить("КонтрольЗаполненияНазначения");
			Если ДокументЗакупки.ПоЗаказу Тогда
				МассивПроверок.Добавить("КонтрольЗаполненияЗаказаКлиента");
			КонецЕсли;
		КонецЕсли;
		
		ВозвратМногооборотнойТары = Ложь;
		ТребуетсяЗалогЗаТару      = Ложь;
		
	// ПРИЕМКА ТОВАРОВ НА ХРАНЕНИЕ
		
	ИначеЕсли ИмяТаблицы = "Документ.ПриемкаТоваровНаХранение" Тогда
		
		СоглашениеУказано     = ЗначениеЗаполнено(ДокументЗакупки.Соглашение);
		ЕстьОшибкиСоглашениеНеУказано = ИспользоватьСоглашенияСПоставщиками
		                                И Не ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца2_5
		                                И Не СоглашениеУказано
		                                И Не ДокументЗакупки.ПоступлениеПоЗаказам
		                                И НужноСогласовать;

		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		
		Если Не ДокументЗакупки.ПоступлениеПоЗаказам И СоглашениеУказано И НужноСогласовать Тогда
			МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");
			МассивПроверок.Добавить("СоответствиеШапкиУсловиямЗакупок");
		КонецЕсли;
		
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияСкладаВТабличнойЧастиТовары");
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		
		ВозвратМногооборотнойТары = Ложь;
		ТребуетсяЗалогЗаТару = Ложь;
		
		Если НужноСогласовать Тогда
			
			МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
			
			Если СоглашениеУказано Тогда
				МассивПроверок.Добавить("СоответствиеТоваровУсловиямЗакупок");
			КонецЕсли;
			
			Если ПроверятьДиапазонЦен
				И Истина Тогда
				Если ИспользуетсяЦенообразование25 Тогда
					МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазонПредварительнаяОбработка");
				КонецЕсли;
				МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
			КонецЕсли;
			
		КонецЕсли;
		
	//ВЫКУП ПРИНЯТЫХ НА ХРАНЕНИЕ ТОВАРОВ
		
	ИначеЕсли ИмяТаблицы = "Документ.ВыкупПринятыхНаХранениеТоваров" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияМестХранения");
		МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		МассивПроверок.Добавить("КорректностьСуммыИСуммыНДС");
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		ВозвратМногооборотнойТары = Ложь;
		ТребуетсяЗалогЗаТару      = Ложь;
		
	//ОТЧЕТ О СПИСАНИИ ТОВАРОВ С ХРАНЕНИЯ
		
	ИначеЕсли ИмяТаблицы = "Документ.ОтчетОСписанииТоваровСХранения" Тогда
		
		МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
		МассивПроверок.Добавить("ВременнаяТаблицаТовары");
		МассивПроверок.Добавить("КорректностьЗаполненияМестХранения");
		
		Если ДокументЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеПринятыхТоваровНаРасходы
			Или Ложь Тогда
			МассивПроверок.Добавить("КонтрольЗаполненияЦен");
		КонецЕсли;
		
		Если ИспользоватьНоменклатуруПартнеров Тогда
			МассивПроверок.Добавить("КорректностьЗаполненияНоменклатурыПартнера");
		КонецЕсли;
		
		ВозвратМногооборотнойТары = Ложь;
		ТребуетсяЗалогЗаТару      = Ложь;
		
	КонецЕсли;
	
	// Сформируем текст запроса необходимых проверок в соответствие с массивом проверок
	
	ТекстЗапроса     = "";
	ПараметрыЗапроса = Новый Структура();

	ПараметрыЗапроса.Вставить("Дата",                      ДокументЗакупки.Дата);
	ПараметрыЗапроса.Вставить("Ссылка",                    ДокументЗакупки.Ссылка);
	ПараметрыЗапроса.Вставить("ВозвратМногооборотнойТары", ВозвратМногооборотнойТары);
	ПараметрыЗапроса.Вставить("ТребуетсяЗалогЗаТару",      ТребуетсяЗалогЗаТару);
	ПараметрыЗапроса.Вставить("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументЗакупки.Организация));
	ПараметрыЗапроса.Вставить("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ДокументЗакупки.Организация));
	ПараметрыЗапроса.Вставить("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров",
		УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата(1,1,1)));
	ПараметрыЗапроса.Вставить("ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров",
		УчетПрослеживаемыхТоваровЛокализация.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров());
	
	Для Каждого ТекЭлемент Из МассивПроверок Цикл
		
		Если ТекЭлемент = "ВременнаяТаблицаДокументЗакупки" Тогда
			
			СформироватьЗапросВременнаяТаблицаШапкаДокументаЗакупки(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки);
			
		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаТовары" Тогда
			
			СформироватьЗапросВременнаяТаблицаТоварыДокументаЗакупки(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки, ИмяТаблицы);
			
		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаСкладыКорректныеПоСоглашению" Тогда
			
			СформироватьЗапросВременнаяТаблицаСкладыКорректныеПоСоглашению(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "СоответствиеШапкиУсловиямЗакупок" Тогда
			
			СформироватьЗапросШапкаДокументаЗакупки(ТекстЗапроса, ИмяТаблицы);
			
		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаЭтапыГрафикаОплаты" Тогда
			
			СформироватьЗапросВременнаяТаблицаЭтапыОплаты(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки);
			
		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаКурсыВалют" Тогда
			
			СформироватьЗапросВременнаяТаблицаКурсыВалют(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "КорректностьЗаполненияНоменклатурыПартнера" Тогда
			
			НоменклатураПартнеровСервер.СформироватьЗапросКорректностьЗаполненияНоменклатурыПартнера(ТекстЗапроса, ПараметрыЗапроса);
			
		ИначеЕсли ТекЭлемент = "СоответствиеТоваровУсловиямЗакупок" Тогда
			
			СформироватьЗапросТоварыДокументаЗакупки(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "ВхождениеЦенВДопустимыйДиапазон" Тогда
			
			Если ИспользуетсяЦенообразование25 Тогда
				СформироватьЗапросВхождениеЦенВДопустимыйДиапазон2_5(ТекстЗапроса);
			Иначе
				СформироватьЗапросВхождениеЦенВДопустимыйДиапазон(ТекстЗапроса);
			КонецЕсли;
			
		ИначеЕсли ТекЭлемент = "КорректностьЗаполненияАналитикиУслуг" Тогда
			
			СформироватьЗапросКорректностьЗаполненияАналитикиУслуг(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "НаличиеУслугИРабот" Тогда
			
			СформироватьЗапросНаличиеУслугИРаботВДокументеЗакупки(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "НаличиеРабот" Тогда
			
			СформироватьЗапросНаличиеРаботВДокументеЗакупки(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "НаличиеПрослеживаемыхРабот" Тогда
			
			СформироватьЗапросНаличиеПрослеживаемыхРаботВДокументеЗакупки(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "ДопустимостьРучныхСкидокНаценок" Тогда
			
			СформироватьЗапросДопустимостьРучныхСкидокНаценок(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "КорректностьЗаполненияСклада" Тогда
			
			СформироватьЗапросКорректностьЗаполненияСклада(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "КорректностьЗаполненияСкладаВТабличнойЧастиТовары" Тогда
			
			СформироватьЗапросКорректностьЗаполненияСкладовВТабличнойЧастиТовары(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "КорректностьЗаполненияСкладаВТабличнойЧастиТоварыБезСкладаВШапке" Тогда
		
			СформироватьЗапросКорректностьЗаполненияСкладовВТабличнойЧастиТоварыБезСкладаВШапке(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "КорректностьЭтаповГрафикаОплаты" Тогда
			
			СформироватьЗапросКорректностьЭтаповГрафикаОплаты(ТекстЗапроса);
			
		//++ НЕ УТ
		ИначеЕсли ТекЭлемент = "КонтрольЗавершенияРасчетов" Тогда
			
			СформироватьЗапросКонтрольЗавершенияРасчетов(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "КорректностьЗаполненияМестХранения" Тогда
			
			СформироватьЗапросКорректностьЗаполненияМестХранения(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "КонтрольПоступления" Тогда
			
			СформироватьЗапросКонтрольПоступления(ТекстЗапроса);
		//-- НЕ УТ
		
		ИначеЕсли ТекЭлемент = "КонтрольЗаполненияЦенСУчетомОтмененных" Тогда
			
			СформироватьЗапросКонтрольЗаполненияЦенСУчетомОтмененных(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "КонтрольЗаполненияЦен" Тогда
			
			СформироватьЗапросКонтрольЗаполненияЦен(ТекстЗапроса);
			
		ИначеЕсли ТекЭлемент = "СоответствиеОрганизацииРаспоряжений" Тогда
			
			СформироватьЗапросСоответствиеОрганизацииРаспоряжений(ТекстЗапроса);
		
		ИначеЕсли  ТекЭлемент = "КорректностьУказанияСтавкиНДС" Тогда
			
			СформироватьЗапросКорректностьУказанияСтавкиНДСЗакупки(ТекстЗапроса);
		
		ИначеЕсли  ТекЭлемент = "КорректностьСуммыИСуммыНДС" Тогда
			
			СформироватьЗапросКорректностьСуммыИСуммыНДСЗакупки(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "СоответствиеВалютыПоАгентскойЗакупке" Тогда
			
			СформироватьЗапросСоответствиеВалютыПоАгентскойЗакупке(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "КонтрольЗаполненияЗаказаКлиента" Тогда
			
			СформироватьЗапросКонтрольЗаполненияЗаказаКлиента(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "КонтрольЗаполненияНазначения" Тогда
			
			СформироватьЗапросКонтрольНазначения(ТекстЗапроса);
			
		ИначеЕсли  ТекЭлемент = "ВозможностьСписанияТоваровНаРасходы" Тогда
			
			СформироватьЗапросВозможностьСписанияТоваровНаРасходы(ТекстЗапроса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ,ПараметрЗапроса.Значение);
	КонецЦикла;
	
	МассивРезультатов = Запрос.ВыполнитьПакет(); 
	
	// Сообщим пользователю о результатах проверки для каждого результата запроса
	НевозможноПровестиБезСогласования = Ложь;
	Для ТекИндекс = 0 По МассивРезультатов.Количество()-1 Цикл
		
		Выборка = МассивРезультатов[ТекИндекс].Выбрать();
		
		Если МассивПроверок[ТекИндекс] = "СоответствиеШапкиУсловиямЗакупок" Тогда
			
			СообщитьОбОшибкахШапкаДокументаЗакупки(Выборка, ДокументЗакупки, НевозможноПровестиБезСогласования);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЗаполненияНоменклатурыПартнера" Тогда
			
			НоменклатураПартнеровСервер.СообщитьОбОшибкахКорректностьЗаполненияНоменклатурыПартнера(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "СоответствиеТоваровУсловиямЗакупок" Тогда
			
			СообщитьОбОшибкахТоварыДокументаЗакупки(Выборка,ДокументЗакупки, НевозможноПровестиБезСогласования);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "ВхождениеЦенВДопустимыйДиапазон" Тогда
			
			СообщитьОбОшибкахВхождениеЦенВДопустимыйДиапазон(Выборка, ДокументЗакупки, Отказ, ИспользоватьРучныеСкидки);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЗаполненияАналитикиУслуг" Тогда
			
			СообщитьОбОшибкахКорректностьЗаполненияАналитикиУслуг(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "НаличиеУслугИРабот"
			Или МассивПроверок[ТекИндекс] = "НаличиеРабот" Тогда
			
			СообщитьОбОшибкахНаличиеУслугРаботВДокументеЗакупки(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "НаличиеПрослеживаемыхРабот" Тогда
			
			СообщитьОбОшибкахНаличиеПрослеживаемыхРаботВДокументеЗакупки(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "ДопустимостьРучныхСкидокНаценок" Тогда
			
			СообщитьОбОшибкахДопустимостьРучныхСкидокНаценок(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЗаполненияСклада" Тогда
			
			СообщитьОбОшибкахКорректностьЗаполненияСклада(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЗаполненияСкладаВТабличнойЧастиТовары"
			Или МассивПроверок[ТекИндекс] = "КорректностьЗаполненияСкладаВТабличнойЧастиТоварыБезСкладаВШапке" Тогда
			
			СообщитьОбОшибкахКорректностьЗаполненияСкладаВТабличнойЧастиТовары(Выборка, ДокументЗакупки, Отказ, ПредставлениеПоляСклад);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЭтаповГрафикаОплаты" Тогда
			
			СообщитьОбОшибкахКорректностьЭтаповГрафикаОплаты(Выборка, ДокументЗакупки, НевозможноПровестиБезСогласования);
			
		//++ НЕ УТ
		ИначеЕсли МассивПроверок[ТекИндекс] = "КонтрольЗавершенияРасчетов" Тогда
			
			СообщитьОбОшибкахКонтрольЗавершенияРасчетов(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КонтрольПоступления" Тогда
			
			СообщитьОбОшибкахКонтрольПоступления(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьЗаполненияМестХранения" Тогда
			
			СообщитьОбОшибкахКорректностьЗаполненияМестХранения(Выборка, ДокументЗакупки, Отказ);
			
		//-- НЕ УТ
		ИначеЕсли МассивПроверок[ТекИндекс] = "КонтрольЗаполненияЦен"
			ИЛИ МассивПроверок[ТекИндекс] = "КонтрольЗаполненияЦенСУчетомОтмененных" Тогда
			
			СообщитьОбОшибкахКонтрольЗаполненияЦен(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "СоответствиеОрганизацииРаспоряжений" Тогда
			
			СообщитьОбОшибкахСоответствиеОрганизацииРаспоряжений(Выборка, ДокументЗакупки, Отказ);
		
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьУказанияСтавкиНДС" Тогда
			
			СообщитьОбОшибкахКорректностьУказанияСтавкиНДСЗакупки(Выборка, ДокументЗакупки, Отказ);
		
		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьСуммыИСуммыНДС" Тогда
			
			СообщитьОбОшибкахКорректностьСуммыИСуммыНДСЗакупки(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "СоответствиеВалютыПоАгентскойЗакупке" Тогда
			
			СообщитьОбОшибкахСоответствияВалютыПоАгентскойЗакупке(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КонтрольЗаполненияЗаказаКлиента" Тогда
			
			СообщитьОбОшибкахКонтрольЗаказаКлиента(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "КонтрольЗаполненияНазначения" Тогда
			
			СообщитьОбОшибкахКонтрольНазначения(Выборка, ДокументЗакупки, Отказ);
			
		ИначеЕсли МассивПроверок[ТекИндекс] = "ВозможностьСписанияТоваровНаРасходы" Тогда
			
			СообщитьОбОшибкахВозможностьСписанияТоваровНаРасходы(Выборка, ДокументЗакупки, Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СообщитьОбОшибкахСоглашениеНеУказано(ЕстьОшибкиСоглашениеНеУказано, ДокументЗакупки, Отказ);
	
	Если НевозможноПровестиБезСогласования Тогда
		ТекстОшибки = НСтр("ru = 'Недостаточно прав на отклонение от условий закупок.'");
		
		ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовПоставщикам");
		
		Если ИмяТаблицы = "Документ.ЗаказПоставщику" И ИспользоватьСтатусы Тогда 
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Документ необходимо провести в статусе ""На согласовании"".'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			,
			,
			Отказ);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
