
&ИзменениеИКонтроль("ДополнитьТекстЗапросаСтранаПроисхожденияНоменклатуры")
Процедура ЕТС_ДополнитьТекстЗапросаСтранаПроисхожденияНоменклатуры(СтруктураДействий, ОписаниеЗапроса, КэшированныеЗначения)

	Перем Параметры;

	Если ПакетнаяОбработкаТабличнойЧастиСервер.ТребуетсяВыполнитьДействие(
		"ЗаполнитьСтрануПроисхожденияНоменклатуры",
		СтруктураДействий,
		КэшированныеЗначения,
		Параметры) Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсточникДанных.ИдентификаторСтрокиВТ КАК ИдентификаторСтрокиВТ,
		|	ВЫБОР
		|		КОГДА НЕ ИсточникДанных.ВедетсяУчетПоГТД ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|		КОГДА &ПолеНомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) ТОГДА
		|			НомераГТД.СтранаПроисхождения
		|		ИНАЧЕ
#Удаление
		|			СпрНоменклатура.СтранаПроисхождения
#КонецУдаления
#Вставка
		|			ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
#КонецВставки
		|	КОНЕЦ КАК СтранаПроисхождения
		|ИЗ
		|	ВтИсточникДанных КАК ИсточникДанных
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
		|		ПО НомераГТД.Ссылка = &ПолеНомерГТД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СпрНоменклатура.Ссылка = &ПолеНоменклатура";

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерГТД", "ИсточникДанных." + Параметры.НомерГТД);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНоменклатура", "ИсточникДанных." + Параметры.Номенклатура);
		ОписаниеЗапроса.ТекстыЗапросов.Добавить(ТекстЗапроса, "СтранаПроисхожденияНоменклатуры");

	КонецЕсли;

КонецПроцедуры
