
&НаСервереБезКонтекста
&ИзменениеИКонтроль("ПолучитьЗначенияФункциональныхОпций")
Функция ЕТС_ПолучитьЗначенияФункциональныхОпций()

	Результат = Новый Структура();

	Результат.Вставить("ИспользоватьФорматыМагазинов", ПолучитьФункциональнуюОпцию("ИспользоватьФорматыМагазинов"));
	Результат.Вставить("ИспользоватьСоглашенияСКлиентами", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
#Удаление
	Результат.Вставить("ИспользоватьПартнеровИКонтрагентов", ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов"));
#КонецУдаления
#Вставка
	Результат.Вставить("ИспользоватьПартнеровИКонтрагентов", Истина);
#КонецВставки
	Результат.Вставить("ИспользоватьНесколькоСкладов", ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов"));

	Возврат Результат;	
КонецФункции
