
&Перед("ПриСозданииНаСервере")
Процедура ЕТС_ПриСозданииНаСервере1(Форма, Отказ, СтандартнаяОбработка)
	//Если Не РольДоступна("ЕТС_Администратор") Тогда
	//	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов" Тогда
	//		ИмяМетаданных = "ДокументЗаказКлиента";
	//		ЕТС_ПрограммныеФормы.ОграничитьФормуСпискаПоСкладам(Форма.Список,ИмяМетаданных);	
	//	ИначеЕсли Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка" Тогда
	//		ИмяМетаданных = "РеализацияТоваровУслуг";
	//		ЕТС_ПрограммныеФормы.ОграничитьФормуСпискаПоСкладам(Форма.СписокРеализацииТоваровУслуг,ИмяМетаданных);	
	//	ИначеЕсли Форма.ИмяФормы = "Справочник.Склады.Форма.ФормаВыбора" Тогда  
	//		ИмяМетаданных = "СправочникСклады";
	//		ЕТС_ПрограммныеФормы.ОграничитьФормуСпискаПоСкладам(Форма.Список,ИмяМетаданных);	
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&После("ПриСозданииНаСервере")
Процедура ЕТС_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаКоммерческоеПредложениеКлиенту(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ОтветственныеЛицаОрганизаций.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаОтветственныеЛицаОрганизаций(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ОтветственныеЛицаОрганизаций.Форма.ФормаСписка" Тогда
		МодифицироватьФормуСпискаСправочникаОтветственныеЛицаОрганизаций(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.СтруктураПредприятия.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаСтруктураПредприятия(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаДоговорыКонтрагентов(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.СкладскиеЯчейки.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаСкладскиеЯчейки(Форма); 
	ИначеЕсли Форма.ИмяФормы = "Справочник.ВидыЦен.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаВидыЦен(Форма);     
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда
		МодифицироватьФормуСправочникаПартнеры(Форма);     
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаЗаказКлиента(Форма);  	
//	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСписка" Тогда
//		МодифицироватьФормуСпискаЗаказКлиента(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов" Тогда
		МодифицироватьФормуСпискаЗаказКлиента(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ТаможеннаяДекларацияИмпорт.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаТаможеннаяДекларацияИмпорт(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда
		МодифицироватьФормуСправочникаПартнерыПомощник(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаЗаказПоставщику(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьНаФормуНазначение_АналитикуУчетаНоменклатуры(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьНаФормуНазначение_АналитикуУчетаНоменклатуры(Форма);  	
		МодифицироватьФормуДокументаПриобретениеТоваровУслуг(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ПриобретениеУслугПрочихАктивов.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаПриобретениеУслугПрочихАктивов(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
		ДобавитьНаФормуНазначение_АналитикуУчетаНоменклатуры(Форма);
		МодифицироватьФормуДокументаПеремещениеТоваров(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаЗаказНаПеремещение(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаВозвратТоваровПоставщику(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ПроизводствоБезЗаказа.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаПроизводствоБезЗаказа(Форма);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЭлектронныйДокументВходящийЭДО.Форма.ПодборДокументовУчета" Тогда
		МодифицироватьФормуДокументаЭлектронныйДокументВходящийЭДОПодборДокументовУчета(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		МодифицироватьФормуДокументаРасходныйОрдерНаТовары(Форма);  	
	КонецЕсли;

КонецПроцедуры

&После("ПриЧтенииНаСервере")
Процедура ЕТС_ПриЧтенииНаСервере(Форма, ТекущийОбъект)
	//Если Форма.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Или 
	//							Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
	Если Форма.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Тогда
		ДополнитьФормуДокумента(Форма);
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписьюНаСервере")
Процедура ЕТС_ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ТаможеннаяДекларацияИмпорт") И Не ЗначениеЗаполнено(ТекущийОбъект.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru='Укажите подразделение!'"),
		ТекущийОбъект,
		,,
		Отказ);
	КонецЕсли; 
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаКоммерческоеПредложениеКлиенту(Форма)
	
	Элементы 							= Форма.Элементы;
	
	
	
	//Если Форма.Объект.Клиент = Справочники.Партнеры.НеизвестныйПартнер Тогда
	//	НоваяКоманда = Форма.Команды.Добавить("СоздатьКонтрагента");
	//	НоваяКоманда.Действие = "СоздатьКонтрагентаНаКлиенте";//Имя процедуры
	//	НоваяКоманда.Заголовок = "Создать контрагента";
	//	
	//	НовыйЭлемент = Элементы.Добавить("СоздатьКонтрагента",
	//	                                 Тип("КнопкаФормы"),
	//									 Элементы.ГруппаКлиентКонтрагент);
	//	НовыйЭлемент.ИмяКоманды = "СоздатьКонтрагента";
	//КонецЕсли;
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_СвязанныеДокументыКоманда");
	НоваяКоманда.Действие = "ЕТС_СвязанныеДокументы";//Имя процедуры
	НоваяКоманда.Заголовок = "";
	НоваяКоманда.Картинка = БиблиотекаКартинок.СтруктураПодчиненности;
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_СвязанныеДокументыКоманда",
	                                 Тип("КнопкаФормы"),
									 Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЕТС_СвязанныеДокументыКоманда";
	
	//КомандаСвязанныеДокументы = Форма.Команды.Найти("ПодменюОтчетыСмТакже__Авто_DFF4A1BC964F18C76E1B5EA04556DBE9");
	//
	//КомандаСвязанныеДокументы.Заголовок = "";
	//
	//НовыйЭлемент = Элементы.Добавить("ЕТС_СвязанныеДокументыКоманда1",
	//                                 Тип("КнопкаФормы"),
	//								 Форма.КоманднаяПанель);
	//НовыйЭлемент.ИмяКоманды = "ПодменюОтчетыСмТакже__Авто_DFF4A1BC964F18C76E1B5EA04556DBE9";
	//НовыйЭлемент.Заголовок = " ";
	
	
	НовыйЭлемент                        = Элементы.Добавить("ЕТС_Подразделение", Тип("ПолеФормы"),Элементы.ГруппаКлиентКонтрагент);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	        = Истина;
	НовыйЭлемент.Заголовок  	        = "Подразделение";
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина  	= 28;
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_Подразделение";
	
	Элементы.Переместить(Элементы.Статус, Элементы.ГруппаКлиентКонтрагент);
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_ДатаЗаказаНаСайте", Тип("ПолеФормы"),Элементы.ГруппаДополнительноПраво,Элементы.ДекорацияДополнительноПравоПустая);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Доступность	        = Ложь;
	НовыйЭлемент.Заголовок  	        = "Дата заказа на сайте";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_ДатаЗаказаНаСайте";
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ТоварыВидЦены.Доступность  = Ложь;
	КонецЕсли;
	
	Элементы.ТоварыЦена.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ТоварыСумма.АвтоОтметкаНезаполненного = Ложь;
	
	//Добавим Таблицу значений на форму Начало
	МассивДобавляемыхРеквизитов = Новый Массив;
	
    //добавить реквизит ТЗ
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаОстатков", Новый ОписаниеТипов("ТаблицаЗначений")));
    
    //добавить каждую колонку как отдельный реквизит
	//МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"),"ТаблицаОстатков" ,"Склад"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Склад", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)),"ТаблицаОстатков" ,"Склад"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВНаличии", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаОстатков" ,"ВНаличии"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВРезерве", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаОстатков" ,"ВРезерве"));
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
    ТаблицаФормы = Элементы.Вставить("ТаблицаОстатков", Тип("ТаблицаФормы"),Элементы.СтраницаТоварыУслуги,Элементы.ГруппаПодвалТекущееПредложение);
	ТаблицаФормы.ПутьКДанным = "ТаблицаОстатков";
	//ТаблицаФормы.ПоложениеСостоянияПросмотра = ПоложениеСостоянияПросмотра.Нет;
	ТаблицаФормы.КоманднаяПанель.Видимость = Ложь;
	//ТаблицаФормы.АвтоМаксимальнаяВысота = Ложь;
	//ТаблицаФормы.МаксимальнаяВысота  	= 2;
	//ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
    
    НоваяКолонка = Элементы.Добавить("ТаблицаОстатковСклад", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.Склад";
	НоваяКолонка.Заголовок = "Склад";
    НоваяКолонка = Элементы.Добавить("ТаблицаОстатковВНаличии", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.ВНаличии";
	НоваяКолонка.Заголовок = "В наличии";
	НоваяКолонка = Элементы.Добавить("ТаблицаОстатковВРезерве", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.ВРезерве";
	НоваяКолонка.Заголовок = "В резерве";
	//Добавим Таблицу значений на форму Конец
	ОбъектФормы = Форма.Объект;
	Если Не ЗначениеЗаполнено(ОбъектФормы.Ссылка) Тогда
		ЕТС_ПрограммныеФормы.ДокументДополнитьФорму(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаЗаказКлиента(Форма)
	
	Элементы 							= Форма.Элементы;
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_СвязанныеДокументыКоманда");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	НоваяКоманда.Заголовок = "";
	НоваяКоманда.Картинка = БиблиотекаКартинок.СтруктураПодчиненности;
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_СвязанныеДокументыКоманда",
	                                 Тип("КнопкаФормы"),
									 Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЕТС_СвязанныеДокументыКоманда";
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_ЗаполнитьПоОстаткам");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Заполнить по остаткам";
	//НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
	НовыйЭлемент = Элементы.Вставить("ЕТС_ЗаполнитьПоОстаткам",
	                                 Тип("КнопкаФормы"),
									 Элементы.ТоварыГруппаЗаполнить, Элементы.ТоварыОткрытьПодбор);
	НовыйЭлемент.ИмяКоманды = "ЕТС_ЗаполнитьПоОстаткам";
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_СформироватьЗаказыПоПотребностям");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Сформировать заказы по потребностям";
	НовыйЭлемент = Элементы.Вставить("ЕТС_СформироватьЗаказыПоПотребностям",
	                                 Тип("КнопкаФормы"),
									 Элементы.ТоварыГруппаЗаполнить, Элементы.ТоварыОткрытьПодбор);
	НовыйЭлемент.ИмяКоманды = "ЕТС_СформироватьЗаказыПоПотребностям";
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_ДатаЗаказаНаСайте", Тип("ПолеФормы"),Элементы.ГруппаПараметрыЛево);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Доступность	        = Ложь;
	НовыйЭлемент.Заголовок  	        = "Дата заказа на сайте";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_ДатаЗаказаНаСайте";
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_НомерЗаказаКлиентаНаСайте", Тип("ПолеФормы"),Элементы.ГруппаПараметрыЛево);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Доступность	        = Ложь;
	НовыйЭлемент.Заголовок  	        = "Номер заказа на сайте";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_НомерЗаказаКлиентаНаСайте";
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_ЗаказНаряд", Тип("ПолеФормы"), Элементы.ГруппаПараметрыПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.ЕТС_ЗаказНаряд";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Заказ наряд";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ЕТС_ЗаказНарядПриИзменении");
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_Автомобиль", Тип("ПолеФормы"),Элементы.ГруппаПараметрыПраво);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость	      		= Форма.Объект.ЕТС_ЗаказНаряд;
	НовыйЭлемент.Заголовок  	        = "Автомобиль";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_Автомобиль";
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_Гарантия", Тип("ПолеФормы"),Элементы.ГруппаПараметрыПраво);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость	      		= Форма.Объект.ЕТС_ЗаказНаряд;
	НовыйЭлемент.Заголовок  	        = "Гарантия";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_Гарантия";
	
	НовыйЭлемент                        = Элементы.Вставить("ЕТС_Рекомендации", Тип("ПолеФормы"),Элементы.ГруппаПараметрыПраво);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость	      		= Форма.Объект.ЕТС_ЗаказНаряд;
	НовыйЭлемент.Заголовок  	        = "Рекомендации";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_Рекомендации";
	
	//НовыйЭлемент                        = Элементы.Добавить("ЕТС_КоммерческоеПредложение", Тип("ПолеФормы"),Элементы.Товары);
	//НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.КнопкаВыбора	        = Истина;
	//НовыйЭлемент.Заголовок  	        = "Ком. предложение";
	//НовыйЭлемент.ПутьКДанным 	        = "Объект.Товары.ЕТС_КоммерческоеПредложение";
	
	НоваяКолонка = Элементы.Добавить("ТоварыАвиа", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_АвиаПеревозка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.Заголовок = "Авиа";
	
	НоваяКолонка = Элементы.Добавить("ТоварыЗакупочнаяЦена", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_ЗакупочнаяЦена";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Заголовок = "Закупочная цена";
	
	Элементы.Переместить(Элементы.Подразделение, Элементы.ГруппаСтатусПриоритет, Элементы.Приоритет);
	
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	//
	//СписокТипов = Новый Массив;
	//СписокТипов.Добавить(Тип("СправочникСсылка.Склады"));
	//СписокТипов.Добавить(Тип("СправочникСсылка.Партнеры"));
	//ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов);
	//
	//МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Поставщик", ОписаниеСоставногоТипа,"Объект.Товары" ,"Поставщик"));
	//
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Поставщик", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)),"Объект.Товары" ,"Поставщик"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Резерв", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)),"Объект.Товары" ,"Резерв"));
	
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаОстатков", Новый ОписаниеТипов("ТаблицаЗначений")));
    
    //добавить каждую колонку как отдельный реквизит
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Склад", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)),"ТаблицаОстатков" ,"Склад"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВНаличии", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаОстатков" ,"ВНаличии"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВРезерве", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаОстатков" ,"ВРезерве"));
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	//НоваяКолонка = Элементы.Вставить("ТоварыПоставщик", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыВидЦены);
	//НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_Поставщик";
	//НоваяКолонка.Заголовок = "Поставщик";
	
	НоваяКолонка = Элементы.Вставить("ТоварыПоставщик", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыВидЦены);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.Поставщик";
	НоваяКолонка.Заголовок = "Поставщик";
	
	//НоваяКолонка = Элементы.Вставить("ТоварыРезерв", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыДоступно);
	//НоваяКолонка.ПутьКДанным = "Объект.Товары.Резерв";
	//НоваяКолонка.Заголовок = "Резерв";
	//НоваяКолонка.Формат = "ЧДЦ=3; ЧН=0";
	
    ТаблицаФормы = Элементы.Вставить("ТаблицаОстатков", Тип("ТаблицаФормы"),Элементы.ГруппаТовары,Элементы.ГруппаТоварыПодвал);
	ТаблицаФормы.ПутьКДанным = "ТаблицаОстатков";
	ТаблицаФормы.КоманднаяПанель.Видимость = Ложь;
    
    НоваяКолонка = Элементы.Добавить("ТаблицаОстатковСклад", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.Склад";
	НоваяКолонка.Заголовок = "Склад";
    НоваяКолонка = Элементы.Добавить("ТаблицаОстатковВНаличии", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.ВНаличии";
	НоваяКолонка.Заголовок = "В наличии";
	НоваяКолонка = Элементы.Добавить("ТаблицаОстатковВРезерве", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаОстатков.ВРезерве";
	НоваяКолонка.Заголовок = "В резерве";
	
	Форма.Элементы.ТоварыГруппаОтправитель.Видимость = Ложь; 
	Форма.Элементы.ТоварыСодержание.Видимость = Ложь;
	
	Форма.Элементы.ТоварыВидЦены.КнопкаВыпадающегоСписка = Ложь;
	Форма.Элементы.ТоварыВидЦены.КнопкаОчистки = Ложь;
	Форма.Элементы.ТоварыВидЦены.КнопкаВыбора = Истина;
	Форма.Элементы.ТоварыВидЦены.РедактированиеТекста = Ложь;
	Форма.Элементы.ТоварыВидЦены.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Форма.Элементы.ТоварыВидЦены.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбъектФормы = Форма.Объект;
	
	ЕТС_ОбщегоНазначения.ЗаполнитьПоставщикаВЗаказеКлиента(Форма);
	
	Если РольДоступна("ЕТС_Администратор") Тогда
		//НоваяКолонка = Элементы.Вставить("ЕТС_Обособленно", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыОбособленно);
		//НоваяКолонка.ПутьКДанным = "Объект.Товары.Обособленно";
		//НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
		//НоваяКолонка.Заголовок = "ЕТС_Обособленно";

		НоваяКолонка = Элементы.Вставить("ЕТС_Склад", Тип("ПолеФормы"), Элементы.Товары);
		НоваяКолонка.ПутьКДанным = "Объект.Товары.Склад";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Заголовок = "Склад";
		
		НоваяКолонка = Элементы.Вставить("ЕТС_НомерАльфа", Тип("ПолеФормы"), Элементы.Товары);
		НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_НомерАльфа";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Заголовок = "Номер Альфа";
		
		НоваяКолонка = Элементы.Вставить("ЕТС_ДатаАльфа", Тип("ПолеФормы"), Элементы.Товары);
		НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_ДатаАльфа";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Заголовок = "Дата Альфа";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура МодифицироватьФормуСпискаЗаказКлиента(Форма)

	Элементы 							= Форма.Элементы;
		
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_СвязанныеДокументыКоманда");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	НоваяКоманда.Заголовок = "";
	НоваяКоманда.Картинка = БиблиотекаКартинок.СтруктураПодчиненности;
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_СвязанныеДокументыКоманда",
	                                 Тип("КнопкаФормы"),
									 Элементы.Список.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЕТС_СвязанныеДокументыКоманда";
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_Обновить");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	НоваяКоманда.Заголовок = "";
	НоваяКоманда.Картинка = БиблиотекаКартинок.Обновить;
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_Обновить",
	                                 Тип("КнопкаФормы"),
									 Элементы.Список.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЕТС_Обновить";	
	
	НоваяКолонка = Элементы.Добавить("Минимум", Тип("ПолеФормы"),Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.Минимум";
	НоваяКолонка.Заголовок = "Минимум";
	НоваяКолонка.Видимость = Ложь;
	
	НоваяКолонка = Элементы.Добавить("Максимум", Тип("ПолеФормы"),Элементы.Список);
	НоваяКолонка.ПутьКДанным = "Список.Максимум";
	НоваяКолонка.Заголовок = "Максимум";
	НоваяКолонка.Видимость = Ложь;	

	МассивДобавляемыхРеквизитов = Новый Массив;
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаДвижений", Новый ОписаниеТипов("ТаблицаЗначений")));
    
    //добавить каждую колонку как отдельный реквизит
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НомерСтроки", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10)), "ТаблицаДвижений" ,"НомерСтроки"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Артикул", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)),"ТаблицаДвижений" ,"Артикул"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "ТаблицаДвижений" ,"Номенклатура"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Количество"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Резерв", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Резерв"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Собирается", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Собирается"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Собрано", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Собрано"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Оформить", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Оформить"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Отгрузить", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Отгрузить"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВПути", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"ВПути"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Остаток", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Остаток"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Распр", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Распр"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"), "ТаблицаДвижений" ,"ВидЦены"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Цена", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Цена"));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Сумма", Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)), "ТаблицаДвижений" ,"Сумма"));
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Производитель", Новый ОписаниеТипов("СправочникСсылка.Производители"), "ТаблицаДвижений" ,"Производитель"));
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

    ТаблицаФормы = Элементы.Вставить("ТаблицаДвижений", Тип("ТаблицаФормы"),,Элементы.ПодсказкиБизнесСеть);
	ТаблицаФормы.ПутьКДанным = "ТаблицаДвижений";
	ТаблицаФормы.КоманднаяПанель.Видимость = Ложь;
    
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийНомерСтроки", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.НомерСтроки";
	НоваяКолонка.Заголовок = "НомерСтроки";
    НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийАртикул", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Артикул";
	НоваяКолонка.Заголовок = "Артикул";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийНоменклатура", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Номенклатура";
	НоваяКолонка.Заголовок = "Номенклатура";	
    НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийКоличество", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Количество";
	НоваяКолонка.Заголовок = "Количество";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийРезерв", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Резерв";
	НоваяКолонка.Заголовок = "Резерв";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийСобирается", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Собирается";
	НоваяКолонка.Заголовок = "Собирается";	
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийСобрано", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Собрано";
	НоваяКолонка.Заголовок = "Собрано";	
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийОформить", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Оформить";
	НоваяКолонка.Заголовок = "Оформить";	
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийОтгрузить", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Отгрузить";
	НоваяКолонка.Заголовок = "Отгрузить";	
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийВПути", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.ВПути";
	НоваяКолонка.Заголовок = "В Пути";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийОстаток", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Остаток";
	НоваяКолонка.Заголовок = "Остаток";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийРаспр", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Распр";
	НоваяКолонка.Заголовок = "Распр";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийВидЦены", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.ВидЦены";
	НоваяКолонка.Заголовок = "Поставщик";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийЦена", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Цена";
	НоваяКолонка.Заголовок = "Цена продажная";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийСумма", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Сумма";
	НоваяКолонка.Заголовок = "Сумма продажи";
	НоваяКолонка = Элементы.Добавить("ТаблицаДвиженийПроизводитель", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонка.ПутьКДанным = "ТаблицаДвижений.Производитель";
	НоваяКолонка.Заголовок = "Производитель";
	
	УстановитьУсловноеОформлениеТаблицыДвиженийФормыСпискаЗаказыКлиента(Форма);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеТаблицыДвиженийФормыСпискаЗаказыКлиента(Форма)
	
	//оформим ТаблицаДвижений через Условное оформление
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Остаток" );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Количество" );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Резерв" );
	ЭлементОтбора.Использование = Истина;
	
	ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДвижений");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  Новый Цвет(51, 102, 255));
	
	//ВтороеУсловие
	ЭлементОформления2 = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления2.Использование = Истина;
	ЭлементОформления2.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  Новый Цвет(51, 153, 102));
	
	ГруппаОтбора2 = ЭлементОформления2.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора2.Использование = Истина;
	
	ЭлементОтбора2 = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Остаток" );
	ЭлементОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора2.ПравоеЗначение = 0;
	ЭлементОтбора2.Использование = Истина;
	
	ЭлементОтбора2 = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Количество" );
	ЭлементОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора2.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Резерв" );
	ЭлементОтбора2.Использование = Истина;
	
	ОформляемоеПоле      = ЭлементОформления2.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДвижений");
	
	//ТретьеУсловие
	ЭлементОформления3 = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления3.Использование = Истина;
	ЭлементОформления3.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  Новый Цвет(219, 88, 0));
	
	ГруппаОтбора3 = ЭлементОформления3.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора3.Использование = Истина;
	
	ЭлементОтбора3 = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Количество");
	ЭлементОтбора3.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора3.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Остаток");
	ЭлементОтбора3.Использование = Истина;
	
	ЭлементОтбора3 = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Количество");
	ЭлементОтбора3.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора3.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Резерв");
	ЭлементОтбора3.Использование = Истина;
	
	ЭлементОтбора3 = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Собирается" );
	ЭлементОтбора3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора3.ПравоеЗначение = 0;
	ЭлементОтбора3.Использование = Истина;
	
	ЭлементОтбора3 = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДвижений.Собрано" );
	ЭлементОтбора3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора3.ПравоеЗначение = 0;
	ЭлементОтбора3.Использование = Истина;
	
	ОформляемоеПоле      = ЭлементОформления3.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДвижений");

КонецПроцедуры

Процедура МодифицироватьФормуДокументаЗаказНаПеремещение(Форма)
	
	Элементы 							= Форма.Элементы;
	
	НоваяКолонка = Элементы.Добавить("ТоварыАвиа", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_АвиаПеревозка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.Заголовок = "Авиа";
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаПеремещениеТоваров(Форма)
	
	Элементы 							= Форма.Элементы;
	
	НоваяКолонка = Элементы.Добавить("ТоварыАвиа", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ЕТС_АвиаПеревозка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.Заголовок = "Авиа";
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_ЗаполнитьРезервами");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Заполнить Резервами";
	//НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
	НовыйЭлемент = Элементы.Вставить("ЕТС_ЗаполнитьРезервами",
	                                 Тип("КнопкаФормы"),
									 Элементы.ТоварыГруппаЗаполнить, Элементы.ТоварыПодобратьТовары);
	НовыйЭлемент.ИмяКоманды = "ЕТС_ЗаполнитьРезервами";
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаЗаказПоставщику(Форма)
	
	Элементы 							= Форма.Элементы;
	
	НовыйЭлемент                        = Элементы.Добавить("ЕТС_ВидЦены", Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	        = Истина;
	НовыйЭлемент.Заголовок  	        = "ЕТС Вид цены";
	НовыйЭлемент.ПутьКДанным 	        = "Объект.Товары.ЕТС_ВидЦены";
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_ЗаполнитьИзЗаказов");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Заполнить из заказов";
	НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
	НовыйЭлемент = Элементы.Вставить("ЕТС_ЗаполнитьИзЗаказов",
	                                 Тип("КнопкаФормы"),
									 Элементы.ГруппаТоварыЗаполнить, Элементы.ТоварыПодобратьНоменклатуру);
	НовыйЭлемент.ИмяКоманды = "ЕТС_ЗаполнитьИзЗаказов";
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаПриобретениеТоваровУслуг(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Переместить(Элементы.ГруппаДатаНомерВходящегоДокумента, Элементы.ШапкаЛево, Элементы.НомерДата);
	Элементы.Переместить(Элементы.СтруктурнаяЕдиница, Элементы.ШапкаПраво);
	
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаПриобретениеУслугПрочихАктивов(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Переместить(Элементы.ГруппаДатаНомерВходящий, Элементы.ШапкаЛево, Элементы.НомерДата);
	Элементы.Переместить(Элементы.Подразделение, Элементы.ШапкаПраво);
	
	
КонецПроцедуры

Процедура ДополнитьФормуДокумента(Форма)
	
	ЕТС_ПрограммныеФормы.ДокументДополнитьФорму(Форма);
	
	Если Форма.Объект.Товары.Количество() > 0 Тогда
		Форма.Объект.Товары.Очистить();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	ДанныеТЧ = ЕТС_ПрограммныеФормы.ДокументДополнитьТЧТоварыРеквизитами(Форма.Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	Форма.Объект.Товары.Загрузить(ДанныеТЧ);
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаСоглашенияСКлиентами(Форма)

	Элементы 							= Форма.Элементы;
	НовыйЭлемент                        = Элементы.Добавить("ЕТС_СоглашениеСПоставщиком", Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	        = Истина;
	НовыйЭлемент.Заголовок  	        = "Соглашение с поставщиком";
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина  	= 28;
	НовыйЭлемент.ПутьКДанным 	        = "Объект.ЕТС_СоглашениеСПоставщиком";
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаСтруктураПредприятия(Форма)

	Элементы 					= Форма.Элементы;
	
	НовыйЭлемент 				= Элементы.Вставить("ЕТС_Склад", Тип("ПолеФормы"),,Элементы.Группа1);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.Заголовок  	= "Склад";
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_Склад";
	
	НовыйЭлемент 				= Элементы.Вставить("ЕТС_Префикс", Тип("ПолеФормы"),,Элементы.Группа1);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  	= "Префикс";
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_Префикс";
	
	НовыйЭлемент 				= Элементы.Вставить("ЕТС_Грузоотправитель", Тип("ПолеФормы"),,Элементы.Группа1);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.Заголовок  	= "Грузоотправитель";
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_Грузоотправитель";
	
	НовыйЭлемент 				= Элементы.Вставить("ЕТС_ТиповаяНумерация", Тип("ПолеФормы"),,Элементы.Группа1);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок  	= "Типовая нумерация";
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_ТиповаяНумерация";

КонецПроцедуры

Процедура МодифицироватьФормуСправочникаДоговорыКонтрагентов(Форма)
	
	МассивДобавляемыхРеквизитов = Новый Массив;
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЕТС_ДопСвойстваДоговора", Новый ОписаниеТипов("СправочникСсылка.ЕТС_ДоговорыДопСвойства")));
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Добавить("ЕТС_СоглашениеСКлиентом", Тип("ПолеФормы"),Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_СоглашениеСКлиентом";
	
	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Добавить("ЕТС_СкладПоступления", Тип("ПолеФормы"),Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_СкладПоступления";

	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Добавить("ЕТС_СтатьяРасхода", Тип("ПолеФормы"),Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_СтатьяРасхода";

	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Добавить("ЕТС_Комитент", Тип("ПолеФормы"),Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора	= Истина;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_Комитент";

	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Вставить("ЕТС_ОтсрочкаПлатежа", Тип("ПолеФормы"),Элементы.ГруппаРасчетыЛевая,Элементы.ГруппаНалогообложениеНДС);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ЕТС_ОтсрочкаПлатежа";
	
	НоваяГруппа 					= Элементы.Добавить("ЕТС_ДопСвойстваДоговораГруппа", Тип("ГруппаФормы"),Элементы.СтраницаОсновное);
	НоваяГруппа. Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Заголовок 			= "Дополнительные свойства договора";

	
	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Добавить("ЕТС_ДопСвойстваДоговора", Тип("ПолеФормы"),Элементы.ЕТС_ДопСвойстваДоговораГруппа);
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок	 	= "Доп. свойства";
	НовыйЭлемент.ПутьКДанным 	= "ЕТС_ДопСвойстваДоговора";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭлемент.КнопкаОчистки = Ложь;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	НовыйЭлемент.КнопкаСоздания = Ложь;
	НовыйЭлемент.КнопкаВыбора = Ложь;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_СоздатьДопСвойстваДоговора");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Создать";
	НовыйЭлемент = Элементы.Вставить("ЕТС_СоздатьДопСвойстваДоговора",
	                                 Тип("КнопкаФормы"),
									 Элементы.ЕТС_ДопСвойстваДоговораГруппа);
	НовыйЭлемент.ИмяКоманды = "ЕТС_СоздатьДопСвойстваДоговора";
	
	//Заполним доп. свойства
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Выборка = Справочники.ЕТС_ДоговорыДопСвойства.Выбрать(,Форма.Объект.Ссылка);
		Если Выборка.Следующий() Тогда
			Форма["ЕТС_ДопСвойстваДоговора"] = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаСкладскиеЯчейки(Форма)

	Элементы 					= Форма.Элементы;
	НовыйЭлемент 				= Элементы.Вставить("КодАльфа", Тип("ПолеФормы"));
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  	= "Код Альфа";
	НовыйЭлемент.ПутьКДанным 	= "Объект.КодАльфа";
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаВидыЦен(Форма)

	Элементы 				  		= Форма.Элементы;
	НоваяГруппа 					= Элементы.Добавить("Настройки_ЕТС", Тип("ГруппаФормы"));
	НоваяГруппа. Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Заголовок 			= "Настройки ЕТС";
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_КодПрайса", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  		= "Код прайса";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_КодПрайса";
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_Контрагент", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора		= Истина;
	НовыйЭлемент.Заголовок  		= "Контрагент";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_Контрагент";
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_Склад", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора		= Истина;
	НовыйЭлемент.Заголовок  		= "Склад";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_Склад";

	НовыйЭлемент 					= Элементы.Добавить("ЕТС_СоглашениеСПоставщиком", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыбора		= Истина;
	НовыйЭлемент.Заголовок  		= "Соглашение с поставщиком";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_СоглашениеСПоставщиком";
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_НазваниеССайта", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  		= "Название с сайта";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_НазваниеССайта";
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_ДнейДоставки", Тип("ПолеФормы"), Элементы.Настройки_ЕТС);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  		= "Дней доставки";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_ДнейДоставки";

КонецПроцедуры
	
Процедура МодифицироватьФормуДокументаТаможеннаяДекларацияИмпорт(Форма)

	Элементы = Форма.Элементы;
	
	Элементы.Переместить(Элементы.Подразделение, Элементы.ШапкаДополнительно);

	Элементы.Разделы.Подвал = Истина;
	Элементы.РазделыТаможеннаяСтоимость.ПутьКДаннымПодвала = "Объект.Разделы.ИтогТаможеннаяСтоимость";
	Элементы.РазделыСуммаПошлины.ПутьКДаннымПодвала = "Объект.Разделы.ИтогСуммаПошлины";
	Элементы.РазделыСуммаНДС.ПутьКДаннымПодвала = "Объект.Разделы.ИтогСуммаНДС";
	
	//Элементы.Товары.Подвал = Истина;
	//Элементы.ТоварыТаможеннаяСтоимость.ПутьКДаннымПодвала = "Элементы.ИтогиТоварыСтоимость";
	//Элементы.ТоварыТаможеннаяСтоимость.ТекстПодвала = "0";
	//Элементы.ТоварыСуммаПошлины.ПутьКДаннымПодвала = "Объект.Товары.ИтогСуммаПошлины";
	//Элементы.ТоварыСуммаНДС.ПутьКДаннымПодвала = "Объект.Товары.ИтогСуммаНДС";
	
	НоваяКоманда = Форма.Команды.Добавить("ЗагрузитьИзФайла");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Загрузить из файла";
	
	
	НовыйЭлемент = Элементы.Добавить("ЗагрузитьИзФайла",
	                                 Тип("КнопкаФормы"),
									 Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЗагрузитьИзФайла";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьНачальныйОбраз;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	НоваяКоманда = Форма.Команды.Добавить("ВыгрузитьВАльфу");
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Выгрузить в Альфу";
	
	
	НовыйЭлемент = Элементы.Добавить("ВыгрузитьВАльфу",
	                                 Тип("КнопкаФормы"),
									 Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ВыгрузитьВАльфу";
	//НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьНачальныйОбраз;
	//НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИспользоватьДопАртикул", Новый ОписаниеТипов("Булево")));
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	НовыйЭлемент 					= Элементы.Добавить("ИспользоватьДопАртикул", Тип("ПолеФормы"), Элементы.ГруппаФинучет);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок  		= "Использовать Доп. артикул";
	НовыйЭлемент.ПутьКДанным 		= "ИспользоватьДопАртикул";
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаОтветственныеЛицаОрганизаций(Форма)

	Элементы = Форма.Элементы;
	
	НовыйЭлемент 					= Элементы.Вставить("ЕТС_Подразделение", Тип("ПолеФормы"));
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  		= "Подразделение";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_Подразделение";
	
	НовыйЭлемент 					= Элементы.Вставить("ЕТС_Город", Тип("ПолеФормы"));
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  		= "Город";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_Город";
	
КонецПроцедуры

Процедура МодифицироватьФормуСпискаСправочникаОтветственныеЛицаОрганизаций(Форма)

	Элементы = Форма.Элементы;
	
	НовыйЭлемент 					= Элементы.Вставить("ЕТС_Подразделение", Тип("ПолеФормы"),Форма.Элементы.Список);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок  		= "Подразделение";
	НовыйЭлемент.ПутьКДанным 		= "Список.ЕТС_Подразделение";
	
	НовыйЭлемент 					= Элементы.Вставить("ЕТС_Город", Тип("ПолеФормы"),Форма.Элементы.Список);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок  		= "Город";
	НовыйЭлемент.ПутьКДанным 		= "Список.ЕТС_Город";
	
КонецПроцедуры

Процедура ДобавитьНаФормуНазначение_АналитикуУчетаНоменклатуры(Форма)
	
	Если РольДоступна("ЕТС_Администратор") Тогда
		Элементы 							= Форма.Элементы;
		
		НовыйЭлемент                        = Элементы.Добавить("ЕТС_АналитикаУчетаНоменклатуры", Тип("ПолеФормы"),Элементы.Товары);
		НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыбора	        = Истина;
		НовыйЭлемент.Заголовок  	        = "Аналитика учета номенклатуры";
		НовыйЭлемент.ПутьКДанным 	        = "Объект.Товары.АналитикаУчетаНоменклатуры";
		
		Если Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
			НовыйЭлемент                        = Элементы.Добавить("ЕТС_Назначение", Тип("ПолеФормы"),Элементы.Товары);
			НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.КнопкаВыбора	        = Истина;
			НовыйЭлемент.Заголовок  	        = "Назначение Отправителя";
			НовыйЭлемент.ПутьКДанным 	        = "Объект.Товары.НазначениеОтправителя";
		Иначе 	
			НовыйЭлемент                        = Элементы.Добавить("ЕТС_Назначение", Тип("ПолеФормы"),Элементы.Товары);
			НовыйЭлемент.Вид 			        = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.КнопкаВыбора	        = Истина;
			НовыйЭлемент.Заголовок  	        = "Назначение";
			НовыйЭлемент.ПутьКДанным 	        = "Объект.Товары.Назначение";
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура МодифицироватьФормуСправочникаПартнеры(Форма)

	Элементы 				  		= Форма.Элементы;
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_ПотенциальныйПоставщик", Тип("ПолеФормы"), Элементы.ГруппаОтношения);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Заголовок  		= "Потенциальный поставщик";
	НовыйЭлемент.ПутьКДанным 		= "Объект.ЕТС_ПотенциальныйПоставщик";
	

КонецПроцедуры

Процедура МодифицироватьФормуСправочникаПартнерыПомощник(Форма)

	Элементы 				  		= Форма.Элементы;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЕТС_ПотенциальныйПоставщик", Новый ОписаниеТипов("Булево"),,"ЕТС_ПотенциальныйПоставщик"));
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	НовыйЭлемент 					= Элементы.Добавить("ЕТС_ПотенциальныйПоставщикПомощник", Тип("ПолеФормы"), Элементы.ГруппаТипОтношений);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.Заголовок  		= "Потенциальный поставщик";
	НовыйЭлемент.ПутьКДанным 		= "ЕТС_ПотенциальныйПоставщик";
	

КонецПроцедуры

Процедура МодифицироватьФормуДокументаВозвратТоваровПоставщику(Форма)
	
	Элементы 						= Форма.Элементы;
	
	НоваяКолонка = Элементы.Вставить("ЕТС_СуммаНДС", Тип("ПолеФормы"), Элементы.Товары);
	НоваяКолонка.ПутьКДанным = "Объект.Товары.СуммаНДС";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Заголовок = "НДС_к";

КонецПроцедуры

Процедура МодифицироватьФормуДокументаПроизводствоБезЗаказа(Форма)
	
	Элементы 						= Форма.Элементы;
	
	НоваяКолонка = Элементы.Вставить("ТрудозатратыДатаВыполненияРаботы", Тип("ПолеФормы"), Элементы.Трудозатраты);
	НоваяКолонка.ПутьКДанным = "Объект.Трудозатраты.ДатаВыполненияРаботы";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.Заголовок = "Дата выполнения";

КонецПроцедуры

Процедура МодифицироватьФормуДокументаЭлектронныйДокументВходящийЭДОПодборДокументовУчета(Форма)
	
	Элементы 							= Форма.Элементы;
	
	НоваяКоманда = Форма.Команды.Добавить("ЕТС_ПровестиДокументыУчета");
	//НоваяКоманда.Действие = "ЕТС_СвязанныеДокументы";//Имя процедуры
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";//Имя процедуры
	НоваяКоманда.Заголовок = "Провести все";
	НоваяКоманда.Картинка = БиблиотекаКартинок.Провести;
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	НовыйЭлемент = Элементы.Добавить("ЕТС_ПровестиДокументыУчета",
	                                 Тип("КнопкаФормы"),
									 Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ЕТС_ПровестиДокументыУчета";
	
КонецПроцедуры

Процедура МодифицироватьФормуДокументаРасходныйОрдерНаТовары(Форма)
	
	Элементы 							 = Форма.Элементы;
	
	НоваяГруппа 						 = Элементы.Вставить("Доставка_ЕТС", Тип("ГруппаФормы"), Элементы.ГруппаОтгружаемыеТовары);
	НоваяГруппа. Вид 					 = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 			 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Заголовок 				 = "Доставка";
	
	НовыйЭлемент 						 = Элементы.Добавить("ЕТС_СпособДоставки", Тип("ПолеФормы"), Элементы.Доставка_ЕТС);
	НовыйЭлемент.Вид 					 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок  			 = "Способ доставки";
	НовыйЭлемент.ПутьКДанным 			 = "Объект.ЕТС_СпособДоставки";
	
	НовыйЭлемент 						 = Элементы.Добавить("ЕТС_АдресаДоставки", Тип("ПолеФормы"), Элементы.Доставка_ЕТС);
	НовыйЭлемент.Вид 					 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.Заголовок  			 = "Адрес доставки";
	НовыйЭлемент.ПутьКДанным 			 = "Объект.ЕТС_АдресаДоставки";
	
	НовыйЭлемент 						 = Элементы.Добавить("ЕТС_Телефон", Тип("ПолеФормы"), Элементы.Доставка_ЕТС);
	НовыйЭлемент.Вид 					 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.Заголовок  			 = "Телефон";
	НовыйЭлемент.ПутьКДанным 			 = "Объект.ЕТС_Телефон";
	
	//Скроем на форме элементы даставки, т.к. есть свои
	Элементы.ТипОтгрузки.Видимость		 	= Ложь;
	Элементы.ЗаданиеНаПеревозку.Видимость	= Ложь;
	Элементы.ПорядокДоставки.Видимость		= Ложь;
	
	Получатель = Форма.Объект.Получатель;
	
	Если ЗначениеЗаполнено(Получатель) И ТипЗнч(Получатель) = Тип("СправочникСсылка.Партнеры") Тогда
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("Партнер",Получатель);
		GUID = КонтрагентСсылка.УникальныйИдентификатор(); 
		
		Элементы.ЕТС_АдресаДоставки.СписокВыбора.Очистить();
		
		ПараметыСоединения = HTTPСервис.ИнициализироватьПараметрыПодключения();
		//Получим адреса доставки
		ПараметыСоединения.Адрес = "/api/1c/contractor/" + GUID + "/address";
		МассивАдреса = HTTPСервис.ПолучитьДанныеREST_API(ПараметыСоединения);
		Для каждого Стр Из МассивАдреса Цикл
			Элементы.ЕТС_АдресаДоставки.СписокВыбора.Добавить(Стр);
		КонецЦикла;
		
		//Получим телефоны для связи
		ПараметыСоединения.Адрес = "/api/1c/contractor/" + GUID + "/contact";
		МассивТелефоны = HTTPСервис.ПолучитьДанныеREST_API(ПараметыСоединения);
		Для каждого Стр Из МассивТелефоны Цикл
			Элементы.ЕТС_Телефон.СписокВыбора.Добавить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

