
&После("ПриСозданииНаСервере")
Процедура ЕТС_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	Если Форма.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаСписка" Тогда
		МодифицироватьФормуСпискаДокументаКоммерческоеПредложениеКлиенту(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура МодифицироватьФормуСпискаДокументаКоммерческоеПредложениеКлиенту(Форма)

//	
//	Элементы 							= Форма.Элементы;
//	
//	НоваяКоманда = Форма.Команды.Добавить("ЗагрузкаССайта");
//	НоваяКоманда.Действие = "ЗагрузитьССайта";//Имя процедуры
//	НоваяКоманда.Заголовок = "Загрузить с сайта";
//	
//	НовыйЭлемент = Элементы.Добавить("ЗагрузкаССайта",
//	                                 Тип("КнопкаФормы"),
//									 Форма.КоманднаяПанель);
//	НовыйЭлемент.ИмяКоманды = "ЗагрузкаССайта";

КонецПроцедуры
