
&ИзменениеИКонтроль("БлокироватьРаспределениеЗапасов")
Функция ЕТС_БлокироватьРаспределениеЗапасов()
	ПараметрЗапускаПриложения = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска");
#Удаление
	Возврат СтрНайти(ПараметрЗапускаПриложения, "БлокироватьРаспределениеЗапасов") > 0;
#КонецУдаления
#Вставка
	Возврат СтрНайти(ПараметрЗапускаПриложения, "БлокироватьРаспределениеЗапасов") > 0 ИЛИ Константы.ЕТС_БлокироватьРаспределениеЗапасов.Получить();
#КонецВставки

КонецФункции
