
&После("ВыполнитьПереопределяемуюКоманду")
Процедура ЕТС_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	Если Форма.ИмяФормы = "Документ.ТаможеннаяДекларацияИмпорт.Форма.ФормаДокумента" Тогда
		ВыполнитьДополнительнуюКомандуТаможеннаяДекларацияИмпорт(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		ВыполнитьДополнительнуюКомандуЗаказКлиента(Форма, Команда, ДополнительныеПараметры);  	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСпискаДокументов" Тогда
		ВыполнитьДополнительнуюКомандуФормыСпискаЗаказКлиента(Форма, Команда, ДополнительныеПараметры);  		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ВыполнитьДополнительнуюКомандуДоговорыКонтрагентов(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		ВыполнитьДополнительнуюКомандуЗаказПоставщику(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
		ВыполнитьДополнительнуюКомандуПеремещениеТоваров(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаСписка" Тогда
		ВыполнитьДополнительнуюКомандуЗаказКлиентаФормаСписка(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЭлектронныйДокументВходящийЭДО.Форма.ПодборДокументовУчета" Тогда
		ВыполнитьДополнительнуюКомандуЭлектронныйДокументВходящийЭДОПодборДокументовУчета(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуТаможеннаяДекларацияИмпорт(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЗагрузитьИзФайла" Тогда
		Если Форма.Объект.Товары.Количество() >= 1 И ЗначениеЗаполнено(Форма.Объект.Товары[0].ДокументПоступления) Тогда
			//ЕТС_ОбщиеКомандыКлиент.ТаможеннаяДекларацияИмпорт_ЗагрузитьИзФайла(Форма, Команда, ДополнительныеПараметры);
			ЕТС_ОбщиеКомандыКлиент.ТаможеннаяДекларацияИмпорт_ЗагрузитьИзФайлаБезПроизводителя(Форма, Команда, ДополнительныеПараметры);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ нужно ввести на основании!");
		КонецЕсли;
	ИначеЕсли Команда.Имя = "ВыгрузитьВАльфу" Тогда	
		//ETS_Web_Сервисы_Альфа.ПодключитьWebСерверПередатьОбъект(Новый Структура("Ссылка",Форма.Объект.Ссылка));
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Новый Структура("ДокументОбмена,ТипОбъекта",Форма.Объект.Ссылка,""));
		ETS_Web_Сервисы_Альфа.ВыгрузитьОбъекты(МассивОбъектов);
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуЗаказКлиента(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_СвязанныеДокументыКоманда" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиента_ЕТС_СвязанныеДокументыКоманда(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Команда.Имя = "ЕТС_ЗаполнитьПоОстаткам" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиента_ЕТС_ЗаполнитьПоОстаткам(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Команда.Имя = "ЕТС_СформироватьЗаказыПоПотребностям" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиента_ЕТС_СформироватьЗаказыПоПотребностям(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуФормыСпискаЗаказКлиента(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_СвязанныеДокументыКоманда" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиентаСписок_ЕТС_СвязанныеДокументыКоманда(Форма, Команда, ДополнительныеПараметры);
	ИначеЕсли Команда.Имя = "ЕТС_Обновить" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиентаСписок_ЕТС_Обновить(Форма, Команда, ДополнительныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуДоговорыКонтрагентов(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_СоздатьДопСвойстваДоговора" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЕТС_СоздатьДопСвойстваДоговора(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуЗаказПоставщику(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_ЗаполнитьИзЗаказов" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказПоставщика_ЕТС_ЗаполнитьИзЗаказов(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуПеремещениеТоваров(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_ЗаполнитьРезервами" Тогда
		ЕТС_ОбщиеКомандыКлиент.ПеремещениеТоваров_ЕТС_ЗаполнитьРезервами(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуЗаказКлиентаФормаСписка(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_ЗагрузитьССайта" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЗаказКлиента_ЕТС_ЗагрузитьССайта(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуЭлектронныйДокументВходящийЭДОПодборДокументовУчета(Форма, Команда, ДополнительныеПараметры)
	
	Если Команда.Имя = "ЕТС_ПровестиДокументыУчета" Тогда
		ЕТС_ОбщиеКомандыКлиент.ЭлектронныйДокументВходящийЭДО_ЕТС_ПровестиДокументыУчета(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры
