
//&НаКлиенте
//&После("АктивироватьРаздел")
//Процедура ЕТС_АктивироватьРаздел()
//	РазделОтбора = ДанныеТекущегоРаздела(Элементы.Разделы).НомерРаздела;
//	СуммыПоРазделу = ПолучитьИтСуммы(РазделОтбора);
//	Элементы.ТоварыТаможеннаяСтоимость.ТекстПодвала = СуммыПоРазделу.ИтТС;
//	Элементы.ТоварыСуммаПошлины.ТекстПодвала = СуммыПоРазделу.ИтСП;
//	Элементы.ТоварыСуммаНДС.ТекстПодвала = СуммыПоРазделу.ИтСН;
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьИтСуммы(РазделОтбора)
//	ИтогТаможеннаяСтоимость = 0;
//	ИтогСуммаПошлины = 0;
//	ИтогСуммаНДС = 0;
//	Товары = Объект.Товары;
//	Для каждого Стр Из Товары Цикл
//	    Если Стр.НомерРаздела = РазделОтбора Тогда
//			ИтогТаможеннаяСтоимость = ИтогТаможеннаяСтоимость + Стр.ТаможеннаяСтоимость;
//			ИтогСуммаПошлины = ИтогСуммаПошлины + Стр.СуммаПошлины;
//			ИтогСуммаНДС = ИтогСуммаНДС + Стр.СуммаНДС;
//		КонецЕсли;
//	КонецЦикла;

//	Возврат Новый Структура("ИтТС,ИтСП,ИтСН",ИтогТаможеннаяСтоимость,ИтогСуммаПошлины,ИтогСуммаНДС);

//КонецФункции // ПолучитьСумму()

//&НаСервере
//&ИзменениеИКонтроль("РаспределитьНаТоварыСервер")
//Процедура ЕТС_РаспределитьНаТоварыСервер(РаспределятьТаможеннуюСтоимость)
//	Отбор = Новый Структура("НомерРаздела");
//	Если РаспределятьТаможеннуюСтоимость Тогда
//		СписокСтрокРазделов = Элементы.Разделы.ВыделенныеСтроки;
//	Иначе
//		СписокСтрокРазделов = Новый Массив();
//		СписокСтрокРазделов.Добавить(Элементы.Разделы.ТекущаяСтрока);
//	КонецЕсли;
//	Разделы = РаботаСТабличнымиЧастямиКлиентСервер.ЭлементыКоллекции(Объект.Разделы, СписокСтрокРазделов);
//	Для Каждого Раздел Из Разделы Цикл
//		Отбор.НомерРаздела = Раздел.НомерРаздела;
//		ТоварыРаздела = Объект.Товары.Выгрузить(Отбор); // Массив из СтрокаТабличнойЧасти

//		Если ТоварыРаздела.Количество() > 0 Тогда
//			Коэффициенты = ТоварыРаздела.ВыгрузитьКолонку("ТаможеннаяСтоимость");
//			Если РаспределятьТаможеннуюСтоимость Тогда
//				НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.ТаможеннаяСтоимость, Коэффициенты);
//				Если НовыеСуммы <> Неопределено Тогда
//					ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "ТаможеннаяСтоимость");
//				КонецЕсли;
//			КонецЕсли;	
//			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаПошлины, Коэффициенты);
//			Если НовыеСуммы <> Неопределено Тогда
//				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаПошлины");
//			КонецЕсли;
//			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаНДС, Коэффициенты);
//			Если НовыеСуммы <> Неопределено Тогда
//#Удаление
//				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаНДС");
//#КонецУдаления
//#Вставка
//// Здесь можно описать новое поведение.
//				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаНДС");

//#КонецВставки
//			КонецЕсли;
//		КонецЕсли;

//		Для каждого Товар Из ТоварыРаздела Цикл
//			Объект.Товары[Товар.НомерСтроки-1].СтавкаНДС = Раздел.СтавкаНДС;
//			Объект.Товары[Товар.НомерСтроки-1].СтавкаПошлины = Раздел.СтавкаПошлины;
//			Если РаспределятьТаможеннуюСтоимость Тогда
//				Объект.Товары[Товар.НомерСтроки-1].ТаможеннаяСтоимость = ?(Раздел.ТаможеннаяСтоимость <> 0., Товар.ТаможеннаяСтоимость, 0.);
//			КонецЕсли;	
//			Объект.Товары[Товар.НомерСтроки-1].СуммаПошлины = ?(Раздел.СуммаПошлины <> 0., Товар.СуммаПошлины, 0.);
//			Объект.Товары[Товар.НомерСтроки-1].СуммаНДС = ?(Раздел.СуммаНДС <> 0., Товар.СуммаНДС, 0.);
//		КонецЦикла;
//	КонецЦикла;

//	ЗаполнитьЗначенияСвойств(ЭтаФорма, РазностиИтогов(Объект.Разделы, Объект.Товары));
//КонецПроцедуры
