
&НаСервере
Процедура ЕТС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ОрдераВРаботе.ПроизвольныйЗапрос = Истина;
	ОрдераВРаботе.ТекстЗапроса = "ВЫБРАТЬ
	                             |	ОтборРазмещениеТоваров.Ссылка КАК Отбор,
	                             |	ОтборРазмещениеТоваров.Распоряжение КАК Распоряжение,
	                             |	ОтборРазмещениеТоваров.Статус КАК Статус
	                             |ПОМЕСТИТЬ Отборы
	                             |ИЗ
	                             |	Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	                             |ГДЕ
	                             |	НЕ ОтборРазмещениеТоваров.ПометкаУдаления
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	СкладскиеОрдера.Ссылка КАК Ссылка,
	                             |	СкладскиеОрдера.Дата КАК Дата,
	                             |	СкладскиеОрдера.ПометкаУдаления КАК ПометкаУдаления,
	                             |	СкладскиеОрдера.Номер КАК Номер,
	                             |	СкладскиеОрдера.Проведен КАК Проведен,
	                             |	СкладскиеОрдера.Склад КАК Склад,
	                             |	СкладскиеОрдера.Статус КАК Статус,
	                             |	СкладскиеОрдера.ПомещениеОтправитель КАК ПомещениеОтправитель,
	                             |	СкладскиеОрдера.ПомещениеПолучатель КАК ПомещениеПолучатель,
	                             |	СкладскиеОрдера.Приоритет КАК Приоритет,
	                             |	СкладскиеОрдера.ДатаОтгрузки КАК ДатаОтгрузки,
	                             |	СкладскиеОрдера.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	                             |	СкладскиеОрдера.ОтгрузкаПоЗаданиюНаПеревозку КАК ОтгрузкаПоЗаданиюНаПеревозку,
	                             |	СкладскиеОрдера.ПолучательОтправитель КАК ПолучательОтправитель,
	                             |	СкладскиеОрдера.ПорядокДоставки КАК ПорядокДоставки,
	                             |	СкладскиеОрдера.Тип КАК Тип,
	                             |	ЕСТЬNULL(Отборы.Отбор, ЗНАЧЕНИЕ(Документ.ОтборРазмещениеТоваров.ПустаяСсылка)) КАК Отбор,
	                             |	ВЫРАЗИТЬ(СкладскиеОрдера.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	                             |	ЕСТЬNULL(Отборы.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыОтборовРазмещенийТоваров.ПустаяСсылка)) КАК СтатусОтбора
	                             |ИЗ
	                             |	ЖурналДокументов.СкладскиеОрдера КАК СкладскиеОрдера
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Отборы КАК Отборы
	                             |		ПО СкладскиеОрдера.Ссылка = Отборы.Распоряжение
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	СкладскиеОрдера.Ссылка,
	                             |	СкладскиеОрдера.Дата,
	                             |	СкладскиеОрдера.ПометкаУдаления,
	                             |	СкладскиеОрдера.Номер,
	                             |	СкладскиеОрдера.Проведен,
	                             |	СкладскиеОрдера.Склад,
	                             |	СкладскиеОрдера.ПомещениеОтправитель,
	                             |	СкладскиеОрдера.ПомещениеПолучатель,
	                             |	СкладскиеОрдера.Приоритет,
	                             |	СкладскиеОрдера.ДатаОтгрузки,
	                             |	СкладскиеОрдера.ЗаданиеНаПеревозку,
	                             |	СкладскиеОрдера.ОтгрузкаПоЗаданиюНаПеревозку,
	                             |	СкладскиеОрдера.ПолучательОтправитель,
	                             |	СкладскиеОрдера.ПорядокДоставки,
	                             |	СкладскиеОрдера.Тип,
	                             |	ВЫРАЗИТЬ(СкладскиеОрдера.Комментарий КАК СТРОКА(1000)),
	                             |	СкладскиеОрдера.Статус,
	                             |	ЕСТЬNULL(Отборы.Отбор, ЗНАЧЕНИЕ(Документ.ОтборРазмещениеТоваров.ПустаяСсылка)),
	                             |	ЕСТЬNULL(Отборы.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыОтборовРазмещенийТоваров.ПустаяСсылка))";

	НоваяКолонка = Элементы.Добавить("Отбор", Тип("ПолеФормы"), Элементы.ОрдераВРаботе);
    НоваяКолонка.ПутьКДанным	= "ОрдераВРаботе.Отбор";
	НоваяКолонка.Заголовок 		= "Отбор";
	
	НоваяКолонка = Элементы.Добавить("СтатусОтбора", Тип("ПолеФормы"), Элементы.ОрдераВРаботе);
    НоваяКолонка.ПутьКДанным	= "ОрдераВРаботе.СтатусОтбора";
	НоваяКолонка.Заголовок 		= "Статус отбора";
	
КонецПроцедуры
