
&Перед("Печать")
Процедура ЕТС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если ПараметрыПечати.ТипЗадания = "ЗаданиеНаОтбор" Тогда
		ТМ = ЕТС_ОбщегоНазначения.ПреобразоватьМассивВКолонкуТаблицыЗначений(МассивОбъектов,"Объект");

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МассивОбъектов.Объект КАК Объект
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&МассивОбъектов КАК МассивОбъектов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Объект КАК Объект
			|ПОМЕСТИТЬ ВТ_РСО
			|ИЗ
			|	ВТ КАК ВТ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ.Объект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РСО.Объект КАК Объект,
			|	МАКСИМУМ(ЕСТЬNULL(ОтборРазмещениеТоваров.Ссылка, NULL)) КАК Распоряжение
			|ПОМЕСТИТЬ ИТ
			|ИЗ
			|	ВТ_РСО КАК ВТ_РСО
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
			|		ПО ВТ_РСО.Объект = ОтборРазмещениеТоваров.Распоряжение
			|ГДЕ
			|	ОтборРазмещениеТоваров.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_РСО.Объект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Объект КАК Объект,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ИТ.Распоряжение, NULL) ЕСТЬ NULL
			|			ТОГДА ВТ.Объект
			|		ИНАЧЕ ИТ.Распоряжение
			|	КОНЕЦ КАК Распоряжение
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ИТ КАК ИТ
			|		ПО ВТ.Объект = ИТ.Объект";
		Запрос.УстановитьПараметр("МассивОбъектов", ТМ);
		
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение");
		
		МассивОбъектов.Очистить();
		
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(Результат); 
		Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
			Если  СтруктураОбъектов.Ключ =  "Документ.ОтборРазмещениеТоваров" Тогда
				МенеджерОбъекта	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ); 
				//нКоллекция = КоллекцияПечатныхФорм.СкопироватьКолонки();
				нстр = КоллекцияПечатныхФорм.Добавить();
				нстр.ИмяМакета = "СкладскоеЗадание";
				нСтр.ИмяВРЕГ = "СКЛАДСКОЕЗАДАНИЕ";
				нСтр.Экземпляров = 1;
				МенеджерОбъекта.Печать(СтруктураОбъектов.Значение, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
			Иначе 
				Для Каждого стр Из СтруктураОбъектов.Значение Цикл
					МассивОбъектов.Добавить(стр);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если МассивОбъектов.Количество() = 0 Тогда
			Для Каждого стр Из КОллекцияПечатныхФорм Цикл
				Если стр <> нстр Тогда
					КоллекцияПечатныхФорм.Удалить(стр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
