
&НаКлиенте
Процедура ЗагрузитьССайта()

	ЗагрузитьССайтаНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьССайтаНаСервере()

	ЕТС_ОбменССайтом.ПолучитьЗаказыССайта();

КонецПроцедуры

&НаСервере
Процедура ЕТС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
    СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Список.ТекстЗапроса = Список.ТекстЗапроса + 
	
		"
		|ГДЕ
		|	ДокументКоммерческоеПредложениеКлиенту.ЕТС_Подразделение В (&СписокПодразделений)";
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокПодразделений",   СписокПодразделений,   Истина);
	
	ЭтаФорма.Заголовок = "Заказы покупателя с сайта";
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
КонецПроцедуры

 
 
